Repository: pygreece/python-docs-gr
Catalog: faq/extending.po
Languages: el

source: Extending/Embedding FAQ
el: Συχνές ερωτήσεις επέκτασης/ενσωμάτωσης

source: Contents
el: Περιεχόμενα

source: Can I create my own functions in C?
el: Μπορώ να δημιουργήσω τις δικές μου συναρτήσεις στη C;

source: Yes, you can create built-in modules containing functions, variables, exceptions and even new types in C. This is explained in the document :ref:`extending-index`.
el: Ναι, μπορείτε να δημιουργήσετε ενσωματωμένα (built-in) modules που περιέχουν συναρτήσεις, μεταβλητές, εξαιρέσεις και ακόμη και νέους τύπους στην C. Αυτό εξηγείται στο έγγραφο :ref:`extending-index`.

source: Most intermediate or advanced Python books will also cover this topic.
el: Τα περισσότερα βιβλία μεσαίας ή προηγμένης Python θα καλύπτουν επίσης αυτό το θέμα.

source: Can I create my own functions in C++?
el: Μπορώ να δημιουργήσω τις δικές μου συναρτήσεις στη C++;

source: Yes, using the C compatibility features found in C++. Place ``extern "C" { ... }`` around the Python include files and put ``extern "C"`` before each function that is going to be called by the Python interpreter. Global or static C++ objects with constructors are probably not a good idea.
el: Ναι, χρησιμοποιώντας τις δυνατότητες συμβατότητας C που βρίσκονται στη C++. Τοποθετήστε το ``extern "C" { ... }`` γύρω από την Python να περιλαμβάνει αρχεία και τοποθετήστε το ``extern "C"`` πριν από κάθε συνάρτηση που πρόκειται να κληθεί από τον διερμηνέα της Python. Τα καθολικά ή τα στατικά αντικείμενα C++ με constructors μάλλον δεν είναι καλή ιδέα.

source: Writing C is hard; are there any alternatives?
el: Το να γράψει C κάποιος είναι δύσκολο· υπάρχουν άλλες εναλλακτικές;

source: There are a number of alternatives to writing your own C extensions, depending on what you're trying to do.
el: Υπάρχουν διάφορες εναλλακτικές λύσεις για να γράψετε τις δικές σας επεκτάσεις C, ανάλογα με το τι προσπαθείτε να κάνετε.

source: `Cython <https://cython.org>`_ and its relative `Pyrex <https://www.csse.canterbury.ac.nz/greg.ewing/python/Pyrex/>`_ are compilers that accept a slightly modified form of Python and generate the corresponding C code. Cython and Pyrex make it possible to write an extension without having to learn Python's C API.
el: Το `Cython <https://cython.org>`_ και το σχετικό του `Pyrex <https://www.csse.canterbury.ac.nz/greg.ewing/python/Pyrex/>`_ είναι μεταγλωττιστές που δέχονται ελαφρώς τροποποιημένη μορφή της Python και δημιουργούν τον αντίστοιχο C κώδικα. Το Cython και το Pyrex καθιστούν δυνατή τη σύνταξη μιας επέκτασης χωρίς να χρειάζεται να μάθετε το C API της Python.

source: If you need to interface to some C or C++ library for which no Python extension currently exists, you can try wrapping the library's data types and functions with a tool such as `SWIG <https://www.swig.org>`_. `SIP <https://github.com/Python-SIP/sip>`__, `CXX <https://cxx.sourceforge.net/>`_ `Boost <https://www.boost.org/libs/python/doc/index.html>`_, or `Weave <https://github.com/scipy/weave>`_ are also alternatives for wrapping C++ libraries.
el: Εάν χρειάζεται να συνδεθείτε με κάποια βιβλιοθήκη C ή C++ για την οποία δεν υπάρχει αυτήν τη στιγμή επέκταση Python, μπορείτε να δοκιμάσετε να αναδιπλώσετε τους τύπους δεδομένων και τις συναρτήσεις της βιβλιοθήκης με ένα εργαλείο όπως `SWIG <https://www.swig.org>`_. `SIP <https://github.com/Python-SIP/sip>`__, `CXX <https://cxx.sourceforge.net/>`_ `Boost <https://www.boost.org/libs/python/doc/index.html>`_, ή `Weave <https://github.com/scipy/weave>`_ είναι επίσης εναλλακτικές λύσεις για την αναδίπλωση βιβλιοθηκών C++.

source: How can I execute arbitrary Python statements from C?
el: Πως μπορώ να εκτελέσω αυθαίρετες δηλώσεις Python από το C;

source: The highest-level function to do this is :c:func:`PyRun_SimpleString` which takes a single string argument to be executed in the context of the module ``__main__`` and returns ``0`` for success and ``-1`` when an exception occurred (including :exc:`SyntaxError`). If you want more control, use :c:func:`PyRun_String`; see the source for :c:func:`PyRun_SimpleString` in ``Python/pythonrun.c``.
el: Η συνάρτηση υψηλότερου επιπέδου για να γίνει αυτό είναι η :c:func:`PyRun_SimpleString` η οποία εκτελεί ένα όρισμα συμβολοσειράς στο πλαίσιο της ενότητας ``__main__`` και επιστρέφει ``0`` για επιτυχία και ``-1`` όταν συμβαίνει μια εξαίρεση (συμπεριλαμβανομένου του :exc:`SyntaxError`). Εάν θέλετε περισσότερο έλεγχο, χρησιμοποιήστε :c:func:`PyRun_String`· δείτε τον πηγαίο κώδικα :c:func:`PyRun_SimpleString` στο``Python/pythonrun.c``.

source: How can I evaluate an arbitrary Python expression from C?
el: Πώς μπορώ να αξιολογήσω μια αυθαίρετη έκφραση Python από τη C;

source: Call the function :c:func:`PyRun_String` from the previous question with the start symbol :c:data:`Py_eval_input`; it parses an expression, evaluates it and returns its value.
el: Καλέστε τη συνάρτηση :c:func:`PyRun_String` από την προηγούμενη ερώτηση με το σύμβολο έναρξης :c:data:`Py_eval_input`· αναλύει μια παράσταση, την αξιολογεί και επιστρέφει την τιμή της.

source: How do I extract C values from a Python object?
el: Πως μπορώ να εξάγω τιμές C από ένα αντικείμενο Python;

source: That depends on the object's type. If it's a tuple, :c:func:`PyTuple_Size` returns its length and :c:func:`PyTuple_GetItem` returns the item at a specified index. Lists have similar functions, :c:func:`PyList_Size` and :c:func:`PyList_GetItem`.
el: Αυτό εξαρτάται από τον τύπο του αντικειμένου. Εάν είναι μια πλειάδα (tuple), :c:func:`PyTuple_Size` επιστρέφει το μήκος του και το :c:func:`PyTuple_GetItem` επιστρέφει το στοιχείο σε ένα καθορισμένο index. Οι λίστες έχουν παρόμοιες συναρτήσεις, :c:func:`PyList_Size` και :c:func:`PyList_GetItem`.

source: For bytes, :c:func:`PyBytes_Size` returns its length and :c:func:`PyBytes_AsStringAndSize` provides a pointer to its value and its length. Note that Python bytes objects may contain null bytes so C's :c:func:`!strlen` should not be used.
el: Για bytes, :c:func:`PyBytes_Size` επιστρέφει το μήκος του και το :c:func:`PyBytes_AsStringAndSize` παρέχει έναν δείκτη στην τιμή και το μήκος του. Λάβετε υπόψη ότι τα αντικείμενα byte της Python μπορεί να περιέχουν null byte, επομένως η :c:func:`!strlen` της C δεν πρέπει να χρησιμοποιείται.

source: To test the type of an object, first make sure it isn't ``NULL``, and then use :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check`, etc.
el: Για να ελέγξετε τον τύπο ενός αντικειμένου, πρώτα βεβαιωθείτε ότι δεν είναι ``NULL``, και μετά χρησιμοποιήστε τα :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check`, κλπ.

source: There is also a high-level API to Python objects which is provided by the so-called 'abstract' interface -- read ``Include/abstract.h`` for further details. It allows interfacing with any kind of Python sequence using calls like :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem`, etc. as well as many other useful protocols such as numbers (:c:func:`PyNumber_Index` et al.) and mappings in the PyMapping APIs.
el: Υπάρχει επίσης ένα API υψηλού επιπέδου για αντικείμενα Python που παρέχεται από τη λεγόμενη 'abstract' διεπαφή (interface) -- διαβάστε ``Include/abstract.h`` για περισσότερες λεπτομέρειες. Επιτρέπει τη διασύνδεση με κάθε είδους ακολουθίας Python χρησιμοποιώντας κλήσεις όπως :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem`, κλπ. καθώς και πολλά άλλα χρήσιμα πρωτόκολλα όπως αριθμοί (:c:func:`PyNumber_Index` et al.) και αντιστοιχίσεις στον PyMapping APIs.

source: How do I use Py_BuildValue() to create a tuple of arbitrary length?
el: Πώς μπορώ να χρησιμοποιήσω την Py_BuildValue() για να δημιουργήσω μια πλειάδα (tuple) αυθαίρετου μήκους;

source: You can't. Use :c:func:`PyTuple_Pack` instead.
el: Δεν μπορείς. Χρησιμοποιήστε το :c:func:`PyTuple_Pack`.

source: How do I call an object's method from C?
el: Πώς καλώ τη μέθοδο ενός αντικειμένου από τη C;

source: The :c:func:`PyObject_CallMethod` function can be used to call an arbitrary method of an object. The parameters are the object, the name of the method to call, a format string like that used with :c:func:`Py_BuildValue`, and the argument values::
el: Η συνάρτηση :c:func:`PyObject_CallMethod` μπορεί να χρησιμοποιηθεί για την κλήση μιας αυθαίρετης μεθόδου ενός αντικειμένου. Οι παράμετροι είναι το αντικείμενο, το όνομα της μεθόδου προς κλήση, μια συμβολοσειρά μορφής όπως αυτή που χρησιμοποιείται με τη :c:func:`Py_BuildValue`, και τις τιμές ορίσματος::

source: This works for any object that has methods -- whether built-in or user-defined. You are responsible for eventually :c:func:`Py_DECREF`\ 'ing the return value.
el: Αυτό λειτουργεί για κάθε αντικείμενο που έχει μεθόδους -- είτε είναι ενσωματωμένες είτε καθορίζονται από το χρήστη. Είστε υπεύθυνοι εάν τελικά χρησιμοποιήσετε :c:func:`Py_DECREF` στην τιμή επιστροφής.

source: To call, e.g., a file object's "seek" method with arguments 10, 0 (assuming the file object pointer is "f")::
el: Για να καλέσετε, π.χ., τη μέθοδο "seek" ενός αντικειμένου αρχείου με ορίσματα 10, 0 (υποθέτοντας ότι ο δείκτης του αντικειμένου αρχείου είναι "f")::

source: Note that since :c:func:`PyObject_CallObject` *always* wants a tuple for the argument list, to call a function without arguments, pass "()" for the format, and to call a function with one argument, surround the argument in parentheses, e.g. "(i)".
el: Σημειώστε ότι επειδή το :c:func:`PyObject_CallObject` *πάντα* θέλει μια πλειάδα (tuple) για τη λίστα ορισμάτων, για να καλέσει μια συνάρτηση χωρίς ορίσματα, να περάσει "()" για τη μορφή και να καλέσει μια συνάρτηση με ένα όρισμα, περιβάλλουν το όρισμα σε παρένθεση, π.χ. "(i)".

source: How do I catch the output from PyErr_Print() (or anything that prints to stdout/stderr)?
el: Πώς μπορώ να κάνω catch την έξοδο από την PyErr_Print() (ή οτιδήποτε εκτυπώνεται σε stdout/stderr);

source: In Python code, define an object that supports the ``write()`` method. Assign this object to :data:`sys.stdout` and :data:`sys.stderr`. Call print_error, or just allow the standard traceback mechanism to work. Then, the output will go wherever your ``write()`` method sends it.
el: Στον κώδικα Python, ορίστε ένα αντικείμενο που υποστηρίζει τη μέθοδο ``write()``. Αντιστοιχίστε αυτό το αντικείμενο στα :data:`sys.stdout` και :data:`sys.stderr`. Καλέστε το print_error, ή απλώς επιτρέψτε στον τυπικό μηχανισμό ανίχνευσης να λειτουργήσει. Στη συνέχεια, η έξοδος θα πάει οπουδήποτε την στείλει η μέθοδος ``write()``.

source: The easiest way to do this is to use the :class:`io.StringIO` class:
el: Ο ευκολότερος τρόπος για να το κάνετε αυτό είναι να χρησιμοποιήσετε την κλάση :class:`io.StringIO`:

source: A custom object to do the same would look like this:
el: Ένα προσαρμοσμένο αντικείμενο για να κάνει το ίδιο θα μοιάζει με αυτό:

source: How do I access a module written in Python from C?
el: Πως μπορώ να αποκτήσω πρόσβαση σε ένα module γραμμένο σε Python από τη C;

source: You can get a pointer to the module object as follows::
el: Μπορείτε να λάβετε έναν δείκτη στο αντικείμενο του module ως εξής::

source: If the module hasn't been imported yet (i.e. it is not yet present in :data:`sys.modules`), this initializes the module; otherwise it simply returns the value of ``sys.modules["<modulename>"]``. Note that it doesn't enter the module into any namespace -- it only ensures it has been initialized and is stored in :data:`sys.modules`.
el: Εάν το module δεν έχει εισαχθεί ακόμα (δηλαδή δεν υπάρχει ακόμα στο :data:`sys.modules`), αυτό αρχικοποιεί το module· διαφορετικά απλώς επιστρέφει την τιμή του ``sys.modules["<modulename>"]``. Σημειώστε ότι δεν εισάγει το module σε κανένα namespace -- διασφαλίζει μόνο ότι έχει αρχικοποιηθεί και ότι είναι αποθηκευμένη στο :data:`sys.modules`.

source: You can then access the module's attributes (i.e. any name defined in the module) as follows::
el: Μπορείτε στη συνέχεια να αποκτήσετε πρόσβαση στα χαρακτηριστικά του module (δηλαδή οποιοδήποτε όνομα ορίζεται στο module) ως εξής::

source: Calling :c:func:`PyObject_SetAttrString` to assign to variables in the module also works.
el: Η κλήση :c:func:`PyObject_SetAttrString` για αντιστοίχιση σε μεταβλητές στο module λειτουργεί επίσης.

source: How do I interface to C++ objects from Python?
el: Πως διασυνδέομαι με αντικείμενα C++ από την Python;

source: Depending on your requirements, there are many approaches. To do this manually, begin by reading :ref:`the "Extending and Embedding" document <extending-index>`. Realize that for the Python run-time system, there isn't a whole lot of difference between C and C++ -- so the strategy of building a new Python type around a C structure (pointer) type will also work for C++ objects.
el: Ανάλογα με τις απαιτήσεις σας, υπάρχουν πολλές προσεγγίσεις. Για να το κάνετε αυτό χειροκίνητα, ξεκινήστε διαβάζοντας το :ref:`the "Extending and Embedding" document <extending-index>` . Συνειδητοποιήστε ότι για το σύστημα χρόνου εκτελεστή Python, δεν υπάρχει μεγάλη διαφορά μεταξύ C και C++ -- επομένως η στρατηγική της δημιουργίας ενός νέου τύπου Python γύρω από έναν τύπο δομής C (δείκτη) θα λειτουργήσει επίσης για αντικείμενα C++.

source: For C++ libraries, see :ref:`c-wrapper-software`.
el: Για βιβλιοθήκες C++, δείτε :ref:`c-wrapper-software`.

source: I added a module using the Setup file and the make fails; why?
el: Πρόσθεσα ένα module χρησιμοποιώντας το αρχείο Setup και το make αποτυγχάνει· γιατί;

source: Setup must end in a newline, if there is no newline there, the build process fails. (Fixing this requires some ugly shell script hackery, and this bug is so minor that it doesn't seem worth the effort.)
el: Το setup πρέπει να τελειώνει σε μια νέα γραμμή, αν δεν υπάρχει νέα γραμμή, η διαδικασία build αποτυγχάνει. (Για να διορθωθεί αυτό απαιτεί κάποιο κακόβουλο script shell, και αυτό το σφάλμα είναι τόσο μικρό που δεν φαίνεται να αξίζει τον κόπο.)

source: How do I debug an extension?
el: Πως κάνω debug μια επέκταση;

source: When using GDB with dynamically loaded extensions, you can't set a breakpoint in your extension until your extension is loaded.
el: Όταν χρησιμοποιείτε το GDB με δυναμικά φορτωμένες επεκτάσεις, δεν μπορείτε να ορίσετε σημείο διακοπής στην επέκταση σας μέχρι να φορτωθεί η επέκτασής σας.

source: In your ``.gdbinit`` file (or interactively), add the command:
el: Στο αρχείο σας ``.gdbinit`` (ή διαδραστικά), προσθέστε την εντολή:

source: Then, when you run GDB:
el: Στη συνέχεια, όταν εκτελείτε το GDB:

source: I want to compile a Python module on my Linux system, but some files are missing. Why?
el: Θέλω να κάνω compile ένα Python module στο σύστημα Linux μου, αλλά λείπουν ορισμένα αρχεία. Γιατί;

source: Most packaged versions of Python don't include the :file:`/usr/lib/python2.{x}/config/` directory, which contains various files required for compiling Python extensions.
el: Οι περισσότερες συσκευασμένες εκδόσεις της Python δεν περιλαμβάνουν τον κατάλογο :file:`/usr/lib/python2.{x}/config/`, ο οποίος περιέχει διάφορα αρχεία που απαιτούνται για τη μεταγλώττιση των επεκτάσεων Python.

source: For Red Hat, install the python-devel RPM to get the necessary files.
el: Για το Red Hat, εγκαταστήστε το RPM της python-devel για να λάβετε τα απαραίτητα αρχεία.

source: For Debian, run ``apt-get install python-dev``.
el: Για το Debian, εκτελέστε το ``apt-get install python-dev``.

source: How do I tell "incomplete input" from "invalid input"?
el: Πώς μπορώ να ξεχωρίσω την "ελλιπή εισαγωγή" από την "έγκυρη εισαγωγή";

source: Sometimes you want to emulate the Python interactive interpreter's behavior, where it gives you a continuation prompt when the input is incomplete (e.g. you typed the start of an "if" statement or you didn't close your parentheses or triple string quotes), but it gives you a syntax error message immediately when the input is invalid.
el: Μερικές φορές θέλετε να μιμηθείτε τη συμπεριφορά του διαδραστικού διερμηνέα Python, όπου σας δίνει ένα συνεχόμενο prompt όταν η είσοδος είναι ελλιπής (π.χ. πληκτρολογήσατε την αρχή μιας δήλωσης "if" ή δεν κλείσατε τις παρενθέσεις ή τα τριπλά εισαγωγικά συμβολοσειρών), αλλά σας δίνει ένα μήνυμα συντακτικού σφάλματος αμέσως όταν η εισαγωγή δεν είναι έγκυρη.

source: In Python you can use the :mod:`codeop` module, which approximates the parser's behavior sufficiently. IDLE uses this, for example.
el: Στην Python μπορείτε να χρησιμοποιήσετε το module :mod:`codeop`, η οποία προσεγγίζει επαρκώς τη συμπεριφορά του parser. Το IDLE χρησιμοποιεί αυτό, για παράδειγμα.

source: The easiest way to do it in C is to call :c:func:`PyRun_InteractiveLoop` (perhaps in a separate thread) and let the Python interpreter handle the input for you. You can also set the :c:func:`PyOS_ReadlineFunctionPointer` to point at your custom input function. See ``Modules/readline.c`` and ``Parser/myreadline.c`` for more hints.
el: Ο ευκολότερος τρόπος για να το κάνετε στη C είναι να καλέσετε τη :c:func:`PyRun_InteractiveLoop` (ίσως σε ξεχωριστό νήμα (thread)) και να αφήσετε τον διερμηνέα Python να χειριστεί την είσοδο για εσάς. Μπορείτε επίσης να ορίσετε :c:func:`PyOS_ReadlineFunctionPointer` για να δείξετε την δικιάς προσαρμοσμένη συνάρτηση εισαγωγής. Δείτε τα ``Modules/readline.c`` και ``Parser/myreadline.c`` για περισσότερες συμβουλές.

source: How do I find undefined g++ symbols __builtin_new or __pure_virtual?
el: Πώς μπορώ να βρω απροσδιόριστα σύμβολα g++ __builtin_new ή __pure_virtual;

source: To dynamically load g++ extension modules, you must recompile Python, relink it using g++ (change LINKCC in the Python Modules Makefile), and link your extension module using g++ (e.g., ``g++ -shared -o mymodule.so mymodule.o``).
el: Για δυναμική φόρτωση module επέκτασης g++, πρέπει να κάνετε recompile την Python, να τη συνδέσετε ξανά χρησιμοποιώντας g++ (αλλάξτε το LINKCC στο Python Modules Makefile), και να συνδέσετε το module επέκτασης σας χρησιμοποιώντας g++ (π.χ. ``g++ -shared -o mymodule.so mymodule.o``).

source: Can I create an object class with some methods implemented in C and others in Python (e.g. through inheritance)?
el: Μπορώ να δημιουργήσω μια κλάση αντικειμένου με ορισμένες μεθόδους που υλοποιούνται στη C και άλλες στη Python (π.χ. μέσω κληρονομικότητας);

source: Yes, you can inherit from built-in classes such as :class:`int`, :class:`list`, :class:`dict`, etc.
el: Ναι, μπορείτε να κληρονομήσετε από ενσωματωμένες (built-in) κλάσεις όπως :class:`int`, :class:`list`, :class:`dict`, κ.λπ.

source: The Boost Python Library (BPL, https://www.boost.org/libs/python/doc/index.html) provides a way of doing this from C++ (i.e. you can inherit from an extension class written in C++ using the BPL).
el: Η βιβλιοθήκη Boost Python Library (BPL, https://www.boost.org/libs/python/doc/index.html) παρέχει ένα τρόπο για να γίνει αυτό από την C++ (δηλαδή μπορείτε να κληρονομήσετε από μια κλάση επέκτασης γραμμένη σε C++ χρησιμοποιώντας το BPL).
