Repository: pygreece/python-docs-gr
Catalog: faq/programming.po
Languages: el

source: then integer division has to return the floor. C also requires that identity to hold, and then compilers that truncate ``i // j`` need to make ``i % j`` have the same sign as ``i``.
el: τότε η διαίρεση ακεραίου αριθμού πρέπει να επιστρέψει το υπόλοιπο. Η C απαιτεί επίσης να διατηρείται αυτή η ταυτότητα και, στη συνέχεια, οι μεταγλωττιστές που περικόπτουν το ``i // j`` πρέπει να κάνουν το ``i % j`` να έχει το ίδιο πρόσημο με το ``i``.

source: There are few real use cases for ``i % j`` when ``j`` is negative. When ``j`` is positive, there are many, and in virtually all of them it's more useful for ``i % j`` to be ``>= 0``. If the clock says 10 now, what did it say 200 hours ago? ``-190 % 12 == 2`` is useful; ``-190 % 12 == -10`` is a bug waiting to bite.
el: Υπάρχουν λίγες πραγματικές περιπτώσεις χρήσης για το ``i % j`` όταν το ``j`` είναι αρνητικό. Όταν το ``j`` είναι θετικό, υπάρχουν πολλές, και σχεδόν όλες είναι πιο χρήσιμες για ``i % j`` να είναι ``>= 0``. Εάν το ρολόι λέει 10 τι έλεγε πριν από 200 ώρες; ``-190 % 12 == 2`` είναι χρήσιμο∙ το ``-190 % 12 == -10`` είναι ένα σφάλμα που περιμένει να δαγκώσει.

source: How do I get int literal attribute instead of SyntaxError?
el: Πώς μπορώ να πάρω το literal χαρακτηριστικό int αντί για το SyntaxError;

source: Trying to lookup an ``int`` literal attribute in the normal manner gives a :exc:`SyntaxError` because the period is seen as a decimal point::
el: Η προσπάθεια αναζήτησης ενός literal χαρακτηριστικού ``int`` με τον κανονικό τρόπο δίνει ένα :exc:`SyntaxError` επειδή η περίοδος θεωρείται ως υποδιαστολή::

source: The solution is to separate the literal from the period with either a space or parentheses.
el: Η λύση είναι να διαχωριστεί το literal από την τελεία είτε με κενό είτε με παρένθεση.

source: How do I convert a string to a number?
el: Πως μετατρέπω μια συμβολοσειρά σε έναν αριθμό;

source: For integers, use the built-in :func:`int` type constructor, e.g. ``int('144') == 144``. Similarly, :func:`float` converts to floating-point, e.g. ``float('144') == 144.0``.
el: Για ακέραιους αριθμούς, χρησιμοποιήστε τον ενσωματωμένο κατασκευαστή τύπου :func:`int` , π.χ. ``int('144') == 144``. Ομοίως, το :func:`float` μετατρέπει σε κινητή υποδιαστολή π.χ. ``float('144') == 144.0``.

source: By default, these interpret the number as decimal, so that ``int('0144') == 144`` holds true, and ``int('0x144')`` raises :exc:`ValueError`. ``int(string, base)`` takes the base to convert from as a second optional argument, so ``int( '0x144', 16) == 324``. If the base is specified as 0, the number is interpreted using Python's rules: a leading '0o' indicates octal, and '0x' indicates a hex number.
el: Από προεπιλογή, αυτά ερμηνεύουν τον αριθμό ως δεκαδικό, έτσι ώστε ``int('0144') == 144`` να είναι αληθές, και το ``int('0x144')`` να εγείρει :exc:`ValueError`. Το ``int(string, base)`` παίρνει τη βάση για μετατροπή ως δεύτερο προαιρετικό όρισμα, οπότε το ``int( '0x144', 16) == 324``. Εάν η βάση έχει καθοριστεί ως 0, ο αριθμός ερμηνεύεται χρησιμοποιώντας κανόνες της Python: ένα αρχικό '0o' υποδηλώνει οκταδικό , και το '0x' δείχνει έναν δεκαεξαδικό αριθμό.

source: Do not use the built-in function :func:`eval` if all you need is to convert strings to numbers. :func:`eval` will be significantly slower and it presents a security risk: someone could pass you a Python expression that might have unwanted side effects. For example, someone could pass ``__import__('os').system("rm -rf $HOME")`` which would erase your home directory.
el: Μην χρησιμοποιείτε την ενσωματωμένη συνάρτηση :func:`eval` εάν το μόνο που χρειάζεστε είναι να μετατρέψετε συμβολοσειρές σε αριθμούς. :func:`eval` θα είναι σημαντικά πιο αργή και παρουσιάζει κίνδυνο ασφαλείας: κάποιος θα μπορούσε να σας μεταβιβάσει μια έκφραση Python που μπορεί να έχει ανεπιθύμητες παρενέργειες. Για παράδειγμα κάποιος θα μπορούσε να περάσει το ``__import__('os').system("rm -rf $HOME")`` το οποίο θα διαγράψει το home φάκελο.

source: :func:`eval` also has the effect of interpreting numbers as Python expressions, so that e.g. ``eval('09')`` gives a syntax error because Python does not allow leading '0' in a decimal number (except '0').
el: :func:`eval` έχει επίσης ως αποτέλεσμα την ερμηνεία των αριθμών ως εκφράσεις Python, έτσι ώστε π.χ. το ``eval('09')`` δίνει ένα συντακτικό σφάλμα επειδή η Python δεν επιτρέπει την εισαγωγή του '0' σε έναν δεκαδικό αριθμό (εκτός '0').

source: How do I convert a number to a string?
el: Πως μετατρέπω έναν αριθμό σε συμβολοσειρά;

source: To convert, e.g., the number ``144`` to the string ``'144'``, use the built-in type constructor :func:`str`. If you want a hexadecimal or octal representation, use the built-in functions :func:`hex` or :func:`oct`. For fancy formatting, see the :ref:`f-strings` and :ref:`formatstrings` sections, e.g. ``"{:04d}".format(144)`` yields ``'0144'`` and ``"{:.3f}".format(1.0/3.0)`` yields ``'0.333'``.
el: Για να μετατρέψετε, πχ τον αριθμό ``144`` στη συμβολοσειρά ``'144'``, χρησιμοποιείστε τον ενσωματωμένο τύπο κατασκευής :func:`str`. Εάν θέλετε μια δεκαεξαδική ή οκταδική αναπαράσταση, χρησιμοποιήστε τις ενσωματωμένες συναρτήσεις :func:`hex` ή :func:`oct`. Για φανταχτερή μορφοποίηση, βλ. τις ενότητες :ref:`f-strings` και :ref:`formatstrings` π.χ. ``"{:04d}".format(144)`` αποδίδει ``'0144'`` και ``"{:.3f}".format(1.0/3.0)`` αποδίδει ``'0.333'``.

source: How do I modify a string in place?
el: Πώς μπορώ να τροποποιήσω μια συμβολοσειρά στη θέση της;

source: You can't, because strings are immutable. In most situations, you should simply construct a new string from the various parts you want to assemble it from. However, if you need an object with the ability to modify in-place unicode data, try using an :class:`io.StringIO` object or the :mod:`array` module::
el: Δεν μπορείτε, γιατί οι συμβολοσειρές είναι αμετάβλητες. Στις περισσότερες περιπτώσεις θα πρέπει απλώς να δημιουργήσετε μια νέα συμβολοσειρά από τα διάφορα μέρη από τα οποία θέλετε να τη συναρμολογήσετε. Ωστόσο, εάν χρειάζεστε ένα αντικείμενο με δυνατότητα τροποποίησης δεδομένων unicode, δοκιμάστε να χρησιμοποιήσετε ένα αντικείμενο :class:`io.StringIO` ή το module :mod:`array`::

source: How do I use strings to call functions/methods?
el: Πως μπορώ να χρησιμοποιήσω συμβολοσειρές για να καλέσω συναρτήσεις/μεθόδους;

source: There are various techniques.
el: Υπάρχουν διάφορες τεχνικές.

source: The best is to use a dictionary that maps strings to functions. The primary advantage of this technique is that the strings do not need to match the names of the functions. This is also the primary technique used to emulate a case construct::
el: Το καλύτερο είναι να χρησιμοποιήσετε ένα λεξικό που αντιστοιχίζει συμβολοσειρές σε συναρτήσεις. Το κύριο πλεονέκτημα αυτής της τεχνικής είναι ότι οι συμβολοσειρές δεν χρειάζεται να ταιριάζουν με τα ονόματα των συναρτήσεων. Αυτή είναι επίσης η κύρια τεχνική που χρησιμοποιείται για την εξομοίωση μιας κατασκευής πεζών-κεφαλαίων::

source: Use the built-in function :func:`getattr`::
el: Χρησιμοποιείστε την ενσωματωμένη συνάρτηση :func:`getattr`::

source: Note that :func:`getattr` works on any object, including classes, class instances, modules, and so on.
el: Σημειώστε ότι το :func:`getattr` λειτουργεί σε οποιοδήποτε αντικείμενο, συμπεριλαμβανομένων κλάσεων, οντοτήτων κλάσεων, modules, και ούτω καθεξής.

source: This is used in several places in the standard library, like this::
el: Αυτό χρησιμοποιείται σε πολλά σημεία της τυπικής βιβλιοθήκης, όπως αυτό::

source: Use :func:`locals` to resolve the function name::
el: Χρησιμοποιήστε το :func:`locals` για να επιλύσετε το όνομα της συνάρτησης::

source: Is there an equivalent to Perl's chomp() for removing trailing newlines from strings?
el: Υπάρχει ισοδύναμο με το Perl's chomp() για την αφαίρεση των νέων γραμμών από τις συμβολοσειρές;

source: You can use ``S.rstrip("\r\n")`` to remove all occurrences of any line terminator from the end of the string ``S`` without removing other trailing whitespace. If the string ``S`` represents more than one line, with several empty lines at the end, the line terminators for all the blank lines will be removed::
el: Μπορείτε να χρησιμοποιήσετε το ``S.rstrip("\r\n")`` για να αφαιρέσετε όλες τις εμφανίσεις οποιουδήποτε terminator γραμμής από το τέλος της συμβολοσειράς ``S`` χωρίς να αφαιρέσετε άλλα κενά. Η συμβολοσειρά ``S`` αντιπροσωπεύει περισσότερες από μία γραμμές στο τέλος, οι terminators γραμμής για όλες τις κενές γραμμές θα αφαιρεθούν::

source: Since this is typically only desired when reading text one line at a time, using ``S.rstrip()`` this way works well.
el: Δεδομένου ότι αυτό είναι συνήθως επιθυμητό μόνο κατά την ανάγνωση κειμένου μία γραμμή τη φορά, η χρήση του ``S.rstrip()`` λειτουργεί καλά.

source: Is there a scanf() or sscanf() equivalent?
el: Υπάρχει αντίστοιχο scanf() ή sscanf();

source: Not as such.
el: Όχι ως τέτοιο.

source: For simple input parsing, the easiest approach is usually to split the line into whitespace-delimited words using the :meth:`~str.split` method of string objects and then convert decimal strings to numeric values using :func:`int` or :func:`float`. :meth:`!split()` supports an optional "sep" parameter which is useful if the line uses something other than whitespace as a separator.
el: Για απλή ανάλυση εισόδου, η ευκολότερη προσέγγιση είναι συνήθως ο διαχωρισμός της γραμμής σε λέξεις οριοθετημένες με κενά διαστήματα χρησιμοποιώντας τη μέθοδο :meth:`~str.split` αντικειμένων συμβολοσειρών και στη συνέχεια μετατροπή δεκαδικών συμβολοσειρών σε αριθμητικές τιμές χρησιμοποιώντας :func:`int` ή :func:`float`. :meth:`!split()` υποστηρίζει μια προαιρετική παράμετρο "sep" που είναι χρήσιμη εάν η γραμμή χρησιμοποιεί κάτι διαφορετικό από κενό διάστημα ως διαχωριστικό.

source: For more complicated input parsing, regular expressions are more powerful than C's ``sscanf`` and better suited for the task.
el: Για πιο περίπλοκη ανάλυση εισόδου, τα regular expressions είναι πιο ισχυρά από τις ``sscanf`` της C και είναι πιο κατάλληλες για την εργασία.

source: What does 'UnicodeDecodeError' or 'UnicodeEncodeError' error mean?
el: Τι σημαίνει το σφάλμα 'UnicodeDecodeError' ή 'UnicodeEncodeError';

source: See the :ref:`unicode-howto`.
el: Βλ το :ref:`unicode-howto`.

source: Can I end a raw string with an odd number of backslashes?
el: Μπορώ να τερματίσω μια ακατέργαστη συμβολοσειρά με περιττό αριθμό backslashes;

source: A raw string ending with an odd number of backslashes will escape the string's quote::
el: Μια ακατέργαστη συμβολοσειρά που τελειώνει με περιττό αριθμό backslashes θα ξεφύγει από το απόσπασμα της συμβολοσειράς::

source: There are several workarounds for this. One is to use regular strings and double the backslashes::
el: Υπάρχουν αρκετές λύσεις για αυτό. Ο ένας είναι να χρησιμοποιήσετε κανονικές συμβολοσειρές και να διπλασιάσετε τα backslashes::

source: Another is to concatenate a regular string containing an escaped backslash to the raw string::
el: Ένα άλλο είναι να συνδέσετε μια κανονική συμβολοσειρά που περιέχει ένα escaped backslash στην ακατέργαστη συμβολοσειρά::

source: It is also possible to use :func:`os.path.join` to append a backslash on Windows::
el: Είναι επίσης δυνατό να χρησιμοποιήσετε το :func:`os.path.join` για να προσθέσετε ένα backslash στα Windows::

source: Note that while a backslash will "escape" a quote for the purposes of determining where the raw string ends, no escaping occurs when interpreting the value of the raw string. That is, the backslash remains present in the value of the raw string::
el: Λάβετε υπόψη ότι ενώ ένα backslash θα "escape" από ένα εισαγωγικό για τον προσδιορισμό του σημείου που τελειώνει η ακατέργαστη συμβολοσειρά, δεν υπάρχει διαφυγή κατά την ερμηνεία της τιμής της ακατέργαστης συμβολοσειράς. Δηλαδή, το backslash παραμένει παρόν στην τιμή της ακατέργαστης συμβολοσειράς::

source: Also see the specification in the :ref:`language reference <strings>`.
el: Δείτε επίσης την προδιαγραφή στην :ref:`language reference <strings>`.

source: Performance
el: Απόδοση

source: My program is too slow. How do I speed it up?
el: Το πρόγραμμα μου είναι πολύ αργό. Πως μπορώ να το επιταχύνω;

source: That's a tough one, in general. First, here are a list of things to remember before diving further:
el: Αυτό είναι δύσκολο, γενικά. Πρώτον, εδώ είναι μια λίστα με πράγματα που πρέπει να θυμάστε πριν βουτήξετε περαιτέρω::

source: Performance characteristics vary across Python implementations. This FAQ focuses on :term:`CPython`.
el: Τα χαρακτηριστικά απόδοσης διαφέρουν μεταξύ των υλοποιήσεων Python. Αυτή η FAQ εστιάζει στο :term:`CPython`.

source: Behaviour can vary across operating systems, especially when talking about I/O or multi-threading.
el: Η συμπεριφορά μπορεί να διαφέρει μεταξύ των λειτουργικών συστημάτων, ειδικά όταν μιλάμε για I/O ή multi-threading.

source: You should always find the hot spots in your program *before* attempting to optimize any code (see the :mod:`profile` module).
el: Θα πρέπει πάντα να βρίσκετε τα hot spot στο πρόγραμμά σας *πριν* επιχειρήσετε να βελτιστοποιήσετε οποιονδήποτε κώδικα (βλ. το module :mod:`profile`).

source: Writing benchmark scripts will allow you to iterate quickly when searching for improvements (see the :mod:`timeit` module).
el: Η σύνταξη σεναρίων συγκριτικής αξιολόγησης θα σας επιτρέψει να κάνετε iterate γρήγορα κατά την αναζήτηση βελτιώσεων (βλ. το module :mod:`timeit`).

source: It is highly recommended to have good code coverage (through unit testing or any other technique) before potentially introducing regressions hidden in sophisticated optimizations.
el: Συνίσταται ανεπιφύλακτα να έχετε καλή κάλυψη κώδικα (μέσω unit testing ή οποιασδήποτε άλλης τεχνικής) πριν από την πιθανή εισαγωγή κρυμμένων παλινδρομήσεων (regressions) σε εξελιγμένες βελτιστοποιήσεις.

source: That being said, there are many tricks to speed up Python code. Here are some general principles which go a long way towards reaching acceptable performance levels:
el: Τούτου λεχθέντος, υπάρχουν πολλά κόλπα για την επιτάχυνση του κώδικα Python. Ακολουθούν ορισμένες γενικές αρχές που βοηθούν πολύ στην επίτευξη αποδεκτών επιπέδων απόδοσης:

source: Making your algorithms faster (or changing to faster ones) can yield much larger benefits than trying to sprinkle micro-optimization tricks all over your code.
el: Το να κάνετε τους αλγορίθμους σας πιο γρήγορους (ή να αλλάξετε σε ταχύτερους) μπορεί να αποφέρει πολύ μεγαλύτερα οφέλη από το να προσπαθείτε να σκορπίσετε κόλπα μικρό βελτιστοποίησης σε όλο τον κώδικά σας.

source: Use the right data structures. Study documentation for the :ref:`bltin-types` and the :mod:`collections` module.
el: Χρησιμοποιήστε τις σωστές δομές δεδομένων. Μελετήστε την τεκμηρίωση για το :ref:`bltin-types` και το module :mod:`collections`.

source: When the standard library provides a primitive for doing something, it is likely (although not guaranteed) to be faster than any alternative you may come up with. This is doubly true for primitives written in C, such as builtins and some extension types. For example, be sure to use either the :meth:`list.sort` built-in method or the related :func:`sorted` function to do sorting (and see the :ref:`sortinghowto` for examples of moderately advanced usage).
el: Όταν η τυπική βιβλιοθήκη παρέχει ένα πρωτόγονο για να κάνετε κάτι, είναι πιθανό (αν και δεν είναι εγγυημένο) να είναι πιο γρήγορο από οποιαδήποτε εναλλακτική λύση που μπορείτε να βρείτε. Αυτό ισχύει διπλά για πρωτόγονα γραμμένα σε C, όπως ενσωματωμένα και ορισμένους τύπους επεκτάσεων. Για παράδειγμα, φροντίστε να χρησιμοποιήσετε είτε την ενσωματωμένη μέθοδο :meth:`list.sort` είτε τη σχετική συνάρτηση :func:`sorted` για να κάνετε ταξινόμηση (και δείτε το :ref:`sortinghowto` για παραδείγματα μέτριος προηγμένης χρήσης).

source: Abstractions tend to create indirections and force the interpreter to work more. If the levels of indirection outweigh the amount of useful work done, your program will be slower. You should avoid excessive abstraction, especially under the form of tiny functions or methods (which are also often detrimental to readability).
el: Οι αφαιρέσεις τείνουν να δημιουργούν έμμεσες κατευθύνσεις και αναγκάζουν τον διερμηνέα να εργαστεί περισσότερο. Εάν τα επίπεδα της έμμεσης κατεύθυνσης υπερτερούν του όγκου της χρήσιμης εργασίας που γίνεται, το πρόγραμμα σας θα είναι πιο αργό. Θα πρέπει να αποφύγετε την υπερβολική αφαίρεση, ειδικά με τη μορφή μικροσκοπικών συναρτήσεων ή μεθόδων (που είναι επίσης συχνά επιζήμια για την αναγνωσιμότητα).

source: If you have reached the limit of what pure Python can allow, there are tools to take you further away. For example, `Cython <https://cython.org>`_ can compile a slightly modified version of Python code into a C extension, and can be used on many different platforms. Cython can take advantage of compilation (and optional type annotations) to make your code significantly faster than when interpreted. If you are confident in your C programming skills, you can also :ref:`write a C extension module <extending-index>` yourself.
el: Εάν έχετε φτάσει στο όριο του τι μπορεί να επιτρέπει η καθαρή Python, υπάρχουν εργαλεία που θα σας απομακρύνουν. Για παράδειγμα, το `Cython <https://cython.org>`_ μπορεί να μεταγλωττίσει μια ελαφρώς τροποποιημένη έκδοση του κώδικα Python σε μια επέκταση C, και μπορεί να χρησιμοποιηθεί σε πολλές διαφορετικές πλατφόρμες. Η Cypthon μπορεί να εκμεταλλευτεί την μεταγλώττιση (και τους προαιρετικούς σχολιασμούς) για να κάνει τον κώδικα σας πολύ πιο γρήγορο από όταν ερμηνεύεται. Εάν είστε σίγουροι για τις δεξιότητές σας στον προγραμματισμό C, μπορείτε επίσης να :ref:`write a C extension module <extending-index>` μόνοι σας.

source: The wiki page devoted to `performance tips <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.
el: Η σελίδα wiki που είναι αφιερωμένη σε `συμβουλές απόδοσης <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.

source: What is the most efficient way to concatenate many strings together?
el: Ποιος είναι ο πιο αποτελεσματικός τρόπος για να συνδέσετε πολλές συμβολοσειρές μεταξύ τους;

source: :class:`str` and :class:`bytes` objects are immutable, therefore concatenating many strings together is inefficient as each concatenation creates a new object. In the general case, the total runtime cost is quadratic in the total string length.
el: Τα αντικείμενα :class:`str` και :class:`bytes` είναι αμετάβλητα, επομένως η σύνδεση πολλών συμβολοσειρών μεταξύ τους είναι αναποτελεσματική καθώς κάθε συνένωση δημιουργεί ένα νέο αντικείμενο. Στη γενική περίπτωση, το συνολικό κόστος χρόνου εκτέλεσης είναι τετραγωνικό στο συνολικό μήκος συμβολοσειράς.

source: To accumulate many :class:`str` objects, the recommended idiom is to place them into a list and call :meth:`str.join` at the end::
el: Για να συγκεντρώσετε πολλά αντικείμενα :class:`str`, το προτεινόμενο ιδίωμα είναι να τα τοποθετήσετε σε μια λίστα και να καλέσετε το στο :meth:`str.join` τέλος::

source: (another reasonably efficient idiom is to use :class:`io.StringIO`)
el: (ένα άλλο λογικά αποτελεσματικό ιδίωμα είναι να χρησιμοποιήσετε το :class:`io.StringIO`)

source: To accumulate many :class:`bytes` objects, the recommended idiom is to extend a :class:`bytearray` object using in-place concatenation (the ``+=`` operator)::
el: Για τη συγκέντρωση πολλών αντικειμένων :class:`bytes`, το συνιστώμενο ιδίωμα είναι η επέκταση ενός αντικειμένου :class:`bytearray` χρησιμοποιώντας επιτόπια συνένωση (ο τελεστής ``+=``)::

source: Sequences (Tuples/Lists)
el: Ακολουθίες (Πλειάδες/Λίστες)

source: How do I convert between tuples and lists?
el: Πως μπορώ να κάνω μετατροπή μεταξύ πλειάδων και λιστών;

source: The type constructor ``tuple(seq)`` converts any sequence (actually, any iterable) into a tuple with the same items in the same order.
el: Ο κατασκευαστής τύπου ``tuple(seq)`` μετατρέπει οποιαδήποτε ακολουθία (στην πραγματικότητα οποιοδήποτε iterable) σε πλειάδα με τα ίδια στοιχεία στην ίδια σειρά.

source: For example, ``tuple([1, 2, 3])`` yields ``(1, 2, 3)`` and ``tuple('abc')`` yields ``('a', 'b', 'c')``. If the argument is a tuple, it does not make a copy but returns the same object, so it is cheap to call :func:`tuple` when you aren't sure that an object is already a tuple.
el: Για παράδειγμα, το ``tuple([1, 2, 3])`` αποδίδει ``(1, 2, 3)`` και το ``tuple('abc')`` αποδίδει ``('a', 'b', 'c')``. Εάν το όρισμα είναι πλειάδα, δεν δημιουργεί αντίγραφο αλλά επιστρέφει το ίδιο αντικείμενο, επομένως είναι φτηνό να καλέσετε το :func:`tuple` όταν δεν είστε σίγουροι ότι ένα αντικείμενο είναι ήδη πλειάδα.

source: The type constructor ``list(seq)`` converts any sequence or iterable into a list with the same items in the same order. For example, ``list((1, 2, 3))`` yields ``[1, 2, 3]`` and ``list('abc')`` yields ``['a', 'b', 'c']``. If the argument is a list, it makes a copy just like ``seq[:]`` would.
el: Ο κατασκευαστής τύπων ``list(seq)`` μετατρέπει οποιαδήποτε ακολουθία ή iterable σε μια λίστα με τα ίδια στοιχεία στην ίδια σειρά. Για παράδειγμα, το ``list((1, 2, 3))`` αποδίδει ``[1, 2, 3]`` και ``list('abc')`` αποδίδει ``['a', 'b', 'c']``. Αν το όρισμα είναι λίστα, δημιουργεί απλώς ένα αντίγραφο όπως θα έκανε το ``seq[:]``.

source: What's a negative index?
el: Τι είναι αρνητικός δείκτης;

source: Python sequences are indexed with positive numbers and negative numbers. For positive numbers 0 is the first index 1 is the second index and so forth. For negative indices -1 is the last index and -2 is the penultimate (next to last) index and so forth. Think of ``seq[-n]`` as the same as ``seq[len(seq)-n]``.
el: Οι ακολουθίες Python indexed με θετικούς αριθμούς και αρνητικούς αριθμούς. Για θετικούς αριθμούς το 0 είναι ο πρώτος δείκτης 1 είναι ο δεύτερος δείκτης και ούτω καθεξής. Για αρνητικούς δείκτες το -1 είναι ο τελευταίος δείκτης και το -2 είναι ο προτελευταίος (δίπλα στο τελευταίο) δείκτης και ούτω καθεξής. Σκεφτείτε το ``seq[-n]`` ως το ίδιο με το ``seq[len(seq)-n]``.

source: Using negative indices can be very convenient. For example ``S[:-1]`` is all of the string except for its last character, which is useful for removing the trailing newline from a string.
el: Η χρήση αρνητικών δεικτών μπορεί ναι είναι πολύ βολική. Για παράδειγμα ``S[:-1]`` είναι όλη η συμβολοσειρά εκτός από τον τελευταίο χαρακτήρα της, ο οποίος είναι χρήσιμος για την αφαίρεση της νέας γραμμής που ακολουθεί μια συμβολοσειρά.

source: How do I iterate over a sequence in reverse order?
el: Πώς μπορώ να επαναλάβω μια ακολουθία με αντίστροφη σειρά;

source: Use the :func:`reversed` built-in function::
el: Χρησιμοποιείστε την ενσωματωμένη συνάρτηση :func:`reversed`::

source: This won't touch your original sequence, but build a new copy with reversed order to iterate over.
el: Αυτό δεν θα επηρεάσει την αρχική σας ακολουθία, αλλά δημιουργήστε ένα νέο αντίγραφο με αντίστροφη σειρά για επανάληψη.

source: How do you remove duplicates from a list?
el: Πως αφαιρείτε διπλότυπα από μια λίστα;

source: See the Python Cookbook for a long discussion of many ways to do this:
el: Δείτε το Python Cookbook για μια μακρά συζήτηση σχετικά με πολλούς τρόπους για να το κάνετε αυτό:

source: If you don't mind reordering the list, sort it and then scan from the end of the list, deleting duplicates as you go::
el: Εάν δεν σας πειράζει να αναδιατάξετε τη λίστα, ταξινομήστε την και μετά σαρώστε από το τέλος της λίστας, διαγράφοντας τα διπλότυπα καθώς προχωράτε::

source: If all elements of the list may be used as set keys (i.e. they are all :term:`hashable`) this is often faster ::
el: Εάν όλα τα στοιχεία της λίστας μπορούν να χρησιμοποιηθούν ως κλειδιά συνόλου (δηλαδή είναι όλα τα :term:`hashable`) αυτό είναι συχνά πιο γρήγορο::
