Repository: pygreece/python-docs-gr
Catalog: faq/programming.po
Languages: el

source: This converts the list into a set, thereby removing duplicates, and then back into a list.
el: Αυτό μετατρέπει τη λίστα σε ένα σύνολο, αφαιρώντας έτσι τα διπλότυπα και στη συνέχεια ξανά σε λίστα.

source: How do you remove multiple items from a list
el: Πως αφαιρείτε πολλαπλά στοιχεία από μία λίστα

source: As with removing duplicates, explicitly iterating in reverse with a delete condition is one possibility. However, it is easier and faster to use slice replacement with an implicit or explicit forward iteration. Here are three variations.::
el: Όπως και με την κατάργηση των διπλότυπων, το ρητό iterating αντίστροφα με μια συνθήκη διαγραφής είναι μια πιθανότητα. Ωστόσο, είναι ευκολότερο και πιο γρήγορο να χρησιμοποιήσετε την αντικατάσταση τμημάτων με ένα έμμεσο ή ρητώς προς τα εμπρός iteration. Ακολουθούν τρεις παραλλαγές::

source: The list comprehension may be fastest.
el: Το comprehension της λίστας μπορεί να είναι ταχύτερο.

source: How do you make an array in Python?
el: Πως μπορείτε να φτιάξετε έναν πίνακα στην Python;

source: Use a list::
el: Χρησιμοποιήστε μια λίστα::

source: Lists are equivalent to C or Pascal arrays in their time complexity; the primary difference is that a Python list can contain objects of many different types.
el: Οι λίστες είναι ισοδύναμες με τους πίνακες της C ή Pascal στην χρονική τους πολυπλοκότητα∙ η κύρια διαφορά είναι ότι μια λίστα Python μπορεί να περιέχει αντικείμενα πολλών διαφορετικών τύπων.

source: The ``array`` module also provides methods for creating arrays of fixed types with compact representations, but they are slower to index than lists. Also note that `NumPy <https://numpy.org/>`_ and other third party packages define array-like structures with various characteristics as well.
el: Το module ``array`` παρέχει επίσης μεθόδους για τη δημιουργία πινάκων σταθερών τύπων με συμπαγείς αναπαραστάσεις, αλλά είναι πιο αργές στην ευρετηρίαση από τις λίστες. Σημειώστε επίσης ότι το `NumPy <https://numpy.org/>`_ και άλλο πακέτα τρίτων, ορίζουν δομές τύπους array με διάφορα χαρακτηριστικά επίσης.

source: To get Lisp-style linked lists, you can emulate *cons cells* using tuples::
el: Για να λάβετε συνδεδεμένες λίστες τύπου Lisp, μπορείτε να εξομοιώσετε *cons κελιά* χρησιμοποιώντας πλειάδες::

source: If mutability is desired, you could use lists instead of tuples. Here the analogue of a Lisp *car* is ``lisp_list[0]`` and the analogue of *cdr* is ``lisp_list[1]``. Only do this if you're sure you really need to, because it's usually a lot slower than using Python lists.
el: Εάν είναι επιθυμητή η μεταβλητότητα, μπορείτε να χρησιμοποιήσετε λίστες αντί για πλειάδες. Εδώ το ανάλογο ενός Lisp *car* είναι ``lisp_list[0]`` και το ανάλογο του *cdr* είναι ``lisp_list[1]``. Μόνο κάντε το αν είστε βέβαιοι ότι πραγματικά χρειάζεται, γιατί είναι συνήθως πιο αργό και από τη χρήση λιστών Python.

source: How do I create a multidimensional list?
el: Πως φτιάχνω μια πολυδιάστατη λίστα;

source: You probably tried to make a multidimensional array like this::
el: Μάλλον προσπαθήσατε να φτιάξετε έναν πολυδιάστατο πίνακα σαν αυτόν::

source: This looks correct if you print it:
el: Αυτό φαίνεται σωστό αν το εκτυπώσετε:

source: But when you assign a value, it shows up in multiple places:
el: Αλλά όταν εκχωρείτε μια τιμή, εμφανίζεται σε πολλά σημεία:

source: The reason is that replicating a list with ``*`` doesn't create copies, it only creates references to the existing objects. The ``*3`` creates a list containing 3 references to the same list of length two. Changes to one row will show in all rows, which is almost certainly not what you want.
el: Ο λόγος είναι ότι η αναπαραγωγή μιας λίστα με ``*`` δεν δημιουργεί αντίγραφα, δημιουργεί μόνο αναφορές στα υπάρχοντα αντικείμενα. Το ``*3`` δημιουργεί μια λίστα που περιέχει 3 αναφορές στην ίδια λίστα μήκους δύο. Οι αλλαγές σε μία σειρά θα εμφανίζονται σε όλες τις σειρές, κάτι που σχεδόν σίγουρα δεν είναι αυτό που θέλετε.

source: The suggested approach is to create a list of the desired length first and then fill in each element with a newly created list::
el: Η προτεινόμενη προσέγγιση είναι να δημιουργήσετε πρώτα μια λίστα με το επιθυμητό μήκος και στη συνέχεια να συμπληρώσετε κάθε στοιχείο με μια νέα λίστα::

source: This generates a list containing 3 different lists of length two. You can also use a list comprehension::
el: Αυτό δημιουργεί μια λίστα που περιέχει 3 διαφορετικές λίστες με μήκος δύο. Μπορείτε επίσης να χρησιμοποιήσετε ένα comprehension λίστας::

source: Or, you can use an extension that provides a matrix datatype; `NumPy <https://numpy.org/>`_ is the best known.
el: Εναλλακτικά, μπορείτε να χρησιμοποιήσετε μια επέκταση που παρέχει έναν τύπο δεδομένων μήτρας (matrix)∙ Το `NumPy <https://numpy.org/>`_ είναι το πιο γνωστό.

source: How do I apply a method or function to a sequence of objects?
el: Πώς μπορώ να εφαρμόσω μια μέθοδο ή μια συνάρτηση σε μια ακολουθία αντικειμένων;

source: To call a method or function and accumulate the return values is a list, a :term:`list comprehension` is an elegant solution::
el: Για να καλέστε μια μέθοδο ή μια συνάρτηση και να συγκεντρώσετε τις επιστρεφόμενες τιμές είναι μια λίστα, ένα :term:`list comprehension` είναι μια κομψή λύση::

source: To just run the method or function without saving the return values, a plain :keyword:`for` loop will suffice::
el: Για να εκτελέσετε απλώς τη μέθοδο ή τη συνάρτηση χωρίς να αποθηκεύσετε τις επιστρεφόμενες τιμές, αρκεί ένας απλός βρόχος :keyword:`for`::

source: Why does a_tuple[i] += ['item'] raise an exception when the addition works?
el: Γιατί το a_tuple[i] += ['item'] δημιουργεί μια εξαίρεση όταν λειτουργεί η προσθήκη;

source: This is because of a combination of the fact that augmented assignment operators are *assignment* operators, and the difference between mutable and immutable objects in Python.
el: Αυτό οφείλεται σε έναν συνδυασμό του γεγονότος ότι οι επαυξημένοι τελεστές εκχώρησης είναι τελεστές *εκχώρησης* και της διαφοράς μεταξύ μεταβλητών και αμετάβλητων αντικειμένων στην Python.

source: This discussion applies in general when augmented assignment operators are applied to elements of a tuple that point to mutable objects, but we'll use a ``list`` and ``+=`` as our exemplar.
el: Αυτή η συζήτηση ισχύει γενικά όταν οι επαυξημένοι τελεστές εκχώρησης εφαρμόζονται σε στοιχεία μιας πλειάδας που δείχνουν σε μεταβλητά αντικείμενα, αλλά θα χρησιμοποιήσουμε ``list`` και ``+=`` ως υπόδειγμά μας.

source: If you wrote::
el: Εάν γράψετε::

source: The reason for the exception should be immediately clear: ``1`` is added to the object ``a_tuple[0]`` points to (``1``), producing the result object, ``2``, but when we attempt to assign the result of the computation, ``2``, to element ``0`` of the tuple, we get an error because we can't change what an element of a tuple points to.
el: Ο λόγος για την εξαίρεση θα πρέπει να είναι αμέσως σαφής: το ``1`` προστίθεται στο αντικείμενο ``a_tuple[0]`` δείχνει στο (``1``), παράγοντας το αντικείμενο αποτελέσματος, ``2``, αλλά όταν προσπαθούμε να αντιστοιχίσουμε το αποτέλεσμα του υπολογισμού, ``2``, στο στοιχείο ``0`` της πλειάδας, λαμβάνουμε ένα σφάλμα επειδή δεν μπορούμε να αλλάξουμε αυτό που δείχνει ένα στοιχείο μιας πλειάδας.

source: Under the covers, what this augmented assignment statement is doing is approximately this::
el: Κάτω από τα καλύμματα, αυτό που κάνει αυτή η επαυξημένη δήλωση ανάθεσης είναι περίπου το εξής::

source: It is the assignment part of the operation that produces the error, since a tuple is immutable.
el: Είναι το τμήμα ανάθεσης της λειτουργίας που παράγει το σφάλμα, αφού μια πλειάδα είναι αμετάβλητη.

source: When you write something like::
el: Όταν γράφετε κάτι σαν::

source: The exception is a bit more surprising, and even more surprising is the fact that even though there was an error, the append worked::
el: Η εξαίρεση είναι λίγο πιο εκπληκτική, και ακόμη πιο εκπληκτικό είναι το γεγονός ότι παρόλο που υπήρχε ένα σφάλμα, το παράρτημα λειτούργησε::

source: To see why this happens, you need to know that (a) if an object implements an :meth:`~object.__iadd__` magic method, it gets called when the ``+=`` augmented assignment is executed, and its return value is what gets used in the assignment statement; and (b) for lists, :meth:`!__iadd__` is equivalent to calling :meth:`!extend` on the list and returning the list. That's why we say that for lists, ``+=`` is a "shorthand" for :meth:`!list.extend`::
el: Για να δείτε γιατί συμβαίνει αυτό, πρέπει να γνωρίζετε ότι (α) εάν ένα αντικείμενο υλοποιεί μια μαγική μέθοδο :meth:`~object.__iadd__`, που καλείται όταν εκτελείται η επαυξημένη ανάθεση ``+=`` και η τιμή επιστροφής είναι αυτή που χρησιμοποιείται στη δήλωση εκχώρησης∙ και (β) για λίστες, :meth:`!__iadd__` ισοδυναμεί με την κλήση του :meth:`!extend` στη λίστα και επιστρέφει τη λίστα. Για αυτό λέμε ότι για λίστες ``+=`` είναι μια "συντομογραφία" για :meth:`!list.extend`::

source: This is equivalent to::
el: Αυτό ισοδυναμεί με::

source: The object pointed to by a_list has been mutated, and the pointer to the mutated object is assigned back to ``a_list``. The end result of the assignment is a no-op, since it is a pointer to the same object that ``a_list`` was previously pointing to, but the assignment still happens.
el: Το αντικείμενο στο οποίο υποδεικνύεται από το a_list έχει μεταλλαχθεί και ο δείκτης στο μεταλλαγμένο αντικείμενο έχει εκχωρηθεί πίσω στο ``a_list``. Το τελικό αποτέλεσμα της ανάθεσης είναι ένα no-op, καθώς είναι ένας δείκτης στο ίδιο αντικείμενο που το ``a_list`` έδειχνε προηγουμένως, αλλά η ανάθεση εξακολουθεί να γίνεται.

source: Thus, in our tuple example what is happening is equivalent to::
el: Έτσι, στο παράδειγμά μας, αυτό που συμβαίνει είναι ισοδύναμο με::

source: The :meth:`!__iadd__` succeeds, and thus the list is extended, but even though ``result`` points to the same object that ``a_tuple[0]`` already points to, that final assignment still results in an error, because tuples are immutable.
el: Το :meth:`!__iadd__` πετυχαίνει, και έτσι η λίστα επεκτείνεται, αλλά παρόλο που το ``αποτέλεσμα`` δείχνει στο ίδιο αντικείμενο που δείχνει ήδη το ``a_tuple[0]``, αυτή η τελική ανάθεση εξακολουθεί να έχει ως αποτέλεσμα ένα λάθος, γιατί οι πλειάδες είναι αμετάβλητες.

source: I want to do a complicated sort: can you do a Schwartzian Transform in Python?
el: Θέλω να κάνω μια περίπλοκη ταξινόμηση: μπορείτε να κάνετε ένα Schwartzian Transform στην Python;

source: The technique, attributed to Randal Schwartz of the Perl community, sorts the elements of a list by a metric which maps each element to its "sort value". In Python, use the ``key`` argument for the :meth:`list.sort` method::
el: Η τεχνική, που αποδίδεται στον Randal Schwartz της κοινότητας Perl, ταξινομεί τα στοιχεία μιας λίστας με βάση μια μέτρηση που αντιστοιχίζει κάθε στοιχείο στην " τιμή ταξινόμησης" του. Στην Python, χρησιμοποιήστε το όρισμα ``key`` για τη μέθοδο :meth:`list.sort`::

source: How can I sort one list by values from another list?
el: Πως μπορώ να ταξινομήσω μια λίστα με βάση τις τιμές από μια άλλη λίστα;

source: Merge them into an iterator of tuples, sort the resulting list, and then pick out the element you want. ::
el: Συγχωνεύστε τα σε έναν iterator πλειάδων, ταξινομήστε τη λίστα που προκύπτει και, στην συνέχεια επιλέξτε το στοιχείο που θέλετε. ::

source: Objects
el: Αντικείμενα

source: What is a class?
el: Τι είναι μια κλάση;

source: A class is the particular object type created by executing a class statement. Class objects are used as templates to create instance objects, which embody both the data (attributes) and code (methods) specific to a datatype.
el: Μια κλάση είναι ο συγκεκριμένος τύπος αντικειμένου που δημιουργείται με την εκτέλεση μιας δήλωσης κλάσης. Τα αντικείμενα κλάσης χρησιμοποιούνται ως πρότυπα για τη δημιουργία αντικειμένων παρουσίας, τα οποία ενσωματώνουν τόσο τα δεδομένα (χαρακτηριστικά) όσο και τον κώδικα (μεθόδους) ειδικά για έναν τύπο δεδομένων.

source: A class can be based on one or more other classes, called its base class(es). It then inherits the attributes and methods of its base classes. This allows an object model to be successively refined by inheritance. You might have a generic ``Mailbox`` class that provides basic accessor methods for a mailbox, and subclasses such as ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` that handle various specific mailbox formats.
el: Μια κλάση μπορεί να βασίζεται σε μία ή περισσότερες άλλες κλάσεις, που ονομάζονται βασικές κλάσεις της. Στη συνέχεια κληρονομεί τα χαρακτηριστικά και τις μεθόδους των βασικών κλάσεων. Αυτό επιτρέπει σε ένα μοντέλο αντικειμένου να βελτιωθεί διαδοχικά με κληρονομικότητα. Μπορεί να έχετε μια γενική κλάση ``Mailbox`` που παρέχει βασικές μεθόδους πρόσβασης για ένα γραμματοκιβώτιο και υποκλάσεις όπως ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` που χειρίζονται διάφορες συγκεκριμένες μορφές γραμματοκιβωτίου.

source: What is a method?
el: Τι είναι μια μέθοδος;

source: A method is a function on some object ``x`` that you normally call as ``x.name(arguments...)``. Methods are defined as functions inside the class definition::
el: Μια μέθοδος είναι μια συνάρτηση σε κάποιο αντικείμενο ``x`` που συνήθως καλείτε ως ``x.name(ορίσματα...)``. Οι μέθοδοι ορίζονται ως συναρτήσεις εντός του ορισμού κλάσης::

source: What is self?
el: Τι είναι το self;

source: Self is merely a conventional name for the first argument of a method. A method defined as ``meth(self, a, b, c)`` should be called as ``x.meth(a, b, c)`` for some instance ``x`` of the class in which the definition occurs; the called method will think it is called as ``meth(x, a, b, c)``.
el: Το self είναι απλώς ένα συμβατικό όνομα για το πρώτο όρισμα μιας μεθόδου. Μια μέθοδος που ορίζεται ως ``meth(self, a, b, c)`` πρέπει να ονομάζεται ``x.meth(a, b, c)`` για κάποιο παράδειγμα ``x`` της κλάσης στην οποία εμφανίζεται ο ορισμός∙ η καλούμενη μέθοδος θα ονομάζεται ``meth(x, a, b, c)``.

source: See also :ref:`why-self`.
el: Βλ. επίσης :ref:`why-self`.

source: How do I check if an object is an instance of a given class or of a subclass of it?
el: Πώς μπορώ να ελέγξω εάν ένα αντικείμενο είναι μια οντότητα μιας δεδομένης κλάσης ή μιας υποκλάσης της;

source: Use the built-in function :func:`isinstance(obj, cls) <isinstance>`. You can check if an object is an instance of any of a number of classes by providing a tuple instead of a single class, e.g. ``isinstance(obj, (class1, class2, ...))``, and can also check whether an object is one of Python's built-in types, e.g. ``isinstance(obj, str)`` or ``isinstance(obj, (int, float, complex))``.
el: Χρησιμοποιήστε την ενσωματωμένη συνάρτηση :func:`isinstance(obj, cls) <isinstance>`. Μπορείτε να ελέγξετε εάν ένα αντικείμενο είναι μια παρουσία οποιασδήποτε από έναν αριθμό κλάσεων παρέχοντας μια πλειάδα αντί για μια μεμονωμένη κλάση, π.χ. ``isinstance(obj, (class1, class2, ...))``, και μπορεί επίσης να ελέγξει εάν ένα αντικείμενο είναι ένας από τους ενσωματωμένους τύπους της Python, π.χ. ``isinstance(obj, str)`` ή ``isinstance(obj, (int, float, complex))``.

source: Note that :func:`isinstance` also checks for virtual inheritance from an :term:`abstract base class`. So, the test will return ``True`` for a registered class even if hasn't directly or indirectly inherited from it. To test for "true inheritance", scan the :term:`MRO` of the class:
el: Λάβετε υπόψη ότι το :func:`isinstance` ελέγχει επίσης για εικονική κληρονομικότητα από μια :term:`abstract base class`. Έτσι, η δοκιμή θα επιστρέψει ``True`` για μια εγγεγραμμένη κλάση ακόμα κι αν δεν έχει κληρονομήσει άμεσα ή έμμεσα από αυτό. Για να ελέγξετε μια "αληθινή κληρονομικότητα", σαρώστε το :term:`MRO` της κλάσης::

source: Note that most programs do not use :func:`isinstance` on user-defined classes very often. If you are developing the classes yourself, a more proper object-oriented style is to define methods on the classes that encapsulate a particular behaviour, instead of checking the object's class and doing a different thing based on what class it is. For example, if you have a function that does something::
el: Λάβετε υπόψη ότι τα περισσότερα προγράμματα δεν χρησιμοποιούν το :func:`isinstance` σε κλάσεις που ορίζονται από τη χρήστη πολύ συχνά. Εάν αναπτύσσετε μόνοι σας τις κλάσεις, ένα πιο σωστό αντικειμενοστρεφής στυλ είναι να ορίζετε μεθόδους στις κλάσεις που ενσωματώνουν μια συγκεκριμένη συμπεριφορά, αντί να ελέγχετε την κλάση του αντικειμένου και να κάνετε κάτι διαφορετικό με βάση την κλάση που είναι, για παράδειγμα, εάν έχετε μια συνάρτηση που κάνει κάτι::

source: A better approach is to define a ``search()`` method on all the classes and just call it::
el: Μια καλύτερη προσέγγιση είναι να ορίσετε μια μέθοδο ``search()`` σε όλες τις κλάσεις και απλώς να την καλέσετε::

source: What is delegation?
el: Τι είναι το delegation;

source: Delegation is an object oriented technique (also called a design pattern). Let's say you have an object ``x`` and want to change the behaviour of just one of its methods. You can create a new class that provides a new implementation of the method you're interested in changing and delegates all other methods to the corresponding method of ``x``.
el: Το delegation είναι μια αντικειμενοστραφής τεχνική (ονομάζεται επίσης μοτίβο σχεδίασης). Ας υποθέσουμε ότι έχετε ένα αντικείμενο ``x`` και θέλετε να αλλάξετε τη συμπεριφορά μιας μόνο από τις μεθόδους του. Μπορείτε να δημιουργήσετε μια νέα κλάση που παρέχει μια νέα υλοποίηση της μεθόδου που σας ενδιαφέρει να αλλάξετε και εκχωρεί όλες τις άλλες μεθόδους στην αντίστοιχη μέθοδο του ``x``.

source: Python programmers can easily implement delegation. For example, the following class implements a class that behaves like a file but converts all written data to uppercase::
el: Οι προγραμματιστές Python μπορούν εύκολα να υλοποιήσουν την ανάθεση. Για παράδειγμα, η ακόλουθη κλάση υλοποιεί μια κλάση που συμπεριφέρεται σαν αρχείο αλλά μετατρέπει όλα τα γραπτά δεδομένα σε κεφαλαία::

source: Here the ``UpperOut`` class redefines the ``write()`` method to convert the argument string to uppercase before calling the underlying ``self._outfile.write()`` method. All other methods are delegated to the underlying ``self._outfile`` object. The delegation is accomplished via the :meth:`~object.__getattr__` method; consult :ref:`the language reference <attribute-access>` for more information about controlling attribute access.
el: Εδώ η κλάση ``UpperOut`` επαναπροσδιορίζει τη μέθοδο ``write()`` για να μετατρέψει τη συμβολοσειρά ορίσματος σε κεφαλαία πριν καλέσει την υποκείμενη μέθοδο ``self._outfile.write()``. Όλες οι άλλες μέθοδοι εκχωρούνται στο υποκείμενο αντικείμενο ``self._outfile``. Το delegation ολοκληρώνεται μέσω της μεθόδου :meth:`~object.__getattr__`. Συμβουλευτείτε το :ref:`the language reference <attribute-access>` για περισσότερες πληροφορίες σχετικά με τον έλεγχο της πρόσβασης.

source: Note that for more general cases delegation can get trickier. When attributes must be set as well as retrieved, the class must define a :meth:`~object.__setattr__` method too, and it must do so carefully. The basic implementation of :meth:`!__setattr__` is roughly equivalent to the following::
el: Λάβετε υπόψη ότι για πιο γενικές περιπτώσεις η ανάθεση μπορεί να γίνει πιο δύσκολη. Όταν τα χαρακτηριστικά πρέπει να οριστούν καθώς και να ανακτηθούν, η κλάση πρέπει να ορίσει μια μέθοδο :meth:`~object.__setattr__` επίσης, και πρέπει να το κάνει προσεκτικά. Η βασική υλοποίηση του :meth:`!__setattr__` είναι περίπου ισοδύναμο με το εξής::

source: Most :meth:`!__setattr__` implementations must modify :meth:`self.__dict__ <object.__dict__>` to store local state for self without causing an infinite recursion.
el: Οι περισσότερες υλοποιήσεις :meth:`!__setattr__` πρέπει να τροποποιήσουν το :meth:`self.__dict__ <object.__dict__>` για να αποθηκεύουν την τοπική κατάσταση για τον εαυτό τους χωρίς να προκαλούν άπειρη αναδρομή.

source: How do I call a method defined in a base class from a derived class that extends it?
el: Πώς μπορώ να καλέσω μια μέθοδο που ορίζεται σε μια βασική κλάση από μια παράγωγη κλάση που την επεκτείνει;

source: Use the built-in :func:`super` function::
el: Χρησιμοποιήστε την ενσωματωμένη συνάρτηση :func:`super`::

source: In the example, :func:`super` will automatically determine the instance from which it was called (the ``self`` value), look up the :term:`method resolution order` (MRO) with ``type(self).__mro__``, and return the next in line after ``Derived`` in the MRO: ``Base``.
el: Στο παράδειγμα, το :func:`super` θα προσδιορίσει αυτόματα το στιγμιότυπο από το οποίο κλήθηκε (η τιμή ``self``), αναζητήστε τη :term:`method resolution order` (MRO) με ``type(self).__mro__``, και επιστρέψτε το επόμενο στη σειρά μετά το ``Derived`` στο MRO: ``Base``.

source: How can I organize my code to make it easier to change the base class?
el: Πως μπορώ να οργανώσω τον κώδικα μου προκειμένου να διευκολύνω την αλλαγή της βασικής κλάσης;

source: You could assign the base class to an alias and derive from the alias. Then all you have to change is the value assigned to the alias. Incidentally, this trick is also handy if you want to decide dynamically (e.g. depending on availability of resources) which base class to use. Example::
el: Θα μπορούσατε να αντιστοιχίσετε τη βασική κλάση σε ένα ψευδώνυμο και να προκύψει το ψευδώνυμο. Στην συνέχεια, το μόνο που πρέπει να αλλάξετε είναι η τιμή που έχει εκχωρηθεί ψευδώνυμο. Παρεμπιπτόντως, αυτό το κόλπο είναι επίσης χρήσιμο εάν θέλετε να αποφασίσετε δυναμικά (π.χ. ανάλογα με την διαθεσιμότητα των πόρων) ποια βασική κλάση να χρησιμοποιήσετε Παράδειγμα::

source: How do I create static class data and static class methods?
el: Πως δημιουργώ δεδομένα στατικής κλάσης και μεθόδους στατικής κλάσης;

source: Both static data and static methods (in the sense of C++ or Java) are supported in Python.
el: Τόσο τα στατιστικά δεδομένα όσο και οι στατικές μέθοδοι (με την έννοια της C++ ή της Java) υποστηρίζονται στην Python.

source: For static data, simply define a class attribute. To assign a new value to the attribute, you have to explicitly use the class name in the assignment::
el: Για στατικά δεδομένα, απλώς ορίστε ένα χαρακτηριστικό κλάσης. Για να εκχωρήσετε μια νέα τιμή στο χαρακτηριστικό, πρέπει να χρησιμοποιήσετε ρητά το όνομα κλάσης στην εκχώρηση::

source: ``c.count`` also refers to ``C.count`` for any ``c`` such that ``isinstance(c, C)`` holds, unless overridden by ``c`` itself or by some class on the base-class search path from ``c.__class__`` back to ``C``.
el: Το ``c.count`` αναφέρεται επίσης στο ``C.count`` για οποιοδήποτε ``c``, έτσι ώστε να ισχύει το ``isinstance(c, C)``, εκτός εάν παρακαμφθεί από το ίδιο το ``c`` ή από κάποια κλάση στη διαδρομή αναζήτησης της βασικής κλάσης από το ``c.__class__`` πίσω στο ``C``.

source: Caution: within a method of C, an assignment like ``self.count = 42`` creates a new and unrelated instance named "count" in ``self``'s own dict. Rebinding of a class-static data name must always specify the class whether inside a method or not::
el: Προσοχή: σε μια μέθοδο του C, μια ανάθεση όπως ``self.count = 42`` δημιουργεί μια νέα και άσχετη παρουσία με το όνομα "count" στο δικό του dict του ``self``. Επανασύνδεση μιας κλάσης-στατικής όνομα δεδομένων πρέπει πάντα να προσδιορίζει την κλάση είτε βρίσκεται μέσα σε μια μέθοδο είτε όχι::

source: Static methods are possible::
el: Οι στατικές μέθοδοι είναι δυνατές::

source: However, a far more straightforward way to get the effect of a static method is via a simple module-level function::
el: Ωστόσο, ένας πολύ πιο απλός τρόπος για να λάβετε το αποτέλεσμα μιας στατικής μεθόδου είναι μέσω μιας απλής συνάρτησης σε επίπεδο μονάδας::
