Repository: pygreece/python-docs-gr
Catalog: faq/programming.po
Languages: el

source: If your code is structured so as to define one class (or tightly related class hierarchy) per module, this supplies the desired encapsulation.
el: Εάν ο κώδικας σας είναι δομημένος έτσι ώστε να ορίζει μία κλάση (ή στενά συνδεδεμένη ιεραρχίας κλάσεων) ανά module, αυτό παρέχει την επιθυμητή ενθυλάκωση.

source: How can I overload constructors (or methods) in Python?
el: Πως μπορώ να υπερφορτώσω κατασκευαστές (ή μεθόδους) στην Python;

source: This answer actually applies to all methods, but the question usually comes up first in the context of constructors.
el: Αυτή η απάντηση ισχύει στην πραγματικότητα για όλες τις μεθόδους, αλλά η ερώτηση συνήθως εμφανίζεται πρώτη στο πλαίσιο των κατασκευαστών.

source: In C++ you'd write
el: Στην C++ θα γράφατε

source: In Python you have to write a single constructor that catches all cases using default arguments. For example::
el: Στην Python πρέπει να γράψετε έναν μοναδικό κατασκευαστή που να πιάνει όλες τις περιπτώσεις χρησιμοποιώντας προεπιλεγμένα ορίσματα. Για παράδειγμα::

source: This is not entirely equivalent, but close enough in practice.
el: Αυτό δεν είναι εντελώς ισοδύναμο, αλλά αρκετά κοντά στην πράξη.

source: You could also try a variable-length argument list, e.g. ::
el: Θα μπορούσατε επίσης να δοκιμάσετε μια λίστα ορισμάτων μεταβλητού μήκους, π.χ. ::

source: The same approach works for all method definitions.
el: Η ίδια προσέγγιση λειτουργεί για όλους τους ορισμούς μεθόδων.

source: I try to use __spam and I get an error about _SomeClassName__spam.
el: Προσπαθώ να χρησιμοποιήσω __spam και λαμβάνω ένα σφάλμα σχετικά με το _SomeClassName__spam.

source: Variable names with double leading underscores are "mangled" to provide a simple but effective way to define class private variables. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with any leading underscores stripped.
el: Τα ονόματα μεταβλητών με διπλή υπογράμμιση στην αρχή είναι "mangled" για να παρέχουν έναν απλό αλλά αποτελεσματικό τρόπο ορισμού των ιδιωτικών μεταβλητών κλάσης. Οποιοδήποτε αναγνωριστικό της φόρμας ``__spam`` (τουλάχιστον δύο προπορευόμενες κάτω παύλες, το πολύ ένα τέλος υπογράμμισης) αντικαθίσταται μέσω κειμένου το ``_classname__spam``, όπου το ``classname`` είναι το τρέχον όνομα κλάσης με απογυμνωμένες τυχόν προηγούμενες παύλες.

source: This doesn't guarantee privacy: an outside user can still deliberately access the "_classname__spam" attribute, and private values are visible in the object's ``__dict__``. Many Python programmers never bother to use private variable names at all.
el: Αυτό δεν εγγυάται το απόρρητο: ένα εξωτερικός χρήστης μπορεί ακόμα να έχει σκόπιμα πρόσβαση στο χαρακτηριστικό "_classname__spam" και οι ιδιωτικές τιμές είναι ορατές στο ``__dict__``. Πολλοί προγραμματιστές Python δεν μπαίνουν ποτέ στον κόπο να χρησιμοποιήσουν προσωπικά ονόματα μεταβλητών.

source: My class defines __del__ but it is not called when I delete the object.
el: Η κλάση μου ορίζει __del__ αλλά δεν καλείται όταν διαγράφω το αντικείμενο.

source: There are several possible reasons for this.
el: Υπάρχουν διάφοροι πιθανοί λόγοι για αυτό.

source: The :keyword:`del` statement does not necessarily call :meth:`~object.__del__` -- it simply decrements the object's reference count, and if this reaches zero :meth:`!__del__` is called.
el: Η πρόταση :keyword:`del` δεν καλεί απαραιτήτως το :meth:`~object.__del__` -- απλώς μειώνει τον αριθμό αναφοράς του αντικειμένου, και αν αυτό φτάσει στο μηδέν καλείται το :meth:`!__del__`.

source: If your data structures contain circular links (e.g. a tree where each child has a parent reference and each parent has a list of children) the reference counts will never go back to zero. Once in a while Python runs an algorithm to detect such cycles, but the garbage collector might run some time after the last reference to your data structure vanishes, so your :meth:`!__del__` method may be called at an inconvenient and random time. This is inconvenient if you're trying to reproduce a problem. Worse, the order in which object's :meth:`!__del__` methods are executed is arbitrary. You can run :func:`gc.collect` to force a collection, but there *are* pathological cases where objects will never be collected.
el: Εάν οι δομές δεδομένων σας περιέχουν κυκλικούς συνδέσμους (π.χ. ένα δέντρο όπου κάθε παιδί έχει μια αναφορά γονέα και κάθε γονέας έχει μια λίστα παιδιών), οι μετρήσεις δεν θα επανέλθουν ποτέ στο μηδέν. Κάθε τόσο η Python εκτελεί έναν αλγόριθμο για να ανιχνεύσει τέτοιους κύκλους, αλλά ο συλλέκτης σκουπιδιών μπορεί να εκτελεστεί κάποια στιγμή μετά την εξαφάνιση της τελευταίας αναφοράς στη δομή δεδομένων σας, επομένως η μέθοδος :meth:`!__del__` μπορεί να κληθεί σε μια άβολη και τυχαία στιγμή. Αυτό δεν είναι βολικό εάν προσπαθείτε να αναπαράξετε ένα πρόβλημα. Ακόμη χειρότερα, η σειρά με την οποία εκτελούνται μέθοδοι :meth:`!__del__` του αντικειμένου είναι αυθαίρετη. Μπορείτε να εκτελέσετε το :func:`gc.collect` για να αναγκάσετε μια συλλογή, αλλά *υπάρχουν* παθολογικές περιπτώσεις όπου τα αντικείμενα δεν θα συλλεχθούν ποτέ.

source: Despite the cycle collector, it's still a good idea to define an explicit ``close()`` method on objects to be called whenever you're done with them. The ``close()`` method can then remove attributes that refer to subobjects. Don't call :meth:`!__del__` directly -- :meth:`!__del__` should call ``close()`` and ``close()`` should make sure that it can be called more than once for the same object.
el: Παρά τον συλλέκτη κύκλου, εξακολουθεί να είναι καλή ιδέα να ορίσετε μια ρητή μέθοδο ``close()`` σε αντικείμενα που θα καλούνται κάθε φορά που τελειώνετε με αυτά. Η μέθοδος ``close()`` μπορεί στη συνέχει να αφαιρέσει χαρακτηριστικά που αναφέρονται σε υποαντικείμενα. Μην καλείτε το :meth:`!__del__` απευθείας -- :meth:`!__del__` θα πρέπει να καλείτε το ``close()`` και το ``close()`` θα πρέπει να βεβαιωθεί ότι μπορεί να κληθεί περισσότερες από μία φορές για το ίδιο αντικείμενο.

source: Another way to avoid cyclical references is to use the :mod:`weakref` module, which allows you to point to objects without incrementing their reference count. Tree data structures, for instance, should use weak references for their parent and sibling references (if they need them!).
el: Ένα άλλος τρόπος για να αποφύγετε τις κυκλικές αναφορές είναι να χρησιμοποιήσετε το module :mod:`weakref`, το οποίο σας επιτρέπει να αυξάνετε τον αριθμό των αναφορών τους. Οι δομές δεδομένων δέντρων, για παράδειγμα, θα πρέπει να χρησιμοποιούν αδύναμες αναφορές για τις αναφορές γονέων και αδελφών ( αν τα χρειαστούν!).

source: Finally, if your :meth:`!__del__` method raises an exception, a warning message is printed to :data:`sys.stderr`.
el: Τέλος, εάν η μέθοδος :meth:`!__del__` εγείρει μια εξαίρεση, εκτυπώνεται ένα προειδοποιητικό μήνυμα στη διεύθυνση :data:`sys.stderr`.

source: How do I get a list of all instances of a given class?
el: Πως μπορώ να λάβω μια λίστα με όλες τις οντότητες μιας δεδομένης κλάσης;

source: Python does not keep track of all instances of a class (or of a built-in type). You can program the class's constructor to keep track of all instances by keeping a list of weak references to each instance.
el: Η Python δεν παρακολουθεί όλες τις παρουσίες μιας κλάσης (ή ενός ενσωματωμένου τύπου). Μπορείτε να προγραμματίσετε τον κατασκευαστή της κλάσης να παρακολουθεί όλες τις οντότητες διατηρώντας μια λίστα αδύναμων αναφορών σε κάθε παρουσία.

source: Why does the result of ``id()`` appear to be not unique?
el: Γιατί το αποτέλεσμα του ``id()`` φαίνεται να μην είναι μοναδικό;

source: The :func:`id` builtin returns an integer that is guaranteed to be unique during the lifetime of the object. Since in CPython, this is the object's memory address, it happens frequently that after an object is deleted from memory, the next freshly created object is allocated at the same position in memory. This is illustrated by this example:
el: Το ενσωματωμένο :func:`id` επιστρέφει έναν ακέραιο που είναι εγγυημένο ότι είναι μοναδικός κατά τη διάρκεια ζωής του αντικειμένου. Εφόσον στο CPython, αυτή είναι διεύθυνση μνήμης του αντικειμένου, συμβαίνει συχνά ότι μετά τη διαγραφή ενός αντικειμένου από τη μνήμη, το επόμενο πρόσφατα δημιουργημένο αντικείμενο εκχωρείται στην ίδια θέση στη μνήμη. Αυτό φαίνεται από αυτό το παράδειγμα:

source: The two ids belong to different integer objects that are created before, and deleted immediately after execution of the ``id()`` call. To be sure that objects whose id you want to examine are still alive, create another reference to the object:
el: Τα δύο αναγνωριστικά ανήκουν σε διαφορετικά ακέραια αντικείμενα που δημιουργούνται πριν και διαγράφονται αμέσως μετά την εκτέλεση της κλήσης ``id()``. Για να βεβαιωθείτε ότι τα αντικείμενα των οποίων το αναγνωριστικό θέλετε να εξετάσετε είναι ακόμα ζωντανά, δημιουργήστε μια άλλη αναφορά στο αντικείμενο:

source: When can I rely on identity tests with the *is* operator?
el: Πότε μπορώ να βασιστώ σε δοκιμές ταυτότητας με τον τελεστή *is*;

source: The ``is`` operator tests for object identity. The test ``a is b`` is equivalent to ``id(a) == id(b)``.
el: Ο τελεστής ``is`` ελέγχει την ταυτότητα του αντικειμένου. Η δοκιμή ``a is b`` ισοδυναμεί με ``id(a) == id(b)``.

source: The most important property of an identity test is that an object is always identical to itself, ``a is a`` always returns ``True``. Identity tests are usually faster than equality tests. And unlike equality tests, identity tests are guaranteed to return a boolean ``True`` or ``False``.
el: Η πιο σημαντική ιδιότητα ενός τεστ ταυτότητας είναι ότι ένα αντικείμενο είναι πάντα πανομοιότυπο με τον εαυτό του, το ``a is a`` επιστρέφει πάντα ``True``. Τα τεστ ταυτότητας είναι συνήθως ταχύτερα από τα τεστ ισότητας. Και σε αντίθεση με τα τεστ ισότητας, τα τεστ ταυτότητας είναι εγγυημένα ότι θα επιστρέψουν ένα boolean ``True`` ή ``False``.

source: However, identity tests can *only* be substituted for equality tests when object identity is assured. Generally, there are three circumstances where identity is guaranteed:
el: Ωστόσο, τα τεστ ταυτότητας μπορούν μόνο να αντικαταστήσουν τα τεστ ισότητας όταν είναι εξασφαλισμένη η ταυτότητα αντικειμένου. Γενικά, υπάρχουν τρεις περιπτώσεις όπου η ταυτότητα είναι εγγυημένη:

source: 1) Assignments create new names but do not change object identity. After the assignment ``new = old``, it is guaranteed that ``new is old``.
el: 1) Οι εκχωρήσεις δημιουργούν νέα ονόματα αλλά δεν αλλάζουν την ταυτότητα αντικειμένου. Μετά την ανάθεση ``new = old``, είναι εγγυημένο ότι το ``new is old``.

source: 2) Putting an object in a container that stores object references does not change object identity. After the list assignment ``s[0] = x``, it is guaranteed that ``s[0] is x``.
el: 2) Η τοποθέτηση ενός αντικειμένου σε ένα κοντέινερ που αποθηκεύει αναφορές αντικειμένων δεν αλλάζει την ταυτότητα αντικειμένου. Μετά την ανάθεση λίστας ``s[0] = x``, είναι εγγυημένο ότι το ``s[0] is x``.

source: 3) If an object is a singleton, it means that only one instance of that object can exist. After the assignments ``a = None`` and ``b = None``, it is guaranteed that ``a is b`` because ``None`` is a singleton.
el: 3) Εάν ένα αντικείμενο είναι singleton, σημαίνει ότι μόνο μία παρουσία αυτού του αντικειμένου μπορεί να υπάρχει. Μετά τις εκχωρήσεις ``a = None`` και ``b = None``, είναι εγγυημένο ότι το ``a is b`` επειδή το ``None`` είναι singleton.

source: In most other circumstances, identity tests are inadvisable and equality tests are preferred. In particular, identity tests should not be used to check constants such as :class:`int` and :class:`str` which aren't guaranteed to be singletons::
el: Στις περισσότερες άλλες περιπτώσεις, τα τεστ ταυτότητας δεν ενδείκνυνται και προτιμώνται τα τεστ ισότητας. Ειδικότερα, τα τεστ ταυτότητας δεν θα πρέπει να χρησιμοποιούνται για τον έλεγχο σταθερών όπως :class:`int` και :class:`str` που δεν είναι εγγυημένα singletons::

source: Likewise, new instances of mutable containers are never identical::
el: Ομοίως, τα νέα στιγμιότυπα μεταβλητών κοντέινερ δεν είναι ποτέ πανομοιότυπα::

source: In the standard library code, you will see several common patterns for correctly using identity tests:
el: Στον τυπικό κώδικα βιβλιοθήκης, θα δείτε πολλά κοινά μοτίβα για τη σωστή χρήση των δοκιμών ταυτότητας:

source: 1) As recommended by :pep:`8`, an identity test is the preferred way to check for ``None``. This reads like plain English in code and avoids confusion with other objects that may have boolean values that evaluate to false.
el: 1) Όπως προτείνεται από το :pep:`8`, ένας έλεγχος ταυτότητας είναι ο προτιμώμενος τρόπος για να ελέγξετε το ``None``. Αυτό είναι σαν απλά αγγλικά στον κώδικα και αποφεύγεται η σύγχυση με άλλα αντικείμενα που μπορεί να έχουν τιμές boolean που αξιολογούνται σε ψευδής.

source: 2) Detecting optional arguments can be tricky when ``None`` is a valid input value. In those situations, you can create a singleton sentinel object guaranteed to be distinct from other objects. For example, here is how to implement a method that behaves like :meth:`dict.pop`:
el: 2) Ο εντοπισμός προαιρετικών ορισμάτων μπορεί να είναι δύσκολος όταν το ``None`` είναι μια έγκυρη τιμή εισόδου. Σε αυτές τις περιπτώσεις, μπορείτε να δημιουργήσετε ένα αντικείμενο μεμονωμένου φρουρού που είναι εγγυημένο ότι θα διαφέρει από άλλα αντικείμενα. Για παράδειγμα, δείτε πως μπορείτε να εφαρμόσετε μια μέθοδο που συμπεριφέρεται σαν :meth:`dict.pop`::

source: 3) Container implementations sometimes need to augment equality tests with identity tests. This prevents the code from being confused by objects such as ``float('NaN')`` that are not equal to themselves.
el: 3) Οι υλοποιήσεις κοντέινερ μερικές φορές χρειάζεται να αυξήσουν τα τεστ ισότητας με δοκιμές ταυτότητας. Αυτό αποτρέπει τη σύγχυση του κώδικα από αντικείμενα όπως το ``float('NaN')`` που δεν είναι ίσα με τα ίδια.

source: For example, here is the implementation of :meth:`!collections.abc.Sequence.__contains__`::
el: Για παράδειγμα, εδώ είναι η υλοποίηση του :meth:`!collections.abc.Sequence.__contains__`::

source: How can a subclass control what data is stored in an immutable instance?
el: Πώς μπορεί μια υποκλάση να ελέγξει ποια δεδομένα αποθηκεύονται σε μια αμετάβλητη παρουσία;

source: When subclassing an immutable type, override the :meth:`~object.__new__` method instead of the :meth:`~object.__init__` method. The latter only runs *after* an instance is created, which is too late to alter data in an immutable instance.
el: Κατά την υποκλάση ενός αμετάβλητου τύπου, παρακάμψετε τη μέθοδο :meth:`~object.__new__` αντί για τη μέθοδο :meth:`~object.__init__`. Η τελευταία εκτελείται μόνο αφού δημιουργηθεί μια παρουσία, η οποία είναι πολύ αργά για να αλλάζει δεδομένα σε μια αμετάβλητη περίπτωση.

source: All of these immutable classes have a different signature than their parent class:
el: Όλες αυτές οι αμετάβλητες κλάσεις έχουν διαφορετική υπογραφή από τη μητρική τους κλάση:

source: The classes can be used like this:
el: Οι κλάσεις μπορούν να χρησιμοποιηθούν έτσι:

source: How do I cache method calls?
el: Πώς μπορώ να αποθηκεύσω τις κλήσεις μεθόδου στην κρυφή μνήμη;

source: The two principal tools for caching methods are :func:`functools.cached_property` and :func:`functools.lru_cache`. The former stores results at the instance level and the latter at the class level.
el: Τα δύο βασικά εργαλεία για τις μεθόδους αποθήκευσης στην προσωρινή μνήμη είναι τα :func:`functools.cached_property` και :func:`functools.lru_cache`. Το πρώτο αποθηκεύει τα αποτελέσματα σε επίπεδο παρουσίας και το δεύτερο σε επίπεδο κλάσης.

source: The *cached_property* approach only works with methods that do not take any arguments. It does not create a reference to the instance. The cached method result will be kept only as long as the instance is alive.
el: Η προσέγγιση *cached_property* λειτουργεί μόνο με μεθόδους που δεν λαμβάνουν ορίσματα. Δεν δημιουργεί αναφορά στο στιγμιότυπο. Το αποτέλεσμα της cached μεθόδους θα διατηρηθεί μόνο όσο το στιγμιότυπο είναι ζωντανό.

source: The advantage is that when an instance is no longer used, the cached method result will be released right away. The disadvantage is that if instances accumulate, so too will the accumulated method results. They can grow without bound.
el: Το πλεονέκτημα είναι ότι όταν ένα στιγμιότυπο δεν χρησιμοποιείται πλέον, το αποτέλεσμα της αποθηκευμένης μεθόδου θα απελευθερωθεί αμέσως. Το μειονέκτημα είναι ότι εάν συσσωρευτούν στιγμιότυπα, θα είναι και τα αποτελέσματα της συσσωρευμένης μεθόδου. Μπορούν να αναπτυχθούν χωρίς περιορισμούς.

source: The *lru_cache* approach works with methods that have :term:`hashable` arguments. It creates a reference to the instance unless special efforts are made to pass in weak references.
el: Η προσέγγιση *lru_cache* λειτουργεί με μεθόδους που έχουν ορίσματα :term:`hashable`. Δημιουργεί μια αναφορά στο στιγμιότυπο, εκτός εάν καταβληθούν ειδικές προσπάθειες για να περάσει σε αδύναμες αναφορές.

source: The advantage of the least recently used algorithm is that the cache is bounded by the specified *maxsize*. The disadvantage is that instances are kept alive until they age out of the cache or until the cache is cleared.
el: Το πλεονέκτημα του αλγορίθμου που χρησιμοποιήθηκε λιγότερο πρόσφατα είναι ότι η κρυφή μνήμη οριοθετείται από το καθορισμένο *maxsize*. Το μειονέκτημα είναι ότι τα στιγμιότυπα διατηρούνται ζωντανά έως ότου παλαιώσουν από την κρυφή μνήμη ή μέχρι να διαγραφεί η κρυφή μνήμη.

source: This example shows the various techniques::
el: Αυτό το παράδειγμα δείχνει τις διάφορες τεχνικές::

source: The above example assumes that the *station_id* never changes. If the relevant instance attributes are mutable, the *cached_property* approach can't be made to work because it cannot detect changes to the attributes.
el: Το παραπάνω παράδειγμα προϋποθέτει ότι το *station_id* δεν αλλάζει ποτέ. Εάν τα σχετικά χαρακτηριστικά παρουσίας είναι μεταβλητά, η προσέγγιση *cached_property* δεν μπορεί να λειτουργήσει επειδή δεν μπορεί να εντοπίσει αλλαγές στα χαρακτηριστικά.

source: To make the *lru_cache* approach work when the *station_id* is mutable, the class needs to define the :meth:`~object.__eq__` and :meth:`~object.__hash__` methods so that the cache can detect relevant attribute updates::
el: Για να λειτουργήσει η προσέγγιση *lru_cache* όταν το *station_id* είναι μεταβλητό, η κλάση πρέπει να ορίσει τις μεθόδους :meth:`~object.__eq__` και :meth:`~object.__hash__` ώστε η κρυφή μνήμη να μπορεί να εντοπίσει σχετικές ενημερώσεις χαρακτηριστικών::

source: How do I create a .pyc file?
el: Πως δημιουργώ ένα .pyc αρχείο;

source: When a module is imported for the first time (or when the source file has changed since the current compiled file was created) a ``.pyc`` file containing the compiled code should be created in a ``__pycache__`` subdirectory of the directory containing the ``.py`` file. The ``.pyc`` file will have a filename that starts with the same name as the ``.py`` file, and ends with ``.pyc``, with a middle component that depends on the particular ``python`` binary that created it. (See :pep:`3147` for details.)
el: Όταν ένα module εισάγεται για πρώτη φορά (ή όταν το αρχείο προέλευσης έχει αλλάξει από τη δημιουργία του τρέχοντος μεταγλωττισμένου αρχείου), ένα αρχείο ``.pyc`` που παρέχει τον μεταγλωττισμένο κώδικα θα πρέπει να δημιουργηθεί σε έναν υποκατάλογο ``__pycache__`` ο κατάλογος που περιέχει το ``.py``. Το αρχείο ``.pyc`` θα έχει ένα όνομα αρχείου που ξεκινά με το ίδιο όνομα με το αρχείο ``.py`` και τελειώνει σε ``.pyc``, με ένα μεσαίο στοιχείο που εξαρτάται από το συγκεκριμένο δυαδικό αρχείο ``python`` που το δημιούργησε. (Βλ. :pep:`3147` για λεπτομέρειες.)

source: One reason that a ``.pyc`` file may not be created is a permissions problem with the directory containing the source file, meaning that the ``__pycache__`` subdirectory cannot be created. This can happen, for example, if you develop as one user but run as another, such as if you are testing with a web server.
el: Ένας λόγος για τον οποίο ενδέχεται να μην δημιουργηθεί ένα αρχείο ``.pyc`` είναι ένα πρόβλημα δικαιωμάτων στον κατάλογο που περιέχει το αρχείο προέλευσης, που σημαίνει ότι δεν μπορεί να δημιουργηθεί ο υποκατάλογος ``__pycache__``. Αυτό μπορεί να συμβεί, για παράδειγμα, εάν αναπτυχθεί ως ένας χρήστης αλλά εκτελείται ως άλλος, όπως εάν δοκιμάζετε με έναν διακομιστή ιστού.

source: Unless the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable is set, creation of a .pyc file is automatic if you're importing a module and Python has the ability (permissions, free space, etc...) to create a ``__pycache__`` subdirectory and write the compiled module to that subdirectory.
el: Εκτός και αν έχει οριστεί η μεταβλητή περιβάλλοντος :envvar:`PYTHONDONTWRITEBYTECODE`, η δημιουργία ενός αρχείου .pyc είναι αυτόματη εάν εισάγετε ένα module και η Python έχει τη δυνατότητα (δικαιώματα, ελεύθερος χώρος, κ.λπ...) να δημιουργήσει ένα ``__pycache__`` υποκατάλογο και γράψτε το μεταγλωττισμένο module σε αυτόν τον υποκατάλογο.

source: Running Python on a top level script is not considered an import and no ``.pyc`` will be created. For example, if you have a top-level module ``foo.py`` that imports another module ``xyz.py``, when you run ``foo`` (by typing ``python foo.py`` as a shell command), a ``.pyc`` will be created for ``xyz`` because ``xyz`` is imported, but no ``.pyc`` file will be created for ``foo`` since ``foo.py`` isn't being imported.
el: Η εκτέλεση της Python σε ένα σενάριο ανώτατου επιπέδου δεν θεωρείται εισαγωγή και δεν θα δημιουργηθεί ``.pyc``. Για παράδειγμα, εάν έχετε ένα module ανωτάτου επιπέδου ``foo.py`` που εισάγει ένα άλλο module ``xyz.py``, όταν εκτελείτε το ``foo`` (πληκτρολογώντας ``python foo.py`` ως εντολή κελύφους), θα δημιουργηθεί ένα ``.pyc`` για το ``xyz`` επειδή το ``xyz`` έχει εισαχθεί, αλλά δεν θα δημιουργηθεί αρχείο ``.pyc`` για το ``foo`` καθώς το ``foo.py`` δεν εισάγεται.

source: If you need to create a ``.pyc`` file for ``foo`` -- that is, to create a ``.pyc`` file for a module that is not imported -- you can, using the :mod:`py_compile` and :mod:`compileall` modules.
el: Εάν χρειάζεται να δημιουργήσετε ένα αρχείο ``.pyc`` για το ``foo`` -- δηλαδή, να δημιουργήσετε ένα αρχείο ``.pyc`` για ένα module που δεν έχει εισαχθεί -- μπορείτε, χρησιμοποιώντας τα modules :mod:`py_compile` και :mod:`compileall`.

source: The :mod:`py_compile` module can manually compile any module. One way is to use the ``compile()`` function in that module interactively::
el: Το module :mod:`py_compile` μπορεί να μεταγλωττίσει χειροκίνητα οποιαδήποτε module. Ένας τρόπος είναι να χρησιμοποιήσετε τη συνάρτηση ``compile()`` σε αυτήν την ενότητα διαδραστικά::

source: This will write the ``.pyc`` to a ``__pycache__`` subdirectory in the same location as ``foo.py`` (or you can override that with the optional parameter ``cfile``).
el: Αυτό θα γράψει το ``.pyc`` σε έναν υποκατάλογο ``__pycache__`` στην ίδια θέση με το ``foo.py`` (ή μπορείτε να το παρακάμψετε με την προαιρετική παράμετρο ``cfile``).

source: You can also automatically compile all files in a directory or directories using the :mod:`compileall` module. You can do it from the shell prompt by running ``compileall.py`` and providing the path of a directory containing Python files to compile::
el: Μπορείτε επίσης να μεταγλωττίσετε αυτόματα όλα τα αρχεία σε έναν κατάλογο ή καταλόγους χρησιμοποιώντας το module :mod:`compileall`. Μπορείτε να κάνετε από το shell prompt εκτελώντας το ``compileall.py`` και παρέχοντας τη διαδρομή ενός καταλόγου που περιέχει αρχεία Python για μεταγλώττιση::

source: How do I find the current module name?
el: Πως μπορώ να βρω το όνομα του τρέχοντος module;
