Repository: pygreece/python-docs-gr
Catalog: faq/programming.po
Languages: el

source: It is often expected that a function call creates new objects for default values. This is not what happens. Default values are created exactly once, when the function is defined. If that object is changed, like the dictionary in this example, subsequent calls to the function will refer to this changed object.
el: Συχνά αναμένεται ότι μια κλήση συνάρτησης δημιουργεί νέα αντικείμενα για προεπιλεγμένες τιμές. Δεν συμβαίνει αυτό. Οι προεπιλεγμένες τιμές δημιουργούνται ακριβώς μία φορά, όταν ορίζεται η συνάρτηση. Εάν αυτό το αντικείμενο αλλάξει, όπως το λεξικό σε αυτό το παράδειγμα, επόμενες κλήσεις στην συνάρτηση θα αναφέρονται σε αυτό το αλλαγμένο αντικείμενο.

source: By definition, immutable objects such as numbers, strings, tuples, and ``None``, are safe from change. Changes to mutable objects such as dictionaries, lists, and class instances can lead to confusion.
el: Εξ ορισμού, αμετάβλητα αντικείμενα όπως αριθμοί, συμβολοσειρές, πλειάδες και ``None`` , είναι ασφαλή από αλλαγές. Οι αλλαγές σε μεταβλητά αντικείμενα όπως λεξικά, λίστες και παρουσίες κλάσεων μπορεί να οδηγήσουν σε σύγχυση.

source: Because of this feature, it is good programming practice to not use mutable objects as default values. Instead, use ``None`` as the default value and inside the function, check if the parameter is ``None`` and create a new list/dictionary/whatever if it is. For example, don't write::
el: Λόγω αυτής της δυνατότητας, είναι καλή πρακτική προγραμματισμού να μην χρησιμοποιείτε μεταβλητά αντικείμενα ως προεπιλεγμένες τιμές. Αντίθετα, χρησιμοποιείστε ``None`` ως προεπιλεγμένη τιμή και μέσα στην συνάρτηση, ελέγξτε εάν η παράμετρος είναι ``None`` και δημιουργήστε μια νέα λίστα/λεξικά/ό,τι και αν είναι. Για παράδειγμα μην γράψετε::

source: but::
el: αλλά::

source: This feature can be useful. When you have a function that's time-consuming to compute, a common technique is to cache the parameters and the resulting value of each call to the function, and return the cached value if the same value is requested again. This is called "memoizing", and can be implemented like this::
el: Αυτή η δυνατότητα μπορεί να είναι χρήσιμη. Όταν έχετε μια συνάρτηση που είναι χρονοβόρα για τον υπολογισμό, μια κοινή τεχνική είναι να αποθηκεύσετε προσωρινά τις παραμέτρους και την επιστρεφόμενη τιμή κάθε κλήσης στη συνάρτηση και να επιστρέφετε την προσωρινά αποθηκευμένη τιμή εάν ζητηθεί ξανά η ίδια τιμή. Αυτό ονομάζεται "memoizing", και μπορεί να εφαρμοστεί ως εξής:

source: You could use a global variable containing a dictionary instead of the default value; it's a matter of taste.
el: Θα μπορούσατε να χρησιμοποιήσετε μια καθολική μεταβλητή που περιέχει ένα λεξικό αντί για την προεπιλεγμένη τιμή∙ Είναι θέμα γούστου.

source: How can I pass optional or keyword parameters from one function to another?
el: Πώς μπορώ να μεταβιβάσω προαιρετικές παραμέτρους ή παραμέτρους λέξεων-κλειδιών από τη μια συνάρτηση στην άλλη;

source: Collect the arguments using the ``*`` and ``**`` specifiers in the function's parameter list; this gives you the positional arguments as a tuple and the keyword arguments as a dictionary. You can then pass these arguments when calling another function by using ``*`` and ``**``::
el: Συλλέξτε τα ορίσματα χρησιμοποιώντας τους specifiers ``*`` και ``**`` στη λίστα παραμέτρων της συνάρτησης∙ Αυτό σας δίνει τα ορίσματα θέσης ως πλειάδα και τα ορίσματα λέξεων-κλειδιών ως λεξικό. Στη συνέχεια, μπορείτε να μεταβιβάσετε αυτά τα ορίσματα κατά την κλήση άλλης συνάρτησης με τη χρήση των ``*`` και ``**``::

source: What is the difference between arguments and parameters?
el: Ποια είναι η διαφορά μεταξύ ορισμάτων και παραμέτρων;

source: :term:`Parameters <parameter>` are defined by the names that appear in a function definition, whereas :term:`arguments <argument>` are the values actually passed to a function when calling it. Parameters define what :term:`kind of arguments <parameter>` a function can accept. For example, given the function definition::
el: :term:`Παράμετροι <parameter>` ορίζονται από τα ονόματα που εμφανίζονται στον ορισμό μιας συνάρτησης, ενώ τα :term:`ορίσματα <argument>` είναι οι τιμές που πραγματικά μεταβιβάζονται σε μια συνάρτηση κατά την κλήση της. Οι παράμετροι ορίζουν τι :term:`kind of arguments <parameter>` μπορεί να δεχτεί μια συνάρτηση. Για παράδειγμα δεδομένου του ορισμού της συνάρτησης::

source: *foo*, *bar* and *kwargs* are parameters of ``func``. However, when calling ``func``, for example::
el: *foo*, *bar* και *kwargs* είναι παράμετροι της ``func``. Ωστόσο, όταν καλείται η ``func``, για παράδειγμα::

source: the values ``42``, ``314``, and ``somevar`` are arguments.
el: οι τιμές ``42``, ``314``, και ``somevar`` είναι ορίσματα.

source: Why did changing list 'y' also change list 'x'?
el: Γιατί η αλλαγή της λίστας 'y' αλλάζει επίσης και τη λίστα 'x';

source: If you wrote code like::
el: Αν γράψατε κώδικα όπως::

source: you might be wondering why appending an element to ``y`` changed ``x`` too.
el: μπορεί να αναρωτιέστε γιατί η προσθήκη ενός στοιχείου στο ``y`` άλλαξε επίσης το ``x``.

source: There are two factors that produce this result:
el: Υπάρχουν δύο παράγοντες που παράγουν αυτό το αποτέλεσμα:

source: Variables are simply names that refer to objects. Doing ``y = x`` doesn't create a copy of the list -- it creates a new variable ``y`` that refers to the same object ``x`` refers to. This means that there is only one object (the list), and both ``x`` and ``y`` refer to it.
el: Οι μεταβλητές είναι απλά ονόματα που αναφέρονται σε αντικείμενα. Κανόνας ``y = x`` δεν δημιουργείται αντίγραφο της λίστας -- δημιουργεί μια νέα μεταβλητή ``y`` που αναφέρεται στο ίδιο αντικείμενο που αναφέρεται το ``x``. Αυτό σημαίνει ότι υπάρχει μόνο ένα αντικείμενο (η λίστα), και το ``x`` και το ``y`` αναφέρονται σε αυτό.

source: Lists are :term:`mutable`, which means that you can change their content.
el: Οι λίστες είναι :term:`mutable`, που σημαίνει ότι μπορείτε να αλλάξετε το περιεχόμενό τους.

source: After the call to :meth:`!append`, the content of the mutable object has changed from ``[]`` to ``[10]``. Since both the variables refer to the same object, using either name accesses the modified value ``[10]``.
el: Μετά την κλήση στο :meth:`!append`, το περιεχόμενο του μεταβλητού αντικειμένου έχει αλλάξει από ``[]`` σε ``[10]``. Επειδή και οι δύο μεταβλητές αναφέρονται στο ίδιο αντικείμενο, χρησιμοποιώντας οποιοδήποτε όνομα αποκτά πρόσβαση στην τροποποιημένη τιμή ``[10]``.

source: If we instead assign an immutable object to ``x``::
el: Αν αντιστοιχίσουμε ένα αμετάβλητο αντικείμενο σε ``x``::

source: we can see that in this case ``x`` and ``y`` are not equal anymore. This is because integers are :term:`immutable`, and when we do ``x = x + 1`` we are not mutating the int ``5`` by incrementing its value; instead, we are creating a new object (the int ``6``) and assigning it to ``x`` (that is, changing which object ``x`` refers to). After this assignment we have two objects (the ints ``6`` and ``5``) and two variables that refer to them (``x`` now refers to ``6`` but ``y`` still refers to ``5``).
el: μπορούμε να δούμε ότι σε αυτήν την περίπτωση ``x`` και ``y`` δεν είναι πλέον ίσα. Αυτό συμβαίνει επειδή οι ακέραιοι αριθμοί είναι :term:`immutable`, και όταν κάνουμε ``x = x + 1`` δεν μεταλλάσσεται το int ``5`` αυξάνοντας την τιμή του∙ αντίθετα, δημιουργούμε ένα νέο αντικείμενο (το int ``6``) και το εκχωρούμε στο ``x`` (δηλαδή, αλλάζοντας το αντικείμενο στο οποίο αναφέρεται το ``x``). Μετά από αυτήν την ανάθεση έχουμε δύο αντικείμενα (τα ints ``6`` and ``5``) και δύο μεταβλητές που αναφέρονται σε αυτά (``x`` τώρα αναφέρεται σε ``6`` αλλά ``y`` ακόμα αναφέρεται στο ``5``).

source: Some operations (for example ``y.append(10)`` and ``y.sort()``) mutate the object, whereas superficially similar operations (for example ``y = y + [10]`` and :func:`sorted(y) <sorted>`) create a new object. In general in Python (and in all cases in the standard library) a method that mutates an object will return ``None`` to help avoid getting the two types of operations confused. So if you mistakenly write ``y.sort()`` thinking it will give you a sorted copy of ``y``, you'll instead end up with ``None``, which will likely cause your program to generate an easily diagnosed error.
el: Ορισμένες λειτουργίες (για παράδειγμα ``y.append(10)`` και ``y.sort()``) μεταλλάσσουν το αντικείμενο, ενώ επιφανειακά παρόμοιες πράξεις (για παράδειγμα ``y = y + [10]`` και :func:`sorted(y) <sorted>`) δημιουργούν ένα νέο αντικείμενο. Γενικά στην Python (και σε όλες τις περιπτώσεις στην τυπική βιβλιοθήκη) μια μέθοδος που μεταλλάσσει ένα αντικείμενο θα επιστρέψει ``None`` για να αποφύγει τη σύγχυση των δύο τύπων πράξεων. Επομένως, εάν γράψετε κατά λάθος ``y.sort()`` νομίζοντας ότι θα σας δώσει ένα ταξινομημένο αντίγραφο του ``y``, θα καταλήξετε με ``None``, το οποίο πιθανότατα θα προκαλέσει το πρόγραμμά σας να δημιουργήσει ένα λάθος το οποίο διαγιγνώσκεται εύκολα.

source: However, there is one class of operations where the same operation sometimes has different behaviors with different types: the augmented assignment operators. For example, ``+=`` mutates lists but not tuples or ints (``a_list += [1, 2, 3]`` is equivalent to ``a_list.extend([1, 2, 3])`` and mutates ``a_list``, whereas ``some_tuple += (1, 2, 3)`` and ``some_int += 1`` create new objects).
el: Ωστόσο, υπάρχει μία κατηγορία λειτουργιών όπου η ίδια πράξη έχει μερικές φορές διαφορετικές συμπεριφορές με διαφορετικούς τύπους: οι επαυξημένοι τελεστές ανάθεσης. Για παράδειγμα, ``+=`` μεταλλάσσει τις λίστες αλλά όχι τις πλειάδες ή τους ints (``a_list += [1, 2, 3]`` είναι ίσο με ``a_list.extend([1, 2, 3])`` και μεταλλάσσει ``a_list``, ενώ το ``some_tuple += (1, 2, 3)`` και ``some_int += 1`` δημιουργεί νέα αντικείμενα).

source: In other words:
el: Με άλλα λόγια:

source: If we have a mutable object (:class:`list`, :class:`dict`, :class:`set`, etc.), we can use some specific operations to mutate it and all the variables that refer to it will see the change.
el: Εάν έχουμε ένα μεταβλητό αντικείμενο (:class:`list`, :class:`dict`, :class:`set`, κλπ.), μπορούμε να χρησιμοποιήσουμε ορισμένες συγκεκριμένες λειτουργίες για να το μεταλλάξουμε και όλες τις μεταβλητές που αναφέρονται σε αυτό θα δουν την αλλαγή.

source: If we have an immutable object (:class:`str`, :class:`int`, :class:`tuple`, etc.), all the variables that refer to it will always see the same value, but operations that transform that value into a new value always return a new object.
el: Εάν έχουμε ένα αμετάβλητο αντικείμενο (:class:`str`, :class:`int`, :class:`tuple`, κλπ.), όλες οι μεταβλητές που αναφέρονται σε αυτό θα βλέπουν πάντα την ίδια τιμή, αλλά οι λειτουργίες που θα μετατρέπουν αυτήν την τιμή σε μια νέα τιμή επιστρέφουν πάντα ένα νέο αντικείμενο.

source: If you want to know if two variables refer to the same object or not, you can use the :keyword:`is` operator, or the built-in function :func:`id`.
el: Εάν θέλετε να γνωρίζετε εάν δύο μεταβλητές αναφέρονται στο ίδιο αντικείμενο ή όχι, μπορείτε να χρησιμοποιήσετε τον :keyword:`is` operator, ή την ενσωματωμένη συνάρτηση :func:`id`.

source: How do I write a function with output parameters (call by reference)?
el: Πως μπορώ να γράψω μια συνάρτηση με παραμέτρους εξόδου (κλήση με αναφορά);

source: Remember that arguments are passed by assignment in Python. Since assignment just creates references to objects, there's no alias between an argument name in the caller and callee, and so no call-by-reference per se. You can achieve the desired effect in a number of ways.
el: Να θυμάστε ότι τα ορίσματα μεταβιβάζονται με ανάθεση στην Python. Εφόσον η εκχώρηση δημιουργεί απλώς αναφορές σε αντικείμενα, δεν υπάρχει ψευδώνυμο μεταξύ ενός ονόματος ορίσματος σε αυτό που καλεί και σε αυτό που καλείται, και επομένως δεν υπάρχει κλήση προς αναφορά από μόνη της. Μπορείτε να επιτύχετε το επιθυμητό αποτέλεσμα με διάφορους τρόπους.

source: By returning a tuple of the results::
el: Επιστρέφοντας μια πλειάδα των αποτελεσμάτων::

source: This is almost always the clearest solution.
el: Αυτή είναι σχεδόν πάντα η πιο ξεκάθαρη λύση.

source: By using global variables. This isn't thread-safe, and is not recommended.
el: Χρησιμοποιώντας καθολικές μεταβλητές. Αυτό δεν είναι ασφαλές για νήμα και δεν συνίσταται.

source: By passing a mutable (changeable in-place) object::
el: Περνώντας ένα μεταβλητό (με δυνατότητα αλλαγής επί τόπου) αντικείμενο::

source: By passing in a dictionary that gets mutated::
el: Περνώντας σε ένα λεξικό που μεταλλάσσεται::

source: Or bundle up values in a class instance::
el: Ή ομαδοποιήστε τιμές σε μια παρουσία κλάσης::

source: There's almost never a good reason to get this complicated.
el: Δεν υπάρχει σχεδόν ποτέ καλός λόγος να γίνει αυτό περίπλοκο.

source: Your best choice is to return a tuple containing the multiple results.
el: Η καλύτερη επιλογή σας είναι να επιστρέψετε μια πλειάδα που περιέχει πολλαπλά αποτελέσματα.

source: How do you make a higher order function in Python?
el: Πως δημιουργείτε μια συνάρτηση υψηλότερης τάξης στην Python;

source: You have two choices: you can use nested scopes or you can use callable objects. For example, suppose you wanted to define ``linear(a,b)`` which returns a function ``f(x)`` that computes the value ``a*x+b``. Using nested scopes::
el: Έχετε δύο επιλογές: μπορείτε να χρησιμοποιήσετε ένθετα πεδία ή μπορείτε να χρησιμοποιήσετε callable αντικείμενα. Για παράδειγμα, ας υποθέσουμε ότι θέλετε να ορίσετε το ``linear(a,b)`` που επιστρέφει μια συνάρτηση ``f(x)`` που υπολογίζει την τιμή ``a*x+b``. Χρησιμοποιώντας ένθετα πεδία::

source: Or using a callable object::
el: Ή χρησιμοποιώντας ένα callable αντικείμενο::

source: In both cases, ::
el: Και στις δύο περιπτώσεις::

source: gives a callable object where ``taxes(10e6) == 0.3 * 10e6 + 2``.
el: δίνει ένα callable αντικείμενο όπου ``taxes(10e6) == 0.3 * 10e6 + 2``.

source: The callable object approach has the disadvantage that it is a bit slower and results in slightly longer code. However, note that a collection of callables can share their signature via inheritance::
el: Η προσέγγιση του callable αντικειμένου έχει το μειονέκτημα ότι είναι λίγο πιο αργή και οδηγεί σε ελαφρώς μεγαλύτερο κώδικα. Ωστόσο, σημειώστε ότι μια συλλογή από callables μπορεί να μοιραστεί την υπογραφή τους μέσω κληρονομικότητας::

source: Object can encapsulate state for several methods::
el: Το αντικείμενο μπορεί να ενθυλακώσει την κατάσταση για πολλές μεθόδους::

source: Here ``inc()``, ``dec()`` and ``reset()`` act like functions which share the same counting variable.
el: Εδώ ``inc()``, ``dec()`` και ``reset()`` λειτουργούν σαν συναρτήσεις που μοιράζονται την ίδια μεταβλητή μέτρησης.

source: How do I copy an object in Python?
el: Πως μπορώ να αντιγράψω ένα αντικείμενο στην Python;

source: In general, try :func:`copy.copy` or :func:`copy.deepcopy` for the general case. Not all objects can be copied, but most can.
el: Γενικά, δοκιμάστε :func:`copy.copy` ή :func:`copy.deepcopy` για τη γενική περίπτωση. Δεν μπορούν να αντιγραφούν όλα τα αντικείμενα, αλλά τα περισσότερα μπορούν.

source: Some objects can be copied more easily. Dictionaries have a :meth:`~dict.copy` method::
el: Ορισμένα αντικείμενα μπορούν να αντιγραφούν πιο εύκολα. Τα λεξικά έχουν μία μέθοδο :meth:`~dict.copy`::

source: Sequences can be copied by slicing::
el: Οι ακολουθίες μπορούν να αντιγραφούν με τεμαχισμό::

source: How can I find the methods or attributes of an object?
el: Πως μπορώ να βρω τις μεθόδους ή τα χαρακτηριστικά ενός αντικειμένου;

source: For an instance ``x`` of a user-defined class, :func:`dir(x) <dir>` returns an alphabetized list of the names containing the instance attributes and methods and attributes defined by its class.
el: Για παράδειγμα μια κλάση ``x`` που ορίζεται από το χρήστη, :func:`dir(x) <dir>` επιστρέφει μια αλφαβητική λίστα με τα ονόματα που περιέχει τα χαρακτηριστικά της οντότητας και τις μεθόδους και τα χαρακτηριστικά που ορίζονται από την κλάση του.

source: How can my code discover the name of an object?
el: Πως μπορεί ο κώδικας μου να ανακαλύψει το όνομα ενός αντικειμένου;

source: Generally speaking, it can't, because objects don't really have names. Essentially, assignment always binds a name to a value; the same is true of ``def`` and ``class`` statements, but in that case the value is a callable. Consider the following code::
el: Γενικά μιλώντας, δεν μπορεί, επειδή τα αντικείμενα δεν έχουνε πραγματικά ονόματα. Ουσιαστικά, η εκχώρηση δεσμεύει πάντα ένα όνομα σε μια τιμή∙ το ίδιο ισχύει για τις δηλώσεις ``def`` και ``class``, αλλά σε αυτή την περίπτωση η τιμή είναι callable. Λάβετε υπόψη τον ακόλουθο κώδικα::

source: Arguably the class has a name: even though it is bound to two names and invoked through the name ``B`` the created instance is still reported as an instance of class ``A``. However, it is impossible to say whether the instance's name is ``a`` or ``b``, since both names are bound to the same value.
el: Αναμφισβήτητα η κλάση έχει ένα όνομα: παρόλο που είναι δεσμευμένη σε δύο ονόματα και καλείται μέσω του ονόματος ``B`` η δημιουργημένη οντότητα εξακολουθεί να αναφέρεται ως οντότητα της κλάσης ``A``. Ωστόσο, είναι αδύνατο να πούμε είτε το όνομα της οντότητας είναι ``a`` ή ``b``, καθώς και τα δύο ονόματα συνδέονται με την ίδια τιμή.

source: Generally speaking it should not be necessary for your code to "know the names" of particular values. Unless you are deliberately writing introspective programs, this is usually an indication that a change of approach might be beneficial.
el: Γενικά μιλώντας, δεν θα πρέπει να είναι απαραίτητο ο κώδικας σας να "γνωρίζει τα ονόματα" συγκεκριμένων τιμών. Αν δεν γράφετε εσκεμμένα ενδοσκοπικά (introspective) προγράμματα, αυτό είναι συνήθως μια ένδειξη ότι μια αλλαγή προσέγγισης μπορεί να είναι επωφελής.

source: In comp.lang.python, Fredrik Lundh once gave an excellent analogy in answer to this question:
el: Στο comp.lang.python, ο Fredrik Lundh έδωσε μια εξαιρετική αναλογία ως απάντηση σε αυτήν την ερώτηση:

source: The same way as you get the name of that cat you found on your porch: the cat (object) itself cannot tell you its name, and it doesn't really care -- so the only way to find out what it's called is to ask all your neighbours (namespaces) if it's their cat (object)...
el: Με το ίδιο τρόπο που παίρνετε το όνομα αυτής της γάτας που βρήκατε στη βεράντα σας: ή ίδια γάτα (αντικείμενο) δεν μπορεί να σας πει το όνομά της και δεν την ενδιαφέρει πραγματικά - έτσι ο μόνος τρόπος για να μάθετε πως λέγεται είναι να ρωτήσετε όλους τους γείτονές σας (namespaces) αν είναι η γάτα τους (αντικείμενο)...

source: ....and don't be surprised if you'll find that it's known by many names, or no name at all!
el: ....και μην εκπλαγείτε αν διαπιστώσετε ότι είναι γνωστό με πολλά ονόματα, ή κανένα όνομα!

source: What's up with the comma operator's precedence?
el: Τι συμβαίνει με την προτεραιότητα του τελεστή κόμματος;

source: Comma is not an operator in Python. Consider this session::
el: Το κόμμα δεν είναι τελεστής στην Python. Σκεφτείτε αυτήν την συνεδρία::

source: Since the comma is not an operator, but a separator between expressions the above is evaluated as if you had entered::
el: Δεδομένου ότι το κόμμα δεν είναι τελεστής, αλλά διαχωριστικό μεταξύ των εκφράσεων, τα παραπάνω αξιολογούνται σαν να είχατε εισαγάγει::

source: not::
el: δεν::

source: The same is true of the various assignment operators (``=``, ``+=`` etc). They are not truly operators but syntactic delimiters in assignment statements.
el: Το ίδιο ισχύει για τους διάφορους τελεστές εκχώρησης (``=``, ``+=`` κλπ). Δεν είναι πραγματικά τελεστές αλλά συντακτικοί delimiters σε δηλώσεις εκχώρησης.

source: Is there an equivalent of C's "?:" ternary operator?
el: Υπάρχει ισοδύναμο του τριαδικού τελεστή "?:" της C;

source: Yes, there is. The syntax is as follows::
el: Ναι υπάρχει, Η σύνταξη έχει ως εξής::

source: Before this syntax was introduced in Python 2.5, a common idiom was to use logical operators::
el: Πριν εισαχθεί αυτή η σύνταξη στην Python 2.5, ένα κοινό ιδίωμα ήταν η χρήση λογικών τελεστών::

source: However, this idiom is unsafe, as it can give wrong results when *on_true* has a false boolean value. Therefore, it is always better to use the ``... if ... else ...`` form.
el: Ωστόσο, αυτό το ιδίωμα δεν είναι ασφαλές, καθώς μπορεί να δώσει λανθασμένα αποτελέσματα όταν το *on_true* έχει ψευδή δυαδική τιμή. Επομένως, είναι πάντα καλύτερο να χρησιμοποιήσετε τη φόρμα ``... if ... else ...``.

source: Is it possible to write obfuscated one-liners in Python?
el: Είναι δυνατόν να γράψουμε ασαφή one-liners στην Python;

source: Yes. Usually this is done by nesting :keyword:`lambda` within :keyword:`!lambda`. See the following three examples, slightly adapted from Ulf Bartelt::
el: Ναι. Συνήθως αυτό γίνεται με ένθεση του :keyword:`lambda` εντός του :keyword:`!lambda`. Δείτε τα ακόλουθα τρία παραδείγματα, ελαφρώς προσαρμοσμένα από τον Ulf Bartelt::

source: Don't try this at home, kids!
el: Μην το δοκιμάσετε στο σπίτι, παιδιά!

source: What does the slash(/) in the parameter list of a function mean?
el: Τι σημαίνει η κάθετος(/) στη λίστα παραμέτρων μιας συνάρτησης;

source: A slash in the argument list of a function denotes that the parameters prior to it are positional-only. Positional-only parameters are the ones without an externally usable name. Upon calling a function that accepts positional-only parameters, arguments are mapped to parameters based solely on their position. For example, :func:`divmod` is a function that accepts positional-only parameters. Its documentation looks like this::
el: Μια κάθετος στη λίστα ορισμάτων μιας συνάρτησης υποδηλώνει ότι οι παράμετροι πριν από αυτήν είναι μόνο θέσης. Οι παράμετροι μόνο θέσης είναι εκείνες χωρίς εξωτερικά χρησιμοποιήσιμο όνομα. Κατά την κλήση μιας συνάρτησης που δέχεται παραμέτρους μόνο θέσης, τα ορίσματα αντιστοιχίζονται σε παραμέτρους που βασίζονται αποκλειστικά στη θέση τους. Για παράδειγμα η :func:`divmod` είναι μια συνάρτηση που δέχεται μόνο παραμέτρους θέσης. Η τεκμηρίωσή τους μοιάζει με αυτό::

source: The slash at the end of the parameter list means that both parameters are positional-only. Thus, calling :func:`divmod` with keyword arguments would lead to an error::
el: Η κάθετος στο τέλος της λίστας παραμέτρων σημαίνει ότι και οι δύο παράμετροι είναι μόνο θέσης. Επομένως, η κλήση της :func:`divmod` με ορίσματα λέξεων κλειδιών θα οδηγούσε σε σφάλμα::

source: Numbers and strings
el: Αριθμοί και συμβολοσειρές

source: How do I specify hexadecimal and octal integers?
el: Πώς προσδιορίζω δεκαεξαδικούς ή οκταδικούς ακέραιους αριθμούς;

source: To specify an octal digit, precede the octal value with a zero, and then a lower or uppercase "o". For example, to set the variable "a" to the octal value "10" (8 in decimal), type::
el: Για να καθορίσετε έναν οκταδικό ψηφίο, προηγείται την οκταδικής τιμής με ένα μηδέν, ¨και μετά ένα πεζό ή κεφαλαίο "o". Για παράδειγμα, για να ορίσετε τη μεταβλητή "a" στην οκταδική τιμή "10" (8 σε δεκαδικό), πληκτρολογήστε::

source: Hexadecimal is just as easy. Simply precede the hexadecimal number with a zero, and then a lower or uppercase "x". Hexadecimal digits can be specified in lower or uppercase. For example, in the Python interpreter::
el: Το δεκαεξαδικό είναι εξίσου εύκολο. Απλώς προηγείται του δεκαεξαδικού αριθμού με ένα μηδέν, και μετά ένα πεζό ή κεφαλαίο "x". Τα δεκαεξαδικά ψηφία μπορούν να καθοριστούν με πεζά ή κεφαλαία. Για παράδειγμα, στον διερμηνέα Python::

source: Why does -22 // 10 return -3?
el: Γιατί το -22 // 10 επιστρέφει -3;

source: It's primarily driven by the desire that ``i % j`` have the same sign as ``j``. If you want that, and also want::
el: Οφείλεται κυρίως στην επιθυμία που το ``i % j`` να έχει το ίδιο πρόσημο με το ``j``. Εάν το θέλετε αυτό, και θέλετε επίσης::
