Repository: pygreece/python-docs-gr
Catalog: faq/programming.po
Languages: el

source: A module can find out its own module name by looking at the predefined global variable ``__name__``. If this has the value ``'__main__'``, the program is running as a script. Many modules that are usually used by importing them also provide a command-line interface or a self-test, and only execute this code after checking ``__name__``::
el: Ένα module μπορεί να βρει το δικό του όνομα module κοιτάζοντας την προκαθορισμένη καθολική μεταβλητή ``__name__``. Εάν αυτή έχει την τιμή ``__main__``, το πρόγραμμα εκτελείται ως σενάριο. Πολλά modules που χρησιμοποιούνται συνήθως με την εισαγωγή τους παρέχουν επίσης μια διεπαφή γραμμής εντολών ή έναν αυτοέλεγχο και εκτελέστε αυτόν τον κώδικα μόνο αφού ελέγξετε το ``__name__``::

source: How can I have modules that mutually import each other?
el: Πως μπορώ να έχω modules που εισάγουν αμοιβαία το ένα το άλλο;

source: Suppose you have the following modules:
el: Υποθέστε ότι έχετε τα ακόλουθα modules::

source: The problem is that the interpreter will perform the following steps:
el: Το πρόβλημα είναι ότι ο διερμηνέας θα εκτελέσει τα ακόλουθα βήματα:

source: main imports ``foo``
el: main εισάγει ``foo``

source: Empty globals for ``foo`` are created
el: Δημιουργούνται κενά καθολικά για το ``foo``

source: ``foo`` is compiled and starts executing
el: Το ``foo`` μεταγλωττίζεται και ξεκινά η εκτέλεση

source: ``foo`` imports ``bar``
el: ``foo`` εισάγει ``bar``

source: Empty globals for ``bar`` are created
el: Δημιουργούνται κενά καθολικά για ``bar``

source: ``bar`` is compiled and starts executing
el: Το ``bar`` μεταγλωττίζεται και αρχίζει να εκτελείται

source: ``bar`` imports ``foo`` (which is a no-op since there already is a module named ``foo``)
el: Το ``bar`` εισάγει το ``foo`` (το οποίο είναι απαγορευτικό, καθώς υπάρχει ήδη ένα module με το όνομα ``foo``)

source: The import mechanism tries to read ``foo_var`` from ``foo`` globals, to set ``bar.foo_var = foo.foo_var``
el: Ο μηχανισμός εισαγωγής προσπαθεί να διαβάσει το ``foo_var`` από τα παγκόσμια ``foo``, για να ορίσει το ``bar.foo_var = foo.foo_var``

source: The last step fails, because Python isn't done with interpreting ``foo`` yet and the global symbol dictionary for ``foo`` is still empty.
el: Το τελευταίο βήμα αποτυγχάνει, επειδή η Python δεν έχει τελειώσει ακόμα με την ερμηνεία του ``foo`` και το global λεξικό συμβόλων για το ``foo`` είναι ακόμα κενό.

source: The same thing happens when you use ``import foo``, and then try to access ``foo.foo_var`` in global code.
el: Το ίδιο συμβαίνει όταν χρησιμοποιείτε το ``import foo`` και, στη συνέχεια, προσπαθείτε να αποκτήσετε πρόσβαση στο ``foo.foo_var`` σε καθολικό κώδικα.

source: There are (at least) three possible workarounds for this problem.
el: Υπάρχουν (τουλάχιστον) τρεις πιθανοί τρόποι αντιμετώπισης αυτού του προβλήματος.

source: Guido van Rossum recommends avoiding all uses of ``from <module> import ...``, and placing all code inside functions. Initializations of global variables and class variables should use constants or built-in functions only. This means everything from an imported module is referenced as ``<module>.<name>``.
el: Ο Guido van Rossum συνιστά την αποφυγή όλων των χρήσεων του ``from <module> import ...`` και την τοποθέτηση όλου του κώδικα μέσα σε συναρτήσεις. Τα initializations καθολικών μεταβλητών και μεταβλητών κλάσης θα πρέπει να χρησιμοποιηθούν μόνο σταθερές ή ενσωματωμένες συναρτήσεις. Αυτό σημαίνει ότι ένα εισαγόμενο module αναφέρεται ως ``<module>.<name>``.

source: Jim Roskind suggests performing steps in the following order in each module:
el: Ο Jim Roskind προτείνει να εκτελέσετε τα βήματα με την ακόλουθη σειρά σε κάθε module:

source: exports (globals, functions, and classes that don't need imported base classes)
el: εξαγωγές (globals, συναρτήσεις, και κλάσεις που δεν χρειάζονται εισαγόμενες βασικές κλάσεις)

source: ``import`` statements
el: δηλώσεις ``import``

source: active code (including globals that are initialized from imported values).
el: ενεργός κώδικας (συμπεριλαμβανομένων των καθολικών που αρχικοποιούνται από εισαγόμενες τιμές).

source: Van Rossum doesn't like this approach much because the imports appear in a strange place, but it does work.
el: Ο Van Rossum δεν αρέσει πολύ αυτή η προσέγγιση επειδή οι εισαγωγές εμφανίζονται σε ένα περίεργο μέρος, αλλά λειτουργεί.

source: Matthias Urlichs recommends restructuring your code so that the recursive import is not necessary in the first place.
el: Ο Matthias Urlichs συνιστά την αναδιάρθρωση του κώδικά σας έτσι ώστε η αναδρομική εισαγωγή να μην είναι απαραίτητη εξαρχής.

source: These solutions are not mutually exclusive.
el: Αυτές οι λύσεις δεν αλληλοαποκλείονται.

source: __import__('x.y.z') returns <module 'x'>; how do I get z?
el: __import__('x.y.z') επιστρέφει <module 'x'>∙ πως μπορώ να πάρω το z?

source: Consider using the convenience function :func:`~importlib.import_module` from :mod:`importlib` instead::
el: Σκεφτείτε να χρησιμοποιήσετε τη συνάρτηση ευκολίας :func:`~importlib.import_module` από το :mod:`importlib` αντί::

source: When I edit an imported module and reimport it, the changes don't show up. Why does this happen?
el: Όταν επεξεργάζομαι ένα module που έχει εισαχθεί και την επανεισάγω, οι αλλαγές δεν εμφανίζονται. Γιατί συμβαίνει αυτό;

source: For reasons of efficiency as well as consistency, Python only reads the module file on the first time a module is imported. If it didn't, in a program consisting of many modules where each one imports the same basic module, the basic module would be parsed and re-parsed many times. To force re-reading of a changed module, do this::
el: Για λόγους αποτελεσματικότητας καθώς και συνέπειας, η Python διαβάζει το αρχείο της ενότητας μόνο την πρώτη φορά που εισάγεται μια λειτουργική μονάδα. Εάν δεν το έκανε, σε ένα πρόγραμμα που αποτελείται από πολλές ενότητες όπου η καθεμία εισάγει το ίδιο βασικό module, το βασικό module θα αναλυθεί και θα αναλυθεί ξανά πολλές φορές. Για να αναγκάσετε τη εκ νέου ανάγνωση μιας αλλαγμένης ενότητας , κάντε το εξής::

source: Warning: this technique is not 100% fool-proof. In particular, modules containing statements like ::
el: Προειδοποίηση: αυτή η τεχνική δεν είναι 100% ασφαλής. Ειδικότερα, modules που περιέχουν δηλώσεις όπως ::

source: will continue to work with the old version of the imported objects. If the module contains class definitions, existing class instances will *not* be updated to use the new class definition. This can result in the following paradoxical behaviour::
el: θα συνεχίσει να λειτουργεί με την παλιά έκδοση των εισαγόμενων αντικειμένων. Εάν η λειτουργική μονάδα περιέχει ορισμούς κλάσεων, οι υπάρχουσες παρουσίες κλάσεων *δεν* θα ενημερωθούν για να χρησιμοποιούν τον ορισμό της νέας κλάσης. Αυτό μπορεί να οδηγήσει στην ακόλουθη παράδοξη συμπεριφορά::

source: The nature of the problem is made clear if you print out the "identity" of the class objects::
el: Η φύση του προβλήματος καθίσταται σαφής εάν εκτυπώσετε την "ταυτότητα" των αντικειμένων κλάσης::

source: argument
el: όρισμα

source: difference from parameter
el: διαφορά από παράμετρο

source: parameter
el: παράμετρος

source: difference from argument
el: διαφορά από όρισμα
