Repository: pygreece/python-docs-gr
Catalog: faq/windows.po
Languages: el

source: Python on Windows FAQ
el: Python στα Windows FAQ

source: Contents
el: Περιεχόμενα

source: How do I run a Python program under Windows?
el: Πως μπορώ να εκτελέσω ένα πρόγραμμα Python στα Windows;

source: This is not necessarily a straightforward question. If you are already familiar with running programs from the Windows command line then everything will seem obvious; otherwise, you might need a little more guidance.
el: Αυτό δεν είναι απαραίτητα μια απλή ερώτηση. Εάν είστε ήδη εξοικειωμένοι με την εκτέλεση προγραμμάτων από τη γραμμή εντολών των Windows τότε όλα θα φαίνονται προφανή' διαφορετικά, μπορεί να χρειαστεί λίγη περισσότερη καθοδήγηση.

source: Unless you use some sort of integrated development environment, you will end up *typing* Windows commands into what is referred to as a "Command prompt window". Usually you can create such a window from your search bar by searching for ``cmd``. You should be able to recognize when you have started such a window because you will see a Windows "command prompt", which usually looks like this:
el: Εκτός και αν χρησιμοποιείτε κάποιο είδος ενσωματωμένου περιβάλλοντος ανάπτυξης, θα καταλήξετε πληκτρολογώντας εντολές των Windows σε αυτό που αναφέρεται ως "Command prompt window". Συνήθως μπορείτε να δημιουργήσετε ένα τέτοιο παράθυρο από τη γραμμή αναζήτησης σας κάνοντας αναζήτηση για ``cmd``. Θα πρέπει να μπορείτε να αναγνωρίσετε πότε έχετε ξεκινήσει ένα τέτοιο παράθυρο επειδή θα δείτε ένα "command prompt" των Windows, η οποία συνήθως μοιάζει με αυτό:

source: The letter may be different, and there might be other things after it, so you might just as easily see something like:
el: Το γράμμα μπορεί να είναι διαφορετικό, και μπορεί να υπάρχουνε άλλα πράγματα μετά από αυτό, έτσι μπορείτε να δείτε εξίσου εύκολα κάτι σαν:

source: depending on how your computer has been set up and what else you have recently done with it. Once you have started such a window, you are well on the way to running Python programs.
el: ανάλογα με το πως έχει ρυθμιστεί ο υπολογιστής σας και τι άλλο έχετε κάνει με αυτόν. Μόλις ξεκινήσετε ένα τέτοιο παράθυρο, είστε σε καλό δρόμο για την εκτέλεση προγραμμάτων Python.

source: You need to realize that your Python scripts have to be processed by another program called the Python *interpreter*. The interpreter reads your script, compiles it into bytecodes, and then executes the bytecodes to run your program. So, how do you arrange for the interpreter to handle your Python?
el: Πρέπει να συνειδητοποιήσετε ότι τα Python σενάρια σας πρέπει να επεξεργαστούν από άλλο πρόγραμμα που ονομάζεται Python *interpreter*. Ο interpreter διαβάζει το σενάριο σας, το κάνει compile σε bytecodes και στη συνέχεια εκτελεί τα bytecodes για να τρέξει το πρόγραμμά σας. Λοιπόν, πως ρυθμίζετε τον interpreter για να χειριστεί την Python σας;

source: First, you need to make sure that your command window recognises the word "py" as an instruction to start the interpreter. If you have opened a command window, you should try entering the command ``py`` and hitting return:
el: Πρώτα από όλα, πρέπει να σιγουρευτείτε ότι το παράθυρο εντολών σας αναγνωρίζει την λέξη "py" ως οδηγία για την έναρξη του interpreter. Εάν έχετε ανοίξει ένα παράθυρο εντολών, θα πρέπει να δοκιμάσετε να εισαγάγετε την εντολή ``py`` και να πατήσετε return:

source: You should then see something like:
el: Στη συνέχεια, θα πρέπει να δείτε κάτι σαν:

source: You have started the interpreter in "interactive mode". That means you can enter Python statements or expressions interactively and have them executed or evaluated while you wait. This is one of Python's strongest features. Check it by entering a few expressions of your choice and seeing the results:
el: Έχετε ξεκινήσει τον interpreter σε "interactive mode". Αυτό σημαίνει ότι μπορείτε να εισάγετε δηλώσεις ή εκφράσεις Python διαδραστικά και να τις εκτελείτε ή να τις αξιολογείτε ενώ περιμένετε. Αυτό είναι ένα από τα ισχυρότερα χαρακτηριστικά της Python. Ελέγξτε το εισάγοντας μερικές εκφράσεις της επιλογή σας και βλέποντας τα αποτελέσματα:

source: Many people use the interactive mode as a convenient yet highly programmable calculator. When you want to end your interactive Python session, call the :func:`exit` function or hold the :kbd:`Ctrl` key down while you enter a :kbd:`Z`, then hit the ":kbd:`Enter`" key to get back to your Windows command prompt.
el: Πολλοί άνθρωποι χρησιμοποιούν τη διαδραστική λειτουργία ως μια βολική αλλά εξαιρετικά προγραμματιζόμενη αριθμομηχανή. Όταν θέλετε να τερματίσετε τη διαδραστική συνεδρία Python, καλέστε τη συνάρτηση :func:`exit` ή κρατήστε πατημένο το πλήκτρο :kbd:`Ctrl` ενώ εισάγετε ένα :kbd:`Z`, και μετά πατήστε το πλήκτρο ":kbd:`Enter`" για να επιστρέψετε στο command prompt των Windows.

source: You may also find that you have a Start-menu entry such as :menuselection:`Start --> Programs --> Python 3.x --> Python (command line)` that results in you seeing the ``>>>`` prompt in a new window. If so, the window will disappear after you call the :func:`exit` function or enter the :kbd:`Ctrl-Z` character; Windows is running a single "python" command in the window, and closes it when you terminate the interpreter.
el: Μπορεί επίσης να διαπιστώσετε ότι έχετε μια καταχώρηση στο Start-menu όπως :menuselection:`Start --> Programs --> Python 3.x --> Python (command line)` που έχει ως αποτέλεσμα να βλέπετε το ``>>>`` σε ένα νέο παράθυρο, το παράθυρο θα εξαφανιστεί αφού καλέσετε τη συνάρτηση :func:`exit` ή εισαγάγετε τον χαρακτήρα :kbd:`Ctrl-Z`' τα Windows εκτελούν μία μόνο εντολή "python" στο παράθυρο και την κλείνουν όταν τερματίζετε τον interpreter.

source: Now that we know the ``py`` command is recognized, you can give your Python script to it. You'll have to give either an absolute or a relative path to the Python script. Let's say your Python script is located in your desktop and is named ``hello.py``, and your command prompt is nicely opened in your home directory so you're seeing something similar to::
el: Τώρα που γνωρίζουμε ότι η εντολή ``py`` αναγνωρίζεται, μπορείτε να της δώσετε το σενάριο Python σας. Θα πρέπει να δώσετε είτε μια απόλυτη είτε μια σχετική διαδρομή προς στο σενάριο Python. Ας υποθέσουμε ότι το σενάριο Python σας βρίσκεται στην επιφάνεια εργασίας σας και ονομάζεται ``hello.py``, και η γραμμή εντολών σας ανοίγει όμορφα στον αρχικό σας κατάλογο, ώστε να βλέπετε κάτι παρόμοιο με::

source: So now you'll ask the ``py`` command to give your script to Python by typing ``py`` followed by your script path::
el: Λοιπόν τώρα θα ζητήσετε από την εντολή ``py`` να δώσει το σενάριο σας στην Python πληκτρολογώντας ``py`` ακολουθούμενη από τη διαδρομή του σεναρίου σας::

source: How do I make Python scripts executable?
el: Πως κάνω τα Python scripts εκτελέσιμα;

source: On Windows, the standard Python installer already associates the .py extension with a file type (Python.File) and gives that file type an open command that runs the interpreter (``D:\Program Files\Python\python.exe "%1" %*``). This is enough to make scripts executable from the command prompt as 'foo.py'. If you'd rather be able to execute the script by simple typing 'foo' with no extension you need to add .py to the PATHEXT environment variable.
el: Στα Windows, το τυπικό πρόγραμμα εγκατάστασης Python ήδη συσχετίζει την επέκταση .py με έναν τύπο αρχείου μια ανοιχτή εντολή που εκτελεί τον διερμηνέα (``D:\Program Files\Python\python.exe "%1" %*``). Αυτό είναι αρκετό για να κάνετε τα scripts εκτελέσιμα από τη γραμμή εντολών ως 'foo.py'. Εάν προτιμάτε να μπορείτε να εκτελέσετε το σενάριο πληκτρολογώντας απλά 'foo' χωρίς επέκταση, πρέπει να προσθέσετε .py στη μεταβλητή περιβάλλοντος PATHTEXT.

source: Why does Python sometimes take so long to start?
el: Γιατί μερικές φορές η Python αργεί τόσο πολύ να ξεκινήσει;

source: Usually Python starts very quickly on Windows, but occasionally there are bug reports that Python suddenly begins to take a long time to start up. This is made even more puzzling because Python will work fine on other Windows systems which appear to be configured identically.
el: Συνήθως η Python ξεκινά πολύ γρήγορα στα Windows, αλλά περιστασιακά υπάρχουν αναφορές σφαλμάτων ότι η Python αρχίζει ξαφνικά να παίρνει πολύ χρόνο για να ξεκινήσει. Αυτό γίνεται ακόμα πιο αινιγματικό, επειδή η Python θα λειτουργεί καλά σε άλλα συστήματα Windows που φαίνεται να έχουν διαμορφωθεί με τον ίδιο τρόπο.

source: The problem may be caused by a misconfiguration of virus checking software on the problem machine. Some virus scanners have been known to introduce startup overhead of two orders of magnitude when the scanner is configured to monitor all reads from the filesystem. Try checking the configuration of virus scanning software on your systems to ensure that they are indeed configured identically. McAfee, when configured to scan all file system read activity, is a particular offender.
el: Το πρόβλημα μπορεί να οφείλεται σε εσφαλμένη διαμόρφωση του λογισμικού ελέγχου ιών στο προβληματικό μηχάνημα. Ορισμένοι σαρωτές ιών είναι γνωστό ότι εισάγουν επιβάρυνση εκκίνησης δύο τάξεων μεγέθους όταν ο σαρωτής έχει ρυθμιστεί να παρακολουθεί όλες τις αναγνώσεις από το σύστημα αρχείων. Δοκιμάστε να ελέγξετε τη διαμόρφωση του λογισμικού ιών στα συστήματά σας για να βεβαιωθείτε ότι έχουν όντως διαμορφωθεί πανομοιότυπα. Το McAfee, όταν έχει ρυθμιστεί να σαρώνει όλη τη δραστηριότητα ανάγνωσης του συστήματος αρχείων , είναι ένας συγκεκριμένος φταίχτης.

source: How do I make an executable from a Python script?
el: Πώς μπορώ να δημιουργήσω ένα εκτελέσιμο από ένα σενάριο Python;

source: See :ref:`faq-create-standalone-binary` for a list of tools that can be used to make executables.
el: Βλ. :ref:`faq-create-standalone-binary` για μια λίστα εργαλείων που μπορούν να χρησιμοποιηθούν για τη δημιουργία εκτελέσιμων αρχείων.

source: Is a ``*.pyd`` file the same as a DLL?
el: Είναι ένα αρχείο ``*.pyd`` ίδιο με ένα αρχείο DLL;

source: Yes, .pyd files are dll's, but there are a few differences. If you have a DLL named ``foo.pyd``, then it must have a function ``PyInit_foo()``. You can then write Python "import foo", and Python will search for foo.pyd (as well as foo.py, foo.pyc) and if it finds it, will attempt to call ``PyInit_foo()`` to initialize it. You do not link your .exe with foo.lib, as that would cause Windows to require the DLL to be present.
el: Ναι, τα αρχεία .pyd είναι dll, αλλά υπάρχουν μερικές διαφορές. Εάν έχετε ένα DLL με το όνομα ``foo.pyd``, τότε πρέπει να έχει μια συνάρτηση ``PyInit_foo()``. Στη συνέχεια μπορείτε να γράψετε Python "import foo", και η Python θα αναζητήσει το foo.pyd (καθώς και το foo.py, foo.pyc) και να το βρει, θα προσπαθήσει να καλέσει το ``PyInit_foo()`` για να το αρχικοποιήσει. Δεν συνδέετε το .exe σας με το foo.lib, καθώς αυτό θα έκανα τα Windows να απαιτήσουν την παρουσία DLL.

source: Note that the search path for foo.pyd is PYTHONPATH, not the same as the path that Windows uses to search for foo.dll. Also, foo.pyd need not be present to run your program, whereas if you linked your program with a dll, the dll is required. Of course, foo.pyd is required if you want to say ``import foo``. In a DLL, linkage is declared in the source code with ``__declspec(dllexport)``. In a .pyd, linkage is defined in a list of available functions.
el: Λάβετε υπόψη ότι η διαδρομή αναζήτησης για το foo.pyd είναι το PYTHONPATH, δεν είναι ίδια με τη διαδρομή που χρησιμοποιούν τα Windows για την αναζήτηση του foo.dll. Επίσης, το foo.pyd δεν χρειάζεται να υπάρχει για την εκτέλεση του προγράμματος σας, ενώ εάν συνδέσετε το πρόγραμμά σας με ένα dll, απαιτείται το dll. Φυσικά, απαιτείται το foo.pyd εάν θέλετε να πείτε ``import foo``. Σε ένα DLL, η σύνδεση δηλώνεται στον πηγαίο κώδικα με το ``__declspec(dllexport)``. Σε ένα .pyd, η σύνδεση ορίζεται σε μια λίστα διαθέσιμων συναρτήσεων.

source: How can I embed Python into a Windows application?
el: Πώς μπορώ να ενσωματώσω την Python σε μια εφαρμογή Windows;

source: Embedding the Python interpreter in a Windows app can be summarized as follows:
el: Η ενσωμάτωση του Python interpreter σε μια Windows εφαρμογή μπορεί να συνοψιστεί ως εξής:

source: Do **not** build Python into your .exe file directly. On Windows, Python must be a DLL to handle importing modules that are themselves DLL's. (This is the first key undocumented fact.) Instead, link to :file:`python{NN}.dll`; it is typically installed in ``C:\Windows\System``. *NN* is the Python version, a number such as "33" for Python 3.3.
el: Να **μην** δημιουργείτε απευθείας την Python στο αρχείο σας .exe. Στα Windows, η Python πρέπει να είναι DLL για να χειρίζεται την εισαγωγή λειτουργικών μονάδων που είναι τα ίδια DLL. (Αυτό είναι το πρώτο κλειδί που δεν τεκμηριώνεται.) Αντίθετα, συνδέστε το :file:`python{NN}.dll`' είναι συνήθως εγκατεστημένο στο ``C:\Windows\System``. *NN* είναι η έκδοση Python, ένας αριθμός όπως "33" για Python 3.3.

source: You can link to Python in two different ways. Load-time linking means linking against :file:`python{NN}.lib`, while run-time linking means linking against :file:`python{NN}.dll`. (General note: :file:`python{NN}.lib` is the so-called "import lib" corresponding to :file:`python{NN}.dll`. It merely defines symbols for the linker.)
el: Μπορείτε να συνδεθείτε με την Python με δύο διαφορετικούς τρόπους. Σύνδεση χρόνου φόρτωσης σημαίνει σύνδεση ενάντια στο :file:`python{NN}.lib`, ενώ η σύνδεση χρόνου εκτέλεσης σημαίνει σύνδεση ενάντια στο :file:`python{NN}.dll`. (Γενική σημείωση: :file:`python{NN}.lib` είναι το λεγόμενο "import lib" που αντιστοιχεί στο :file:`python{NN}.dll`. Απλώς ορίζει σύμβολα για το σύνδεσμο.)

source: Run-time linking greatly simplifies link options; everything happens at run time. Your code must load :file:`python{NN}.dll` using the Windows ``LoadLibraryEx()`` routine. The code must also use access routines and data in :file:`python{NN}.dll` (that is, Python's C API's) using pointers obtained by the Windows ``GetProcAddress()`` routine. Macros can make using these pointers transparent to any C code that calls routines in Python's C API.
el: Η σύνδεση χρόνου εκτέλεσης απλοποιεί σημαντικά τις επιλογές συνδέσμων. Όλα συμβαίνουν κατά την εκτέλεση. Ο κώδικα σας πρέπει να φορτώσει :file:`python{NN}.dll` χρησιμοποιώντας την ρουτίνα ``LoadLibraryEx()`` των Windows. Ο κώδικας πρέπει επίσης να χρησιμοποιεί ρουτίνες πρόσβασης και δεδομένα στο :file:`python{NN}.dll` (δηλαδή, το C API της Python) χρησιμοποιώντας δείκτες που λαμβάνονται από τη ρουτίνα των Windows ``GetProcAddress()``. Οι μακροεντολές μπορούν να κάνουν χρησιμοποιώντας αυτούς τους δείκτες διαφανείς σε οποιονδήποτε κώδικα C που καλεί ρουτίνες στο C API της Python.

source: If you use SWIG, it is easy to create a Python "extension module" that will make the app's data and methods available to Python. SWIG will handle just about all the grungy details for you. The result is C code that you link *into* your .exe file (!) You do **not** have to create a DLL file, and this also simplifies linking.
el: Εάν χρησιμοποιείτε SWIG, είναι εύκολο να δημιουργήσετε ένα Python "extension module" που θα κάνει τα δεδομένα και τις μεθόδους της εφαρμογής διαθέσιμα στην Python. Το SWIG θα χειριστεί σχεδόν όλες τις grungy λεπτομέρειες για εσάς. Το αποτέλεσμα είναι ο κώδικας C που συνδέεστε *στο* αρχείο σας .exe (!) **Δεν** χρειάζεται να δημιουργήσετε ένα αρχείο DLL και αυτό απλοποιεί επίσης τη σύνδεση.

source: SWIG will create an init function (a C function) whose name depends on the name of the extension module. For example, if the name of the module is leo, the init function will be called initleo(). If you use SWIG shadow classes, as you should, the init function will be called initleoc(). This initializes a mostly hidden helper class used by the shadow class.
el: Το SWIG θα δημιουργήσει μια συνάρτηση init (μια συνάρτηση C) της οποία το όνομα εξαρτάται από το όνομα της μονάδας επέκτασης. Για παράδειγμα, εάν το όνομά του module είναι leo, η συνάρτησης init θα ονομάζεται initleo(). Εάν χρησιμοποιείτε τη σκιά SWIG κλάσεις, όπως θα έπρεπε, η συνάρτηση init θα ονομάζεται initleoc(). Αυτό εκκινεί μια κυρίως κρυφή βοηθητική κλάση που χρησιμοποιείται από την κλάση σκιά.

source: The reason you can link the C code in step 2 into your .exe file is that calling the initialization function is equivalent to importing the module into Python! (This is the second key undocumented fact.)
el: Ο λόγος για τον οποίο μπορείτε να συνδέσετε τον κώδικα C στο βήμα 2 στο αρχείο σας .exe είναι ότι η κλήση της συνάρτησης αρχικοποίησης ισοδυναμεί με την εισαγωγή του module στην Python! (Αυτό είναι το δεύτερο κλειδί που δεν τεκμηριώνεται.)

source: In short, you can use the following code to initialize the Python interpreter with your extension module.
el: Με λίγα λόγια, μπορείτε να χρησιμοποιήσετε τον ακόλουθο κώδικα για να αρχικοποιήσετε τον Python interpreter με το module επέκτασης.

source: There are two problems with Python's C API which will become apparent if you use a compiler other than MSVC, the compiler used to build pythonNN.dll.
el: Υπάρχουν δύο προβλήματα με το C API της Python, τα οποία θα γίνουν εμφανή εάν χρησιμοποιήσετε έναν compiler διαφορετικό από τον MSVC, τον compiler που χρησιμοποιήθηκε για τη δημιουργία του pythonNN.dll.

source: Problem 1: The so-called "Very High Level" functions that take ``FILE *`` arguments will not work in a multi-compiler environment because each compiler's notion of a ``struct FILE`` will be different. From an implementation standpoint these are very low level functions.
el: Πρόβλημα 1: Οι λεγόμενες συναρτήσεις "Πολύ Υψηλού Επιπέδου" που λαμβάνουν ορίσματα ``FILE *`` δεν θα λειτουργούν σε multi-compiler περιβάλλον, επειδή η έννοια κάθε μεταγλωττιστή για ένα ``struct FILE`` θα είναι διαφορετική. Από την άποψη της εφαρμογής, πρόκειται για λειτουργίες πολύ χαμηλού επιπέδου.

source: Problem 2: SWIG generates the following code when generating wrappers to void functions:
el: Πρόβλημα 2: Το SWIG δημιουργεί τον ακόλουθο κώδικα όταν δημιουργεί wrappers σε void συναρτήσεις:

source: Alas, Py_None is a macro that expands to a reference to a complex data structure called _Py_NoneStruct inside pythonNN.dll. Again, this code will fail in a mult-compiler environment. Replace such code by:
el: Δυστυχώς, το Py_None είναι μια μακροεντολή που επεκτείνεται σε μια αναφορά σε μια σύνθετη δομή δεδομένων που ονομάζεται _Py_NoneStruct μέσα στο pythonNN.dll. Και πάλι, αυτός ο κώδικας θα αποτύχει σε ένα mult-compiler περιβάλλον. Αντικαταστήστε αυτόν τον κώδικα με:

source: It may be possible to use SWIG's ``%typemap`` command to make the change automatically, though I have not been able to get this to work (I'm a complete SWIG newbie).
el: Μπορεί να είναι δυνατή η χρήση της εντολής ``%typemap`` της SWIG για να γίνει αυτόματα η αλλαγή, αν και δεν κατάφερα να το κάνω αυτό να λειτουργήσει (είμαι εντελώς αρχάριος της SWIG).

source: Using a Python shell script to put up a Python interpreter window from inside your Windows app is not a good idea; the resulting window will be independent of your app's windowing system. Rather, you (or the wxPythonWindow class) should create a "native" interpreter window. It is easy to connect that window to the Python interpreter. You can redirect Python's i/o to _any_ object that supports read and write, so all you need is a Python object (defined in your extension module) that contains read() and write() methods.
el: Η χρήση ενός Python shell script για να δημιουργήσετε ένα Python interpreter παράθυρο μέσα από την εφαρμογή σας Windows δεν είναι καλή ιδέα' το παράθυρο που θα προκύψει θα είναι ανεξάρτητο από το σύστημα παραθύρου της εφαρμογής σας. Αντίθετα, εσείς (ή η κλάση wxPythonWindow) θα πρέπει να δημιουργήσετε ένα "εγγενές" (native) interpreter παράθυρο. Είναι εύκολο να συνδέσετε αυτό το παράθυρο με τον Python interpreter. Μπορείτε να ανακατευθύνετε το i/o της Python στο _any_ αντικείμενο που υποστηρίζει ανάγνωση και εγγραφή, επομένως το μόνο που χρειάζεστε είναι ένα αντικείμενο Python (που ορίζεται στο module επέκτασης) που περιέχει τις μεθόδους read() και write().

source: How do I keep editors from inserting tabs into my Python source?
el: Πως μπορώ να εμποδίσω τους editors να εισάγουν tabs στον πηγαίο της Python μου;

source: The FAQ does not recommend using tabs, and the Python style guide, :pep:`8`, recommends 4 spaces for distributed Python code; this is also the Emacs python-mode default.
el: Το FAQ δεν συνιστούν την χρήση καρτελών και ο οδηγός στυλ Python, :pep:`8`, συνιστά 4 κενά για τον κατανεμημένο κώδικα Python' αυτή είναι επίσης η προεπιλεγμένη λειτουργία python του Emacs.

source: Under any editor, mixing tabs and spaces is a bad idea. MSVC is no different in this respect, and is easily configured to use spaces: Take :menuselection:`Tools --> Options --> Tabs`, and for file type "Default" set "Tab size" and "Indent size" to 4, and select the "Insert spaces" radio button.
el: Σε οποιονδήποτε editor, η μίξη tabs και spaces είναι κακή ιδέα. Το MSVC δεν διαφέρει από αυτή την άποψη και ρυθμίζεται εύκολα για να χρησιμοποιεί κενά: Πάρτε :menuselection:`Tools --> Options --> Tabs`, και για τον τύπο αρχείου "Default" ορίστε το "Tab size" και το "Indent size" στο 4, και επιλέξτε το κουμπί επιλογής "Insert spaces".

source: Python raises :exc:`IndentationError` or :exc:`TabError` if mixed tabs and spaces are causing problems in leading whitespace. You may also run the :mod:`tabnanny` module to check a directory tree in batch mode.
el: Η Python εγείρει το :exc:`IndentationError` ή :exc:`TabError` εάν τα μικτά tabs και spaces προκαλούν προβλήματα στο leading whitespace. Μπορείτε επίσης να εκτελέσετε το module :mod:`tabnanny` για να ελέγξετε εάν δέντρο καταλόγου σε λειτουργία batch.

source: How do I check for a keypress without blocking?
el: Πώς μπορώ να ελέγξω για ένα πάτημα πλήκτρων χωρίς αποκλεισμό;

source: Use the :mod:`msvcrt` module. This is a standard Windows-specific extension module. It defines a function ``kbhit()`` which checks whether a keyboard hit is present, and ``getch()`` which gets one character without echoing it.
el: Χρησιμοποιείστε το module :mod:`msvcrt`. Αυτή είναι ένα τυπικό module επέκτασης ειδικά για τα Windows. Ορίζει μια συνάρτηση ``kbhit()`` η οποία ελέγχει εάν υπάρχει ένα χτύπημα πληκτρολογίου, και το ``getch()`` παίρνει έναν χαρακτήρα χωρίς να τον επαναλαμβάνει.

source: How do I solve the missing api-ms-win-crt-runtime-l1-1-0.dll error?
el: Πως μπορώ να διορθώσω το σφάλμα που λείπει το api-ms-win-crt-runtime-l1-1-0.dll;

source: This can occur on Python 3.5 and later when using Windows 8.1 or earlier without all updates having been installed. First ensure your operating system is supported and is up to date, and if that does not resolve the issue, visit the `Microsoft support page <https://support.microsoft.com/en-us/help/3118401/>`_ for guidance on manually installing the C Runtime update.
el: Αυτό μπορεί να συμβεί σε Python 3.5 και νεότερες εκδόσεις όταν χρησιμοποιείτε Windows 8.1 ή νεότερη έκδοση χωρίς να έχουν εγκατασταθεί όλες οι ενημερώσεις. Πρώτα βεβαιωθείτε ότι το λειτουργικό σας σύστημα υποστηρίζεται και είναι ενημερωμένο και εάν αυτό δεν επιλύσει το πρόβλημα, επισκεφθείτε τη `σελίδα υποστήριξης της Microsoft <https://support.microsoft.com/en-us/help/3118401/>`_ για καθοδήγηση σχετικά με τη μη αυτόματη εγκατάσταση της ενημέρωσης C Runtime.
