Repository: pygreece/python-docs-gr
Catalog: tutorial/appetite.po
Languages: el

source: Whetting Your Appetite
el: Ανοίγοντας την όρεξή σας

source: If you do much work on computers, eventually you find that there's some task you'd like to automate. For example, you may wish to perform a search-and-replace over a large number of text files, or rename and rearrange a bunch of photo files in a complicated way. Perhaps you'd like to write a small custom database, or a specialized GUI application, or a simple game.
el: Εάν κάνετε πολλή δουλειά σε υπολογιστές, τελικά θα διαπιστώσετε ότι υπάρχει κάποια εργασία που θα θέλατε να αυτοματοποιήσετε. Για παράδειγμα, μπορεί να θέλετε να πραγματοποιήσετε αναζήτηση και αντικατάσταση σε μεγάλο αριθμό αρχείων κειμένου ή να μετονομάσετε και να αναδιατάξετε μια δέσμη αρχείων φωτογραφιών με περίπλοκο τρόπο. Ίσως θα θέλατε να γράψετε μια μικρή προσαρμοσμένη βάση δεδομένων ή μια εξειδικευμένη εφαρμογή GUI ή ένα απλό παιχνίδι.

source: If you're a professional software developer, you may have to work with several C/C++/Java libraries but find the usual write/compile/test/re-compile cycle is too slow. Perhaps you're writing a test suite for such a library and find writing the testing code a tedious task. Or maybe you've written a program that could use an extension language, and you don't want to design and implement a whole new language for your application.
el: Εάν είστε επαγγελματίας προγραμματιστής λογισμικού, μπορεί να χρειαστεί να εργαστείτε με πολλές βιβλιοθήκες C/C++/Java, αλλά ο συνηθισμένος κύκλος εγγραφής/compile/δοκιμής/re-compile είναι πολύ αργός. Ίσως γράφετε ένα test suite για μια τέτοια βιβλιοθήκη και βρίσκετε τη δημιουργία κώδικα testing μια κουραστική διαδικασία. Ή ίσως έχετε γράψει ένα πρόγραμμα που θα μπορούσε να χρησιμοποιεί μια γλώσσα επέκτασης, και δεν θέλετε να σχεδιάσετε και να εφαρμόσετε μια εντελώς νέα γλώσσα για την εφαρμογή σας.

source: Python is just the language for you.
el: Η Python είναι απλώς η γλώσσα για εσάς.

source: You could write a Unix shell script or Windows batch files for some of these tasks, but shell scripts are best at moving around files and changing text data, not well-suited for GUI applications or games. You could write a C/C++/Java program, but it can take a lot of development time to get even a first-draft program. Python is simpler to use, available on Windows, macOS, and Unix operating systems, and will help you get the job done more quickly.
el: Θα μπορούσατε να γράψετε ένα Unix shell script ή Windows batch αρχεία για ορισμένες από αυτές τις εργασίες, αλλά τα shell scripts είναι τα καλύτερα για τη μετακίνηση αρχείων και την αλλαγή δεδομένων κειμένου, δεν είναι κατάλληλα για εφαρμογές ή παιχνίδια GUI. Θα μπορούσατε να γράψετε ένα C/C++/Java πρόγραμμα, αλλά μπορεί να χρειαστεί πολύς χρόνος ανάπτυξης για να δημιουργηθεί μια πρώτη έκδοση του προγράμματος. Η Python είναι πιο απλή στη χρήση, διαθέσιμη σε λειτουργικά συστήματα Windows, macOS και Unix και θα σας βοηθήσει να ολοκληρώσετε τη δουλειά πιο γρήγορα.

source: Python is simple to use, but it is a real programming language, offering much more structure and support for large programs than shell scripts or batch files can offer. On the other hand, Python also offers much more error checking than C, and, being a *very-high-level language*, it has high-level data types built in, such as flexible arrays and dictionaries. Because of its more general data types Python is applicable to a much larger problem domain than Awk or even Perl, yet many things are at least as easy in Python as in those languages.
el: Η Python είναι απλή στη χρήση, αλλά είναι μια πραγματική γλώσσα προγραμματισμού, που προσφέρει πολύ περισσότερη δομή και υποστήριξη για μεγάλα προγράμματα από ό,τι μπορούν να προσφέρουν τα shell scripts ή τα batch αρχεία. Από την άλλη πλευρά, η Python προσφέρει επίσης πολύ περισσότερο έλεγχο σφαλμάτων από τη C και, όντας μια γλώσσα *πολύ υψηλού επιπέδου*, έχει ενσωματωμένους τύπους δεδομένων υψηλού επιπέδου, όπως ευέλικτους πίνακες, και λεξικά. Λόγω των πιο γενικών τύπων δεδομένων της, η Python μπορεί να εφαρμοστεί σε έναν πολύ μεγαλύτερο τομέα προβλημάτων από την Awk ή ακόμα και την Perl, ωστόσο πολλά πράγματα είναι τουλάχιστον τόσο εύκολα στην Python όσο σε αυτές τις γλώσσες.

source: Python allows you to split your program into modules that can be reused in other Python programs. It comes with a large collection of standard modules that you can use as the basis of your programs --- or as examples to start learning to program in Python. Some of these modules provide things like file I/O, system calls, sockets, and even interfaces to graphical user interface toolkits like Tk.
el: Η Python σάς επιτρέπει να χωρίσετε το πρόγραμμά σας σε modules που μπορούν να επαναχρησιμοποιηθούν σε άλλα προγράμματα Python. Έρχεται με μια μεγάλη συλλογή standard modules που μπορείτε να χρησιμοποιήσετε ως βάση των προγραμμάτων σας --- ή ως παράδειγμα για να ξεκινήσετε να μαθαίνετε να προγραμματίζετε σε Python. Ορισμένα από αυτά τα modules παρέχουν πράγματα όπως I/O αρχείων, κλήσεις συστήματος, sockets, ακόμη και interfaces σε toolkits γραφικών διεπαφής χρήστη, όπως το Tk.

source: Python is an interpreted language, which can save you considerable time during program development because no compilation and linking is necessary. The interpreter can be used interactively, which makes it easy to experiment with features of the language, to write throw-away programs, or to test functions during bottom-up program development. It is also a handy desk calculator.
el: Η Python είναι μια interpreted γλώσσα, η οποία μπορεί να σας εξοικονομήσει σημαντικό χρόνο κατά την ανάπτυξη του προγράμματος, επειδή δεν απαιτείται compilation και linking. Ο interpreter μπορεί να χρησιμοποιηθεί διαδραστικά, γεγονός που καθιστά εύκολο τον πειραματισμό με χαρακτηριστικά της γλώσσας, τη σύνταξη προγραμμάτων ή τον έλεγχο συναρτήσεων κατά την ανάπτυξη προγράμματος από κάτω προς τα πάνω. Είναι επίσης μια εύχρηστη αριθμομηχανή.

source: Python enables programs to be written compactly and readably. Programs written in Python are typically much shorter than equivalent C, C++, or Java programs, for several reasons:
el: Η Python επιτρέπει στα προγράμματα να γράφονται συμπαγή και ευανάγνωστα. Τα προγράμματα που είναι γραμμένα σε Python είναι συνήθως πολύ μικρότερα από τα αντίστοιχα προγράμματα C, C++ ή Java, για διάφορους λόγους:

source: the high-level data types allow you to express complex operations in a single statement;
el: οι τύποι δεδομένων υψηλού επιπέδου σάς επιτρέπουν να εκφράσετε πολύπλοκες λειτουργίες σε μία μόνο δήλωση∙

source: statement grouping is done by indentation instead of beginning and ending brackets;
el: η ομαδοποίηση δηλώσεων γίνεται με εσοχή αντί για αγκύλες αρχής και λήξης∙

source: no variable or argument declarations are necessary.
el: δεν απαιτούνται δηλώσεις μεταβλητών ή ορισμάτων.

source: Python is *extensible*: if you know how to program in C it is easy to add a new built-in function or module to the interpreter, either to perform critical operations at maximum speed, or to link Python programs to libraries that may only be available in binary form (such as a vendor-specific graphics library). Once you are really hooked, you can link the Python interpreter into an application written in C and use it as an extension or command language for that application.
el: Η Python είναι *επεκτάσιμη*: αν ξέρετε πώς να προγραμματίζετε σε C είναι εύκολο να προσθέσετε μια νέα ενσωματωμένη συνάρτηση ή module στον interpreter, είτε για να εκτελέσετε κρίσιμες λειτουργίες με μέγιστη ταχύτητα, είτε για να συνδέσετε προγράμματα Python με βιβλιοθήκες που μπορεί να είναι διαθέσιμες μόνο σε δυαδική μορφή (όπως μια βιβλιοθήκη γραφικών για συγκεκριμένο προμηθευτή). Μόλις κολλήσετε πραγματικά, μπορείτε να συνδέσετε τον Python interpreter σε μια εφαρμογή γραμμένη σε C και να τη χρησιμοποιήσετε ως επέκταση ή γλώσσα εντολών για αυτήν την εφαρμογή.

source: By the way, the language is named after the BBC show "Monty Python's Flying Circus" and has nothing to do with reptiles. Making references to Monty Python skits in documentation is not only allowed, it is encouraged!
el: Παρεμπιπτόντως, η γλώσσα πήρε το όνομά της από την εκπομπή του BBC "Monty Python's Flying Circus" και δεν έχει καμία σχέση με ερπετά. Η αναφορά σε σκετς Monty Python στην τεκμηρίωση όχι μόνο επιτρέπεται, αλλά και ενθαρρύνεται!

source: Now that you are all excited about Python, you'll want to examine it in some more detail. Since the best way to learn a language is to use it, the tutorial invites you to play with the Python interpreter as you read.
el: Τώρα που είστε όλοι ενθουσιασμένοι με την Python, θα θέλετε να την εξετάσετε με περισσότερες λεπτομέρειες. Επειδή ο καλύτερος τρόπος για να μάθετε μια γλώσσα είναι να τη χρησιμοποιήσετε, ο οδηγός εκμάθησης σας προσκαλεί να παίξετε με τον Python interpreter καθώς διαβάζετε.

source: In the next chapter, the mechanics of using the interpreter are explained. This is rather mundane information, but essential for trying out the examples shown later.
el: Στο επόμενο κεφάλαιο, εξηγείται η μηχανική της χρήσης του interpreter. Αυτή είναι μάλλον πεζή πληροφορία, αλλά απαραίτητη για τη δοκιμή των παραδειγμάτων που παρουσιάζονται αργότερα.

source: The rest of the tutorial introduces various features of the Python language and system through examples, beginning with simple expressions, statements and data types, through functions and modules, and finally touching upon advanced concepts like exceptions and user-defined classes.
el: Ο υπόλοιπος οδηγός εκμάθησης εισάγει διάφορα χαρακτηριστικά της γλώσσας και του συστήματος Python μέσω παραδειγμάτων, ξεκινώντας με απλές εκφράσεις, δηλώσεις και τύπους δεδομένων, μέσω συναρτήσεων και modules και τέλος αγγίζοντας προηγμένες έννοιες όπως εξαιρέσεις και κλάσεις που καθορίζονται από τον χρήστη.
