Repository: pygreece/python-docs-gr
Catalog: tutorial/appendix.po
Languages: el

source: Appendix
el: Παράρτημα

source: Interactive Mode
el: Διαδραστική Λειτουργία

source: Error Handling
el: Διαχείριση Σφαλμάτων

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit status; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
el: Όταν παρουσιαστεί ένα σφάλμα, ο interpreter εμφανίζει ένα μήνυμα σφάλματος και ένα stack trace. Στη διαδραστική λειτουργία, στη συνέχεια επιστρέφει στην κύρια γραμμή εντολών∙ όταν η είσοδος προέρχεται από ένα αρχείο, εξέρχεται με κατάσταση εξόδου μη μηδενική μετά την εκτύπωση του stack trace. (Οι εξαιρέσεις που αντιμετωπίζονται από μια εντολή :keyword:`except` σε ένα :keyword:`try` μπλοκ, δεν είναι σφάλματα σε αυτό το πλαίσιο.) Ορισμένα σφάλματα είναι άνευ όρων μοιραία και προκαλούν έξοδο με κατάσταση εξόδου μη μηδενική. Αυτό ισχύει για εσωτερικές ασυνέπειες και ορισμένες περιπτώσεις εξάντλησης της μνήμης. Όλα τα μηνύματα σφάλματος εγγράφονται στην τυπική ροή σφαλμάτων∙ η κανονική έξοδος από τις εκτελεσμένες εντολές γράφεται στην τυπική έξοδο.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
el: Πληκτρολογώντας τον χαρακτήρα διακοπής (συνήθως :kbd:`Control-C` ή :kbd:`Delete`) στην κύρια ή δευτερεύουσα γραμμή εντολών ακυρώνει την είσοδο και επιστρέφει στην κύρια γραμμή εντολών. [#]_ Πληκτρολογώντας μια διακοπή ενώ εκτελείται μια εντολή δημιουργείται η εξαίρεση :exc:`KeyboardInterrupt`, η οποία μπορεί να αντιμετωπιστεί από μια πρόταση :keyword:`try`.

source: Executable Python Scripts
el: Εκτελέσιμα Python Scripts

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
el: Στα συστήματα BSD'ish Unix systems, τα Python scripts μπορούν να γίνουν άμεσα εκτελέσιμα, όπως τα shell scripts, βάζοντας τη γραμμή::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
el: (υποθέτοντας ότι ο interpreter βρίσκεται στο :envvar:`PATH` του χρήστη) στην αρχή του σεναρίου και δίνοντας στο αρχείο μια εκτελέσιμη λειτουργία. Το ``#!`` πρέπει να είναι οι δύο πρώτοι χαρακτήρες του αρχείου. Σε ορισμένες πλατφόρμες, αυτή η πρώτη γραμμή πρέπει να τελειώνει με μια γραμμή τύπου Unix που τελειώνει με μια γραμμή τύπου Unix που τελειώνει (``'\n'``), όχι με γραμμή Windows (``'\r\n'``). Σημειώστε ότι ο χαρακτήρας κατακερματισμού, , ``'#'``, χρησιμοποιείται για την έναρξη ενός σχολίου στην Python.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
el: Το script μπορεί να δοθεί μια εκτελέσιμη λειτουργία ή άδεια, χρησιμοποιώντας την εντολή :program:`chmod`.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
el: Στα συστήματα Windows, δεν υπάρχει η έννοια της "εκτελέσιμη λειτουργίας". Το πρόγραμμα εγκατάστασης της Python συσχετίζει αυτόματα τα αρχεία ``.py`` με το ``python.exe`` έτσι ώστε να εκτελείται ένα διπλό κλικ σε ένα αρχείο Python ως script. Η επέκταση μπορεί επίσης να είναι ``.pyw``, σε αυτήν την περίπτωση, το παράθυρο της κονσόλας που εμφανίζεται συνήθως αποκρύπτεται.

source: The Interactive Startup File
el: Το διαδραστικό αρχείο εκκίνησης

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
el: Όταν χρησιμοποιείτε την Python διαδραστικά, είναι συχνά βολικό να εκτελούνται ορισμένες τυπικές εντολές κάθε φορά που ξεκινά ο interpreter. Μπορείτε να το κάνετε αυτό ορίζοντας μια μεταβλητή περιβάλλοντος με το όνομα :envvar:`PYTHONSTARTUP` στο όνομα ενός αρχείου που περιέχει τις εντολές εκκίνησης σας. Αυτό είναι παρόμοιο με το χαρακτηριστικό :file:`.profile` στα Unix shells.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
el: Αυτό το αρχείο διαβάζεται μόνο σε διαδραστικές συνεδρίες, όχι όταν η Python διαβάζει εντολές από ένα script, και όχι όταν το :file:`/dev/tty` δίνεται ως η ρητή πηγή εντολών (η οποία κατά τα άλλα συμπεριφέρεται σαν μια διαδραστική συνεδρία). Εκτελείται στον ίδιο χώρο ονομάτων όπου εκτελούνται αλληλεπιδραστικές εντολές, έτσι ώστε τα αντικείμενα που ορίζει ή εισάγει να μπορούν να χρησιμοποιηθούν χωρίς επιφύλαξη στη διαδραστική περίοδο λειτουργίας. Μπορείτε επίσης να αλλάξετε τις προτροπές ``sys.ps1`` και ``sys.ps2`` σε αυτό το αρχείο.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
el: Εάν θέλετε να διαβάσετε ένα επιπλέον αρχείο εκκίνησης από τον τρέχοντα κατάλογο, μπορείτε να το προγραμματίσετε στο καθολικό αρχείο εκκίνησης χρησιμοποιώντας κώδικα όπως ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. Εάν θέλετε να χρησιμοποιήσετε το αρχείο εκκίνησης σε ένα σενάριο, πρέπει να το κάνετε ρητά στο script::

source: The Customization Modules
el: Τα Modules Προσαρμογής

source: Python provides two hooks to let you customize it: :index:`sitecustomize` and :index:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
el: Η Python παρέχει δύο άγκιστρα για να σας επιτρέψει να την προσαρμόσετε: :index:`sitecustomize` και :index:`usercustomize`. Για να δείτε πώς λειτουργεί, πρέπει πρώτα να βρείτε τη θέση του καταλόγου πακέτων ιστοτόπων χρήστη. Ξεκινήστε την Python και εκτελέσετε αυτός ο κώδικας::

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
el: Τώρα μπορείτε να δημιουργήσετε ένα αρχείο με το όνομα :file:`usercustomize.py` σε αυτόν τον κατάλογο και να βάλετε ό,τι θέλετε σε αυτόν. Θα επηρεάσει κάθε επίκληση της Python, εκτός εάν ξεκινήσει με την επιλογή :option:`-s` απενεργοποιήστε την αυτόματη εισαγωγή.

source: :index:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :index:`usercustomize`. See the documentation of the :mod:`site` module for more details.
el: Το :index:`sitecustomize` λειτουργεί με τον ίδιο τρόπο, αλλά συνήθως δημιουργείται από έναν διαχειριστή του υπολογιστή στον παγκόσμιο κατάλογο πακέτων τοποθεσιών και εισάγεται πριν από το :index:`usercustomize`. Δείτε την τεκμηρίωση του module :mod:`site` για περισσότερες λεπτομέρειες.

source: Footnotes
el: Υποσημειώσεις

source: A problem with the GNU Readline package may prevent this.
el: Ένα πρόβλημα με το πακέτο GNU Readline μπορεί να το αποτρέψει.
