Repository: pygreece/python-docs-gr
Catalog: tutorial/datastructures.po
Languages: el

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
el: Ο constructor :func:`dict` δημιουργεί λεξικά απευθείας από ακολουθίες ζευγών key-value::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
el: Επιπλέον, τα comprehensions λεξικών μπορούν να χρησιμοποιηθούν για τη δημιουργία λεξικών από αυθαίρετες εκφράσεις κλειδιού και τιμών::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
el: Όταν τα κλειδιά είναι απλές συμβολοσειρές, μερικές φορές είναι πιο εύκολο να ορίσετε ζεύγη χρησιμοποιώντας ορίσματα λέξεων-κλειδιών::

source: Looping Techniques
el: Τεχνικές Looping

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`~dict.items` method. ::
el: Κατά το looping μέσω λεξικών, το κλειδί και η αντίστοιχη τιμή μπορούν να ανακτηθούν ταυτόχρονα χρησιμοποιώντας τη μέθοδο :meth:`~dict.items`. ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
el: Κατά το looping μέσω ακολουθίας, ο δείκτης θέσης και η αντίστοιχη τιμή μπορούν να ανακτηθούν ταυτόχρονα χρησιμοποιώντας τη συνάρτηση :func:`enumerate`. ::

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
el: Για να κάνετε loop σε δύο ή περισσότερες ακολουθίες ταυτόχρονα, οι καταχωρίσεις μπορούν να αντιστοιχιστούν με τη συνάρτηση :func:`zip`. ::

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
el: Για να κάνετε loop σε μια ακολουθία αντίστροφα, καθορίστε πρώτα την ακολουθία προς τα εμπρός και μετά καλέστε τη συνάρτηση :func:`reversed`. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
el: Για να κάνετε loop σε μια ακολουθία με ταξινομημένη σειρά, χρησιμοποιήστε τη συνάρτηση :func:`sorted`, η οποία επιστρέφει μια νέα ταξινομημένη λίστα αφήνοντας την πηγή αναλλοίωτη. ::

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
el: Η χρήση του :func:`set` σε μια ακολουθία εξαλείφει τα διπλά στοιχεία. Η χρήση του :func:`sorted` σε συνδυασμό με το :func:`set` σε μια ακολουθία είναι ένας ιδιωματικός τρόπος για να κάνετε loop πάνω από μοναδικά στοιχεία της ακολουθίας σε ταξινομημένη σειρά. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
el: Μερικές φορές είναι δελεαστικό να αλλάζετε μια λίστα ενώ την περιηγείστε∙ ωστόσο, είναι συχνά πιο απλό και ασφαλές να δημιουργήσετε μια νέα λίστα. ::

source: More on Conditions
el: Περισσότερα για τις συνθήκες

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
el: Οι συνθήκες που χρησιμοποιούνται στις δηλώσεις ``while`` και ``if`` μπορούν να περιέχουν οποιουσδήποτε τελεστές, όχι μόνο συγκρίσεις.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
el: Οι τελεστές σύγκρισης ``in`` και ``not in`` είναι δοκιμές ιδιότητας μέλους που καθορίζουν εάν μια τιμή βρίσκεται (ή όχι σε) ένα container. Οι τελεστές ``is`` και ``is not`` συγκρίνουν εάν δύο αντικείμενα είναι πραγματικά το ίδιο αντικείμενο. Όλοι οι τελεστές σύγκρισης έχουν την ίδια προτεραιότητα, η οποία είναι χαμηλότερη από αυτή όλων των αριθμητικών τελεστών.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
el: Οι συγκρίσεις μπορούν να είναι αλυσιδωτές. Για παράδειγμα, ``a < b == c`` ελέγχει εάν το ``a`` είναι μικρότερο από ``b`` και επιπλέον το ``b`` ισούται με ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
el: Οι συγκρίσεις μπορούν να συνδυαστούν χρησιμοποιώντας τους λογικούς τελεστές ``and`` και ``or``, και το αποτέλεσμα μιας σύγκρισης (ή οποιασδήποτε άλλης λογικής έκφρασης) μπορεί να ακυρωθεί με ``not``. Αυτοί έχουν χαμηλότερες προτεραιότητες μεταξύ των τελεστών σύγκρισης, το ``not`` έχει την υψηλότερη προτεραιότητα και το ``or`` τη χαμηλότερη, έτσι ώστε το ``A and not B or C`` ισοδυναμεί με ``(A and (not B)) or C``. Όπως πάντα, οι παρενθέσεις μπορούν να χρησιμοποιηθούν για να εκφράσουν την επιθυμητή σύνθεση.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
el: Οι λογικοί τελεστές ``and`` και ``or`` είναι οι λεγόμενοι τελεστές *short-circuit*: τα ορίσματα τους αξιολογούνται από αριστερά προς τα δεξιά και η αξιολόγηση σταματά μόλις καθοριστεί το αποτέλεσμα. Για παράδειγμα, εάν το ``A`` and ``C`` είναι αληθές, αλλά το ``B`` είναι ψευδές, το ``A and B and C`` δεν αξιολογεί την έκφραση ``C``. Όταν χρησιμοποιείται ως γενική τιμή και όχι ως λογική, η τιμή επιστροφής ενός short-circuit τελεστή είναι το τελευταίο αξιολογημένο όρισμα.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
el: Είναι δυνατό να αντιστοιχίσετε το αποτέλεσμα μιας σύγκρισης ή άλλη δυαδική έκφρασης σε μια μεταβλητή. Για παράδειγμα, ::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
el: Σημειώστε ότι στην Python, σε αντίθεση με την C, η ανάθεση εντός των εκφράσεων πρέπει να γίνεται ρητά με τον τελεστή :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. Αυτό αποφεύγει μια κοινή κατηγορία προβλημάτων που συναντώνται στα προγράμματα C: πληκτρολογώντας ``=`` σε μια έκφραση όταν προοριζόταν το ``==``.

source: Comparing Sequences and Other Types
el: Σύγκριση ακολουθιών και άλλων τύπων

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
el: Τα αντικείμενα ακολουθίας μπορούν συνήθως να συγκριθούν με άλλα αντικείμενα με τον ίδιο τύπο ακολουθίας. Η σύγκριση χρησιμοποιεί *lexicographical* σειρά: πρώτα συγκρίνονται τα δύο πρώτα στοιχεία και αν διαφέρουν αυτό καθορίζει το αποτέλεσμα της σύγκρισης∙ εάν είναι ίσα, τα επόμενα δύο στοιχεία συγκρίνονται και ούτω καθεξής, έως ότου εξαντληθεί η μία από τις δύο ακολουθίες. Εάν δύο στοιχεία προς σύγκριση είναι τα ίδια ακολουθίες του ίδιου τύπου, η λεξικογραφική σύγκριση πραγματοποιείται αναδρομικά. Εάν όλα τα στοιχεία δύο ακολουθιών συγκρίνονται ίσα, οι ακολουθίες θεωρούνται ίσες. Εάν η μια ακολουθία είναι αρχική υποακολουθία της άλλης, η μικρότερη ακολουθία είναι η μικρότερη (ελάχιστη). Η λεξικογραφική ταξινόμηση συμβολοσειρών χρησιμοποιεί τον αριθμό κωδικού σημείου Unicode για να ταξινομήσει μεμονωμένους χαρακτήρες. Μερικά παραδείγματα συγκρίσεων μεταξύ ακολουθιών του ίδιου τύπου::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
el: Λάβετε υπόψη ότι η σύγκριση αντικειμένων διαφορετικών τύπων με ``<`` ή ``>`` είναι νόμιμη υπό τον όρο ότι τα αντικείμενα διαθέτουν κατάλληλες μεθόδους σύγκρισης. Για παράδειγμα, οι μικτές αριθμητικοί τύποι συγκρίνονται σύμφωνα με την αριθμητική τους τιμή, οπότε το 0 ισούται με 0.0, κλπ. Διαφορετικά, αντί να παρέχει μια αυθαίρετη παραγγελία, ο διερμηνέας θα κάνει raise μια εξαίρεση :exc:`TypeError`.

source: Footnotes
el: Υποσημειώσεις

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
el: Άλλες γλώσσες ενδέχεται να επιστρέψουν το μεταλλαγμένο αντικείμενο, το οποίο επιτρέπει την αλυσιδωτή εκτέλεση μεθόδων, όπως ``d->insert("a")->remove("b")->sort();``.
