Repository: pygreece/python-docs-gr
Catalog: tutorial/datastructures.po
Languages: el

source: Data Structures
el: Δομές Δεδομένων

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
el: Αυτό το κεφάλαιο περιγράφει ορισμένα πράγματα τα οποία έχετε μάθει ήδη με περισσότερες λεπτομέρειες και προσθέτει επίσης μερικά νέα.

source: More on Lists
el: Περισσότερα για τις Λίστες

source: The list data type has some more methods. Here are all of the methods of list objects:
el: Ο τύπος δεδομένων λίστας έχει μερικές ακόμη μεθόδους. Ακολουθούν όλες οι μέθοδοι αντικειμένων τύπου λίστας:

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
el: Προσθέτει ένα στοιχείο στο τέλος της λίστας. Ισοδυναμεί με ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Equivalent to ``a[len(a):] = iterable``.
el: Επεκτείνει τη λίστα προσθέτοντας όλα τα στοιχεία από το iterable. Ισοδυναμεί με ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
el: Εισάγει ένα στοιχείο σε μια δεδομένη θέση. Το πρώτο όρισμα είναι το index του στοιχείου πριν από το οποίο θα εισαχθεί, επομένως ``a.insert(0, x)`` εισάγεται στο μπροστινό μέρος της λίστας, και το ``a.insert(len(a), x)`` ισοδυναμεί με ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
el: Καταργεί το πρώτο στοιχείο από τη λίστα του οποίου η τιμή είναι ίση με *x*. Κάνει raise ένα :exc:`ValueError` εάν δεν υπάρχει τέτοιο στοιχείο.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. It raises an :exc:`IndexError` if the list is empty or the index is outside the list range.
el: Καταργεί το στοιχείο στη δεδομένη θέση στη λίστα, και το επιστρέφει. Εάν δεν έχει καθοριστεί ευρετήριο, το ``a.pop()`` αφαιρεί και επιστρέφει το τελευταίο στοιχείο στη λίστα. Κάνει raise ένα :exc:`IndexError` εάν η λίστα είναι κενή ή το ευρετήριο βρίσκεται εκτός του εύρους της λίστας.

source: Remove all items from the list. Equivalent to ``del a[:]``.
el: Αφαιρεί όλα τα στοιχεία από τη λίστα. Ισοδυναμεί με ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
el: Επιστρέφει το μηδενικό index στη λίστα του πρώτου στοιχείου του οποίου η τιμή είναι ίση με *x*. Κάνει raise ένα :exc:`ValueError` εάν δεν υπάρχει τέτοιο στοιχείο.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
el: Τα προαιρετικά ορίσματα *start* και *end* ερμηνεύονται όπως στη σημειογραφία slice και χρησιμοποιούνται για τον περιορισμό της αναζήτησης σε μια συγκεκριμένη υποακολουθία της λίστας. Ο επιστρεφόμενος δείκτης υπολογίζεται σε σχέση με την αρχή της πλήρους ακολουθίας αντί για το όρισμα *start*.

source: Return the number of times *x* appears in the list.
el: Επιστρέφει τον αριθμό των φορών που εμφανίζεται το *x* στη λίστα.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
el: Ταξινομεί τα στοιχεία της λίστας στη θέση τους (τα ορίσματα μπορούν να χρησιμοποιηθούν για προσαρμογή ταξινόμησης, βλ. :func:`sorted` για την εξήγησή τους).

source: Reverse the elements of the list in place.
el: Αντιστρέφει τα στοιχεία της λίστας στη θέση τους.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
el: Επιστρέφει ένα shallow (ρηχό) αντίγραφο της λίστας.. Ισοδύναμε με ``a[:]``.

source: An example that uses most of the list methods::
el: Ένα παράδειγμα που χρησιμοποιεί τις περισσότερες από τις μεθόδους της λίστας::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
el: Μπορεί να έχετε παρατηρήσει ότι μέθοδοι όπως ``insert``, ``remove`` or ``sort`` που τροποποιούν μόνο τη λίστα δεν έχουν εκτυπωμένη τιμή επιστροφής -- επιστρέφουν το προεπιλεγμένο (default) ``None``. [#]_ Αυτή είναι μια αρχή σχεδιασμού για όλες τις μεταβλητές δομές δεδομένων στην Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and *None* can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
el: Ένα άλλο πράγμα που μπορεί να παρατηρήσετε είναι ότι δεν μπορούν να ταξινομηθούν ή να συγκριθούν όλα τα δεδομένα. Για παράδειγμα, ``[None, 'hello', 10]`` δεν ταξινομούνται γιατί ακέραιοι αριθμοί δεν μπορούν να συγκριθούν με συμβολοσειρές (strings) και το *None* δεν μπορεί να συγκριθεί με άλλους τύπους. Επίσης, υπάρχουν ορισμένοι τύποι που δεν έχουν καθορισμένη σχέση διάταξης. Για παράδειγμα, το ``3+4j < 5+7j`` δεν είναι έγκυρη σύγκριση.

source: Using Lists as Stacks
el: Χρήστη Λιστών ως Στοίβες (Stacks)

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`~list.append`. To retrieve an item from the top of the stack, use :meth:`~list.pop` without an explicit index. For example::
el: Οι μέθοδοι λίστας καθιστούν πιο εύκολη τη χρήση μιας λίστα ως στοίβας (stack), όπου το τελευταίο στοιχείο που προστέθηκε είναι το πρώτο στοιχείο που ανακτήθηκε ("last-in, first-out"). Για να προσθέσετε ένα στοιχείο στην κορυφή της στοίβας (stack), χρησιμοποιήστε τη :meth:`~list.append`. Για να ανακτήσετε ένα στοιχείο από την κορυφής της στοίβας, χρησιμοποιήστε τη :meth:`~list.pop` χωρίς κάποιο σαφές index. Για παράδειγμα::

source: Using Lists as Queues
el: Χρήση λιστών ως Ουρές (Queues)

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
el: Είναι επίσης δυνατό να χρησιμοποιηθεί μια λίστα ως ουρά (queue), όπου το πρώτο στοιχείο που προστίθεται είναι το πρώτο στοιχείο που ανακτάται ("first-in, first-out") ∙ ωστόσο, οι λίστες δεν είναι αποτελεσματικές για αυτόν τον σκοπό. Ενώ το να προσθέσεις και να αφαιρέσεις (στοιχεία) στο τέλος της λίστας είναι γρήγορο, κάνοντας αυτές τις προσθέσεις και τις αφαιρέσεις (στοιχείων) στην αρχή της λίστα είναι αργό (επειδή όλα τα στοιχεία πρέπει να μετατοπιστούν κατά ένα).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
el: Για να εφαρμόσετε μια ουρά (queue), χρησιμοποιήστε την :class:`collections.deque` η οποία σχεδιάστηκε για να έχει γρήγορες προσθέσεις και αφαιρέσεις και από τα δύο άκρα. Για παράδειγμα:΅:

source: List Comprehensions
el: Comprehensions Λίστας

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
el: Τα comprehensions λίστας παρέχουν ένα συνοπτικό τρόπο δημιουργίας λιστών. Οι συνήθεις εφαρμογές είναι η δημιουργία νέων λιστών όπου κάθε στοιχείο είναι το αποτέλεσμα κάποιων πράξεων που εφαρμόζονται σε κάθε μέλος μιας άλλης ακολουθίας ή iterable, ή η δημιουργία μιας υποακολουθίας αυτών των στοιχείων που ικανοποιούν μια συγκεκριμένη συνθήκη.

source: For example, assume we want to create a list of squares, like::
el: Για παράδειγμα, ας υποθέσουμε ότι θέλουμε να δημιουργήσουμε μια λίστα τετραγώνων όπως::

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
el: Λάβετε υπόψη ότι αυτό δημιουργεί (ή αντικαθιστά) μια μεταβλητή με το όνομα ``x`` που εξακολουθεί να υπάρχει μετά την ολοκλήρωση της loop. Μπορούμε να υπολογίσουμε τη λίστα των τετραγώνων χωρίς παρενέργειες χρησιμοποιώντας::

source: or, equivalently::
el: ή, ισοδύναμα::

source: which is more concise and readable.
el: που είναι πιο συνοπτικό και ευανάγνωστο.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
el: Ένα comprehension λίστας αποτελείται από αγκύλες που περιέχουν μια έκφραση ακολουθούμενη από μια πρόταση :keyword:`!for`, στη συνέχεια μηδέν ή περισσότερες προτάσεις :keyword:`!for` ή :keyword:`!if`. Το αποτέλεσμα θα είναι μια νέα λίστα που προκύπτει από την αξιολόγηση της έκφρασης στο πλαίσιο των προτάσεων :keyword:`!for` και :keyword:`!if` που την ακολουθούν. Για παράδειγμα, αυτή η λίστα συνδυάζει τα στοιχεία δύο λιστών εάν δεν είναι ίσες::

source: and it's equivalent to::
el: και ισοδυναμεί με::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
el: Σημειώστε πώς η σειρά των δηλώσεων :keyword:`for` και :keyword:`if` είναι ίδια και στα δύο αποσπάσματα.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
el: Εάν η έκφραση είναι πλειάδα (π.χ. το ``(x, y)`` στο προηγούμενο παράδειγμα), πρέπει να μπει σε παρένθεση. ::

source: List comprehensions can contain complex expressions and nested functions::
el: Τα comprehensions λίστας μπορεί να περιέχουν σύνθετες εκφράσεις και ένθετες συναρτήσεις::

source: Nested List Comprehensions
el: Comprehensions Ένθετων Λιστών

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
el: Η αρχική έκφραση σε ένα comprehension λίστας μπορεί να είναι οποιαδήποτε αυθαίρετη έκφραση, συμπεριλαμβανομένης ενός άλλου comprehension λίστας.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
el: Σκεφτείτε το ακόλουθο παράδειγμα μιας μήτρας 3x4 που υλοποιήθηκε ως μια λίστα 3 λιστών μήκους 4::

source: The following list comprehension will transpose rows and columns::
el: Το ακόλουθο comprehension λίστας θα μεταφέρει γραμμές και στήλες::

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
el: Όπως είδαμε στην προηγούμενη ενότητα, το comprehension της εσωτερικής λίστας αξιολογείται στο πλαίσιο του :keyword:`for` που την ακολουθεί, επομένως αυτό το παράδειγμα είναι ισοδύναμο με::

source: which, in turn, is the same as::
el: το οποίο, με τη σειρά του, είναι το ίδιο με::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
el: Στον πραγματικό κόσμο, θα πρέπει να προτιμάτε τις ενσωματωμένες (built-in) συναρτήσεις από τις σύνθετες εντολές ροής. Η συνάρτηση :func:`zip` θα έκανε εξαιρετική δουλειά για αυτήν την περίπτωση χρήσης::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
el: Δείτε :ref:`tut-unpacking-arguments` για λεπτομέρειες σχετικά με τον αστερίσκο σε αυτήν τη γραμμή.

source: The :keyword:`!del` statement
el: Η δήλωση :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`~list.pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
el: Υπάρχει ένας τρόπος να αφαιρέσετε ένα στοιχείο από μια λίστα με το ευρετήριο του αντί για την τιμή του: η δήλωση :keyword:`del`. Αυτό διαφέρει από τη μέθοδο :meth:`~list.pop` που επιστρέφει μια τιμή. Η δήλωση :keyword:`!del` μπορεί επίσης να χρησιμοποιηθεί για την αφαίρεση τμημάτων από μια λίστα ή για την εκκαθάριση ολόκληρης της λίστας (κάτι που κάναμε νωρίτερα με την ανάθεση μιας κενής λίστας στο slice). Για παράδειγμα::

source: :keyword:`del` can also be used to delete entire variables::
el: Το :keyword:`del` μπορεί επίσης να χρησιμοποιηθεί για τη διαγραφή ολόκληρων μεταβλητών::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
el: Η αναφορά στο όνομα ``a`` στο εξής είναι ένα σφάλμα (τουλάχιστον μέχρι να του εκχωρηθεί άλλη τιμή). Θα βρούμε άλλες χρήσεις για το :keyword:`del` αργότερα.

source: Tuples and Sequences
el: Πλειάδες (Tuples) και Ακολουθίες

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
el: Είδαμε ότι οι λίστες και οι συμβολοσειρές (strings) έχουνε πολλές κοινές ιδιότητες, όπως λειτουργίες indexing και slicing. Είναι δύο παραδείγματα τύπων δεδομένων *sequence* (δείτε :ref:`typesseq`). Δεδομένου ότι η Python είναι μια εξελισσόμενη γλώσσα, άλλοι τύποι δεδομένων ακολουθίας μπορούν να προστεθούν. Υπάρχει επίσης ένας άλλος τυπικός τύπος δεδομένων ακολουθίας type: the *πλειάδα* (*tuple*).

source: A tuple consists of a number of values separated by commas, for instance::
el: Μια πλειάδα (tuple) αποτελείται από έναν αριθμό τιμών που χωρίζονται με κόμματα, για παράδειγμα::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
el: Όπως βλέπετε, οι πλειάδες (tuples) στην έξοδο περικλείονται πάντα σε παρενθέσεις, έτσι ώστε οι ένθετε πλειάδες (tuples) να ερμηνεύονται σωστά∙ μπορούν να εισαχθούν με ή χωρίς περιβάλλουσες παρενθέσεις, αν και συχνά οι παρενθέσεις είναι απαραίτητες ούτως ή άλλως (αν η πλειάδα είναι μέρος μιας μεγαλύτερης έκφρασης). Δεν είναι δυνατή η αντιστοίχιση σε μεμονωμένα στοιχεία μιας πλειάδας, ωστόσο είναι δυνατό να δημιουργηθούν πλειάδες (tuples) που περιέχουν μεταβλητά αντικείμενα, όπως λίστες.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
el: Αν και οι πλειάδες (tuples) μπορεί να φαίνονται παρόμοιες με λίστες, χρησιμοποιούνται συχνά σε διαφορετικές καταστάσεις και για διαφορετικούς σκοπούς. Οι πλειάδες (tuples) είναι :term:`immutable`, και συνήθως περιέχουν μια ετερογενή ακολουθία στοιχείων στα οποία η πρόσβαση γίνεται μέσω unpacking (δείτε παρακάτω σε αυτήν την ενότητα) ή το indexing (ή ακόμα και κατά χαρακτηριστικό στην περίπτωση :func:`namedtuples <collections.namedtuple>`). Οι λίστες είναι :term:`mutable`, και τα στοιχεία τους είναι συνήθως ομοιογενή και προσπελάζονται με επανάληψη στη λίστα.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
el: Ένα ειδικό πρόβλημα είναι η κατασκευή πλειάδων (tuples) που περιέχουν 0 ή 1 στοιχεία: η σύνταξη έχει κάποιες επιπλέον ιδιορρυθμίες για να τις προσαρμόσει. Οι κενές πλειάδες κατασκευάζονται από ένα κενό ζευγάρι παρενθέσεων, μια πλειάδα (tuple) με ένα στοιχείο δημιουργείται ακολουθώντας μια τιμή με κόμμα (δεν αρκεί να περικλείεται μια μόνο τιμή σε παρενθέσεις). Άσχημο, αλλά αποτελεσματικό. Για παράδειγμα::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
el: Η δήλωση ``t = 12345, 54321, 'hello!'`` είναι ένα παράδειγμα *tuple packing*: οι τιμές ``12345``, ``54321`` και ``'hello!'`` είναι συσκευασμένες μαζί σε μια πλειάδα (tuple). Η αντίστροφη λειτουργία είναι επίσης εφικτή::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
el: Αυτό ονομάζεται, αρκετά σωστά, *sequence unpacking* και λειτουργεί για οποιαδήποτε ακολουθία στη δεξιά πλευρά. Το sequence unpacking απαιτεί να υπάρχουν τόσες μεταβλητές στην αριστερή πλευρά του συμβόλου ισότητας όσα στοιχεία υπάρχουν στην ακολουθία. Σημείωση ότι η πολλαπλή ανάθεση είναι στην πραγματικότητα απλώς ένας συνδυασμός tuple packing και sequence unpacking.

source: Sets
el: Σύνολα (Sets)

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
el: Η Python περιλαμβάνει επίσης έναν τύπο δεδομένων για *sets*. Ένα set είναι μια μη ταξινομημένη συλλογή χωρίς διπλότυπα στοιχεία. Οι βασικές χρήσεις περιλαμβάνουν τη δοκιμή ιδιότητας μέλους και την εξάλειψη διπλότυπων εγγραφών. Τα αντικείμενα συνόλου υποστηρίζουν επίσης μαθηματικές πράξεις όπως ένωση, τομή, διαφορά και συμμετρική διαφορά.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
el: Τα άγκιστρα ή η συνάρτηση :func:`set` μπορούν να χρησιμοποιηθούν για τη δημιουργία συνόλων. Σημείωση: για να δημιουργήσετε ένα κενό σύνολο πρέπει να χρησιμοποιήσετε το ``set()``, όχι το ``{}`` ∙ το τελευταίο δημιουργεί ένα κενό λεξικό, μια δομή δεδομένων που θα συζητήσουμε στην επόμενη ενότητα.

source: Here is a brief demonstration::
el: Ακολουθεί μια σύντομη επίδειξη::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
el: Ομοίως με :ref:`list comprehensions <tut-listcomps>`, υποστηρίζονται επίσης τα comprehensions των συνόλων::

source: Dictionaries
el: Λεξικά (Dictionaries)

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`~list.append` and :meth:`~list.extend`.
el: Ένα άλλος χρήσιμος τύπος δεδομένων που είναι ενσωματωμένος στην Python είναι το *dictionary* (βλ. :ref:`typesmapping`). Τα λεξικά βρίσκονται μερικές φορές σε άλλες γλώσσες ως "συσχετιστικές μνήμες" ή "συσχετιστικοί πίνακες". Σε αντίθεση με τις ακολουθίες, οι οποίες είναι με indexes με ένα εύρος αριθμών, τα λεξικά γίνονται index με *keys*, που μπορεί να είναι οποιοσδήποτε αμετάβλητος τύπος∙ οι συμβολοσειρές και οι αριθμοί μπορούν πάντα να είναι κλειδιά. Οι πλειάδες (tuples) μπορούν να χρησιμοποιηθούν ως κλειδιά εάν περιέχουν μόνο συμβολοσειρές, αριθμούς ή πλειάδες (tuples)∙ εάν μια πλειάδα περιέχει οποιοδήποτε μεταβλητό αντικείμενο είτε άμεσα είτε έμμεσα, δεν μπορεί να χρησιμοποιηθεί ως κλειδί. Δεν μπορείτε να χρησιμοποιήσετε λίστες ως κλειδιά, καθώς οι λίστες μπορούν να τροποποιηθούν επιτόπου χρησιμοποιώντας αναθέσεις index, αναθέσεις slice, ή μεθόδους όπως :meth:`~list.append` και :meth:`~list.extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
el: Είναι καλύτερο να σκεφτείτε ένα λεξικό ως ένα σύνολο ζευγών *key: value*, με την προϋπόθεση ότι τα κλειδιά είναι μοναδικά (σε ένα λεξικό). Ένα ζεύγος αγκύλων δημιουργεί ένα κενό λεξικό: ``{}``. Η τοποθέτηση μιας λίστας ζευγών key:value στο λεξικό, αυτός είναι επίσης ο τρόπος με τον οποίο γράφονται τα λεξικά στην έξοδο.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
el: Οι κύριες λειτουργίες σε ένα λεξικό είναι η αποθήκευση μιας τιμής με κάποιο κλειδί και η εξαγωγή της τιμής που δίνεται στο κλειδί. Είναι επίσης δυνατή η διαγραφή ενός ζεύγους key:value με ``del``. Εάν αποθηκεύετε χρησιμοποιώντας ένα κλειδί που βρίσκεται ήδη σε χρήση, η παλιά τιμή που σχετίζεται με αυτό το κλειδί έχει ξεχαστεί. Είναι σφάλμα να εξαγάγετε μια τιμή χρησιμοποιώντας ένα ανύπαρκτο κλειδί.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
el: Η εκτέλεση του ``list(d)`` σε ένα λεξικό επιστρέφει μια λίστα με όλα τα κλειδιά που χρησιμοποιούνται στο λεξικό, με σειρά εισαγωγής (αν θέλετε να ταξινομηθεί, απλώς χρησιμοποιήστε το ``sorted(d)``). Για να ελέγξετε εάν υπάρχει ένα μεμονωμένο κλειδί στο λεξικό, χρησιμοποιήστε τη λέξη-κλειδί :keyword:`in`.

source: Here is a small example using a dictionary::
el: Ακολουθεί ένα μικρό παράδειγμα χρησιμοποιώντας ένα λεξικό::
