Repository: pygreece/python-docs-gr
Catalog: tutorial/errors.po
Languages: el

source: The problem with this code is that it leaves the file open for an indeterminate amount of time after this part of the code has finished executing. This is not an issue in simple scripts, but can be a problem for larger applications. The :keyword:`with` statement allows objects like files to be used in a way that ensures they are always cleaned up promptly and correctly. ::
el: Το πρόβλημα με αυτόν τον κώδικα είναι ότι αφήνει το αρχείο ανοιχτό για απροσδιόριστο χρονικό διάστημα μετά την ολοκλήρωση της εκτέλεσης αυτού του τμήματος του κώδικα. Αυτό δεν είναι πρόβλημα σε απλά σενάρια, αλλά μπορεί να είναι πρόβλημα για μεγαλύτερες εφαρμογές. Η δήλωση :keyword:`with` επιτρέπει σε αντικείμενα όπως αρχεία να χρησιμοποιούνται με τρόπο που διασφαλίζει ότι καθαρίζονται πάντα άμεσα και σωστά. ::

source: After the statement is executed, the file *f* is always closed, even if a problem was encountered while processing the lines. Objects which, like files, provide predefined clean-up actions will indicate this in their documentation.
el: Μετά την εκτέλεση της πρότασης, το αρχείο *f* είναι πάντα κλειστό, ακόμα και αν παρουσιάστηκε πρόβλημα κατά την επεξεργασία των γραμμών. Τα αντικείμενα που, όπως τα αρχεία παρέχουν προκαθορισμένες ενέργειες καθαρισμού θα το υποδεικνύουν στην τεκμηρίωση τους.

source: Raising and Handling Multiple Unrelated Exceptions
el: Raising και Χειρισμός Πολλαπλών Άσχετων Εξαιρέσεων

source: There are situations where it is necessary to report several exceptions that have occurred. This is often the case in concurrency frameworks, when several tasks may have failed in parallel, but there are also other use cases where it is desirable to continue execution and collect multiple errors rather than raise the first exception.
el: Υπάρχουν περιπτώσεις όπου είναι απαραίτητο να αναφερθούν πολλές εξαιρέσεις που έχουν συμβεί. Αυτό συμβαίνει συχνά σε πλαίσια ταυτόχρονης χρήσης, όταν πολλές εργασίες μπορεί να έχουνε αποτύχει παράλληλα, αλλά υπάρχουν και άλλες περιπτώσεις χρήσης όπου είναι επιθυμητό να συνεχιστεί η εκτέλεση και η συλλογή πολλαπλών σφαλμάτων αντί να κάνει raise την πρώτη εξαίρεση.

source: The builtin :exc:`ExceptionGroup` wraps a list of exception instances so that they can be raised together. It is an exception itself, so it can be caught like any other exception. ::
el: Η ενσωματωμένη (builtin) :exc:`ExceptionGroup` αναδιπλώνει μια λίστα με παρουσίες εξαιρέσεων ώστε να μπορούν να αυξηθούν μαζί. Είναι μια εξαίρεση από μόνη της, επομένως μπορεί να συλληφθεί όπως κάθε άλλη εξαίρεση. ::

source: By using ``except*`` instead of ``except``, we can selectively handle only the exceptions in the group that match a certain type. In the following example, which shows a nested exception group, each ``except*`` clause extracts from the group exceptions of a certain type while letting all other exceptions propagate to other clauses and eventually to be reraised. ::
el: Χρησιμοποιώντας ``except*`` αντί για ``except``, μπορούμε επιλεκτικά να χειριστούμε μόνο τις εξαιρέσεις στην ομάδα που αντιστοιχούν σε έναν συγκεκριμένο τύπο. Στο παρακάτω παράδειγμα, το οποίο δείχνει μια ένθετη ομάδα εξαιρέσεων, κάθε πρόταση ``except*`` εξάγει από τις εξαιρέσεις της ομάδας ενός συγκεκριμένου τύπου, ενώ αφήνει όλες τις άλλες εξαιρέσεις να διαδοθούν σε άλλες προτάσεις και τελικά να ξαναγίνουν raise. ::

source: Note that the exceptions nested in an exception group must be instances, not types. This is because in practice the exceptions would typically be ones that have already been raised and caught by the program, along the following pattern::
el: Λάβετε υπόψη ότι οι εξαιρέσεις που είναι ένθετες σε μια ομάδα εξαιρέσεων πρέπει να είναι στιγμιότυπα, όχι τύποι. Αυτό συμβαίνει επειδή στην πράξη οι εξαιρέσεις θα ήταν συνήθως αυτές που έχουν ήδη αναφερθεί και καταγραφεί από το πρόγραμμα, σύμφωνα με το ακόλουθο μοτίβο::

source: Enriching Exceptions with Notes
el: Εμπλουτίζοντας τις Εξαιρέσεις με Σημειώσεις

source: When an exception is created in order to be raised, it is usually initialized with information that describes the error that has occurred. There are cases where it is useful to add information after the exception was caught. For this purpose, exceptions have a method ``add_note(note)`` that accepts a string and adds it to the exception's notes list. The standard traceback rendering includes all notes, in the order they were added, after the exception. ::
el: Όταν δημιουργείται μια εξαίρεση προκειμένου να γίνει raise, συνήθως αρχικοποιείται με πληροφορίες που περιγράφουν το σφάλμα που έχει προκύψει. Υπάρχουν περιπτώσεις όπου είναι χρήσιμο να προστεθούν πληροφορίες μετά την σύλληψη της εξαίρεσης. Για το σκοπό αυτό, οι εξαιρέσεις έχουνε μια μέθοδο ``add_note(note)`` που δέχεται μια συμβολοσειρά και την προσθέτει στη λίστα σημειώσεων της εξαίρεσης. Η standard απόδοση παρακολούθησης περιλαμβάνει όλες τις σημειώσεις, με τη σειρά που προστέθηκα, μετά την εξαίρεση. ::

source: For example, when collecting exceptions into an exception group, we may want to add context information for the individual errors. In the following each exception in the group has a note indicating when this error has occurred. ::
el: Για παράδειγμα, όταν συλλέγουμε εξαιρέσεις σε μια ομάδα εξαιρέσεων, μπορεί να θέλουμε να προσθέσουμε πληροφορίες περιβάλλοντος για τα μεμονωμένα σφάλματα. Στην συνέχεια κάθε εξαίρεση στην ομάδα έχει μια σημείωση που υποδεικνύει πότε έχει συμβεί αυτό το σφάλμα. ::
