Repository: pygreece/python-docs-gr
Catalog: tutorial/inputoutput.po
Languages: el

source: Input and Output
el: Είσοδος και Έξοδος

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
el: Υπάρχουν διάφοροι τρόποι για να παρουσιάσετε τα αποτελέσματα ενός προγράμματος· τα δεδομένα μπορούν να εκτυπωθούν σε μορφή αναγνώσιμη από τον άνθρωπο ή να εγγραφούν σε ένα αρχείο για μελλοντική χρήση. Αυτό το κεφάλαιο θα συζητήσει μερικές από τις δυνατότητες.

source: Fancier Output Formatting
el: Ομορφότερη Μορφοποίηση Εξόδου

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`~io.TextIOBase.write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
el: Μέχρι στιγμής έχουμε συναντήσει δύο τρόπους γραφής τιμών: *expression statements* και τη συνάρτηση :func:`print`. (Ένας τρίτος τρόπος είναι η χρήση της μεθόδου :meth:`~io.TextIOBase.write` των αντικειμένων αρχείων· το standard αρχείο εξόδου μπορεί να αναφέρεται ως ``sys.stdout``. Δείτε την Αναφορά Βιβλιοθήκης για περισσότερες πληροφορίες σχετικά με αυτό.)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
el: Συχνά θα θέλετε περισσότερο έλεγχο στη μορφοποίηση της εξόδου σας παρά απλώς να εκτυπώνετε τιμές διαχωρισμένες με διάστημα. Υπάρχουν διάφοροι τρόποι για να μορφοποιήσετε την έξοδο.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
el: Για να χρησιμοποιήσετε :ref:`formatted string literals <tut-f-strings>`, ξεκινήστε μια συμβολοσειρά με ``f`` or ``F`` πριν από το αρχικό εισαγωγικό ή το τριπλό εισαγωγικό. Μέσα σε αυτήν την συμβολοσειρά, μπορείτε να γράψετε μια έκφραση Python μεταξύ χαρακτήρων ``{`` και ``}`` που μπορεί να αναφέρεται σε μεταβλητές ή κυριολεκτικές τιμές.

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted.
el: Η μέθοδος :meth:`str.format` των συμβολοσειρών απαιτεί περισσότερη μη χειροκίνητη προσπάθεια. Θα εξακολουθείτε να χρησιμοποιείτε τα ``{`` και ``}`` για να επισημάνετε που θα αντικατασταθεί μια μεταβλητή και μπορεί να παρέχει λεπτομερείς οδηγίες μορφοποίησης, αλλά θα χρειαστεί επίσης να παρέχετε τις πληροφορίες που θα μορφοποιήσετε.

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
el: Τέλος, μπορείτε να κάνετε μόνοι σας όλο τον χειρισμό συμβολοσειράς χρησιμοποιώντας λειτουργίες slicing και συνένωσης συμβολοσειρών για να δημιουργήσετε οποιαδήποτε διάταξη μπορείτε να φανταστείτε. Ο τύπος συμβολοσειράς έχει ορισμένες μεθόδους που εκτελούν χρήσιμες λειτουργίες για την προσθήκη συμβολοσειρών σε ένα δεδομένο πλάτος στήλης.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
el: Όταν δεν χρειάζεστε φανταχτερή έξοδο, άλλα θέλετε απλώς μια γρήγορη εμφάνιση ορισμένων μεταβλητών για σκοπούς εντοπισμού σφαλμάτων, μπορείτε να μετατρέψετε οποιαδήποτε τιμή σε μια συμβολοσειρά με τις συναρτήσεις :func:`repr` ή :func:`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
el: Η συνάρτηση :func:`str` προορίζεται να επιστρέφει αναπαραστάσεις τιμών που είναι αρκετά αναγνώσιμες από τον άνθρωπο, ενώ το :func:`repr` προορίζεται για τη δημιουργία αναπαραστάσεων που μπορούν να διαβαστούν από τον διερμηνέα (ή θα επιβάλουν ένα :exc:`SyntaxError` αν δεν υπάρχει ισοδύναμη σύνταξη). Για αντικείμενα που δεν έχουν συγκεκριμένη αναπαράσταση για ανθρώπινη κατανάλωση, η :func:`str` θα επιστρέψει την ίδια τιμή με το :func:`repr`. Πολλές τιμές, όπως αριθμοί ή δομές όπως λίστες και λεξικά, έχουν την ίδια αναπαράσταση χρησιμοποιώντας οποιαδήποτε συνάρτηση. Τα strings, συγκεκριμένα, έχουν δύο διακριτές παραστάσεις.

source: Some examples::
el: Μερικά παραδείγματα::

source: The :mod:`string` module contains a :class:`~string.Template` class that offers yet another way to substitute values into strings, using placeholders like ``$x`` and replacing them with values from a dictionary, but offers much less control of the formatting.
el: Το module :mod:`string` περιέχει μια κλάση :class:`~string.Template` που προσφέρει έναν ακόμη τρόπο αντικατάστασης τιμών σε συμβολοσειρές, χρησιμοποιώντας placeholders όπως ``$x`` και αντικαθιστώντας τις με τιμές από ένα λεξικό, αλλά προσφέρει πολύ λιγότερο έλεγχο της μορφοποίησης.

source: Formatted String Literals
el: Μορφοποιημένα String Literals

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
el: Τα :ref:`Formatted string literals <f-strings>` (ονομάζονται επίσης f-strings για συντομία) σας επιτρέπουν να συμπεριλάβετε την τιμή των εκφράσεων Python μέσα σε μια συμβολοσειρά, θέτοντας πρόθεμα στη συμβολοσειρά με ``f`` ή ``F`` και γράφοντας εκφράσεις ως ``{expression}``.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
el: Ένας προαιρετικός αναθέτης (specifier) μορφής μπορεί να ακολουθεί την έκφραση. Αυτό επιτρέπει μεγαλύτερο έλεγχο στον τρόπο μορφοποίησης της τιμής. Το παρακάτω παράδειγμα στρογγυλοποιεί το pi σε τρία ψηφία μετά το δεκαδικό::

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
el: Η μετάδοση ενός ακέραιου αριθμού μετά το ``':'`` θα έχει ως αποτέλεσμα αυτό το πεδίο να έχει πλάτος ελάχιστου αριθμού χαρακτήρων. Αυτό είναι χρήσιμο για την ευθυγράμμιση στηλών. ::

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
el: Μπορούν να χρησιμοποιηθούν άλλοι τροποποιητές για την μετατροπή της τιμής πριν τη μορφοποίηση της. Το ``'!a'`` ισχύει για :func:`ascii`, το ``'!s'`` ισχύει για :func:`str`, και το ``'!r'`` ισχύει για :func:`repr`::

source: The ``=`` specifier can be used to expand an expression to the text of the expression, an equal sign, then the representation of the evaluated expression:
el: Ο αναθέτης (specifier) ``=`` μπορεί να χρησιμοποιηθεί για να επεκτείνει μια έκφραση στο κείμενο της έκφρασης, ένα σύμβολο ίσο, και μετά την αναπαράσταση της αξιολογούμενης έκφρασης:

source: See :ref:`self-documenting expressions <bpo-36817-whatsnew>` for more information on the ``=`` specifier. For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
el: Δείτε το :ref:`self-documenting expressions <bpo-36817-whatsnew>` για περισσότερες πληροφορίες σχετικά με τον αναθέτη (specifier) ``=``. Για αναφορά σε αυτές τις προδιαγραφές μορφής, ανατρέξτε στον οδηγό αναφοράς για το :ref:`formatspec`.

source: The String format() Method
el: Η μέθοδος String format()

source: Basic usage of the :meth:`str.format` method looks like this::
el: Η βασική χρήση της μεθόδου :meth:`str.format` μοιάζει με αυτό::

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
el: Οι αγκύλες και οι χαρακτήρες μέσα σε αυτές (που ονομάζονται πεδία μορφής) αντικαθίστανται με τα αντικείμενα που μεταβιβάζονται στη μέθοδο :meth:`str.format`. Ένας αριθμός στις αγκύλες μπορεί να χρησιμοποιηθεί για να αναφέρεται στη θέση του αντικειμένου που μεταβιβάζεται στη μέθοδο :meth:`str.format`. ::

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
el: Εάν χρησιμοποιούνται keyword ορίσματα στη μέθοδο :meth:`str.format`, οι τιμές τους αναφέρονται χρησιμοποιώντας το όνομα του ορίσματος. ::

source: Positional and keyword arguments can be arbitrarily combined::
el: Τα ορίσματα θέσης και λέξης-κλειδιού μπορούν να συνδυαστούν αυθαίρετα::

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
el: Εάν έχετε μια συμβολοσειρά πολύ μακριάς μορφής που δεν θέλετε να χωρίσετε, θα ήταν ωραίο να αναφέρετε τις μεταβλητές που θα μορφοποιηθούν με βάση το όνομα αντί για τη θέση. Αυτό μπορεί να γίνει απλά περνώντας το λεξικό και χρησιμοποιώντας αγκύλες ``'[]'`` για πρόσβαση στα κλειδιά ::

source: This could also be done by passing the ``table`` dictionary as keyword arguments with the ``**`` notation. ::
el: Αυτό θα μπορούσε επίσης να γίνει περνώντας το λεξικό ``table`` ως ορίσματα λέξεων-κλειδιών με την σημείωση ``**``. ::

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables.
el: Αυτό είναι ιδιαίτερα χρήσιμο σε συνδυασμό με την ενσωματωμένη (built-in) συνάρτηση :func:`vars`, η οποία επιστρέφει ένα λεξικό που περιέχει όλες τις τοπικές μεταβλητές.

source: As an example, the following lines produce a tidily aligned set of columns giving integers and their squares and cubes::
el: Για παράδειγμα, οι ακόλουθες γραμμές παράγουν ένα τακτοποιημένο σύνολο στηλών που δίνουν ακέραιους αριθμούς και τα τετράγωνα και τους κύβους τους::

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
el: Για μια πλήρη επισκόπηση της μορφοποίησης συμβολοσειρών με :meth:`str.format`, δείτε :ref:`formatstrings`.

source: Manual String Formatting
el: Χειροκίνητη Μορφοποίηση Συμβολοσειρών

source: Here's the same table of squares and cubes, formatted manually::
el: Ακολουθεί ο ίδιος πίνακας τετραγώνων και κύβων, μορφοποιημένος χειροκίνητα::

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
el: (Σημειώστε ότι το ένα κενό μεταξύ κάθε στήλης προστέθηκε με τον τρόπο που λειτουργεί το :func:`print`: προσθέτει πάντα κενά μεταξύ των ορισμάτων του.)

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
el: Η μέθοδος :meth:`str.rjust` των αντικειμένων συμβολοσειράς τοποθετεί δεξιά μια συμβολοσειρά σε ένα πεδίο δεδομένου πλάτους συμπληρώνοντας την με κενά στα αριστερά. Υπάρχουν παρόμοιες μέθοδοι :meth:`str.ljust` και :meth:`str.center`. Αυτές οι μέθοδοι δεν γράφουν τίποτα, απλώς επιστρέφουν μια συμβολοσειρά. Εάν η συμβολοσειρά εισόδου είναι πολύ μεγάλη, δεν την περικόπτουν, αλλά την επιστρέφουν αμετάβλητη· αυτό θα μπερδέψει τη διάταξη της στήλης σας, αλλά αυτό είναι συνήθως καλύτερο από την εναλλακτική, που θα ήταν ψέματα για μια τιμή. (Αν θέλετε πραγματικά περικοπή, μπορείτε πάντα να προσθέσετε μια λειτουργία slice, όπως στο ``x.ljust(n)[:n]``.)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
el: Υπάρχει μια άλλη μέθοδος, η :meth:`str.zfill`, η οποία συμπληρώνει μια αριθμητική συμβολοσειρά στα αριστερά με μηδενικά. Καταλαβαίνει τα σύμβολα συν και πλην::

source: Old string formatting
el: Παλιά μορφοποίηση συμβολοσειράς

source: The % operator (modulo) can also be used for string formatting. Given ``'string' % values``, instances of ``%`` in ``string`` are replaced with zero or more elements of ``values``. This operation is commonly known as string interpolation. For example::
el: Ο τελεστής % (modulo) μπορεί επίσης να χρησιμοποιηθεί για τη μορφοποίηση συμβολοσειρών. Δεδομένων των τιμών ``'string' % values``, στιγμιότυπα του ``%`` στο ``string`` αντικαθίστανται με μηδέν ή περισσότερα στοιχεία των ``τιμών``. Αυτή η λειτουργία είναι συνήθως γνωστή ως παρεμβολή συμβολοσειρών. Για παράδειγμα::

source: More information can be found in the :ref:`old-string-formatting` section.
el: Περισσότερες πληροφορίες μπορείτε να βρείτε στην ενότητα :ref:`old-string-formatting`.

source: Reading and Writing Files
el: Ανάγνωση και Εγγραφή Αρχείων

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
el: Η :func:`open` επιστρέφει ένα :term:`file object`, και χρησιμοποιείται πιο συχνά με δύο ορίσματα θέσης και ένα όρισμα λέξης-κλειδιού: ``open(filename, mode, encoding=None)``

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
el: Το πρώτο όρισμα είναι μια συμβολοσειρά που περιέχει το όνομα αρχείου. Το δεύτερο όρισμα είναι μια άλλη συμβολοσειρά που περιέχει μερικούς χαρακτήρες που περιγράφουν τον τρόπο με τον οποίο θα χρησιμοποιηθεί το αρχείο. Η *mode* μπορεί να είναι ``'r'`` όταν το αρχείο θα είναι μόνο για διάβασμα, ``'w'`` μόνο για εγγραφή (ένα υπάρχον αρχείο με το ίδιο όνομα θα διαγραφεί) και το ``'a'`` ανοίγει το αρχείο για προσάρτηση· οποιαδήποτε δεδομένα γράφονται στο αρχείο και προστίθενται αυτόματα στο τέλος. Το ``'r+'`` ανοίγει το αρχείο τόσο για ανάγνωση όσο και για γραφή. Το όρισμα *mode* είναι προαιρετικό· το ``'r'`` θα θεωρείται εάν παραληφθεί.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
el: Κανονικά, τα αρχεία ανοίγουν σε :dfn:`text mode`, που σημαίνει ότι διαβάζετε και γράφετε συμβολοσειρές από και προς το αρχείο, οι οποίες κωδικοποιούνται σε μια συγκεκριμένη *κωδικοποίηση*. Εάν δεν έχει καθοριστεί η *κωδικοποιήση*, η προεπιλογή είναι εξαρτώμενη από την πλατφόρμα (δείτε :func:`open`). Επειδή το UTF-8 είναι το σύγχρονο de-facto standard, ``encoding="utf-8"`` συνίσταται εκτός εάν γνωρίζετε ότι πρέπει να χρησιμοποιήσετε διαφορετική κωδικοποίηση. Η προσθήκη ενός ``'b'`` στη λειτουργία ανοίγει το αρχείο σε :dfn:`binary mode`. Τα δεδομένα δυαδικής λειτουργίας διαβάζονται και γράφονται ως αντικείμενα :class:`bytes`. Δεν μπορείτε να καθορίσετε *κωδικοποίηση* όταν ανοίγετε αρχείο σε δυαδική λειτουργία.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
el: Στη λειτουργία κειμένου, η προεπιλογή (default) κατά την ανάγνωση είναι να μετατρέψετε τις καταλήξεις γραμμών για συγκεκριμένη πλατφόρμα (``\n`` στο Unix, ``\r\n`` στα Windows) σε μόνο ``\n``. Όταν γράφετε σε λειτουργία κειμένου, η προεπιλογή είναι να μετατρέπονται οι εμφανίσεις ``\n`` σε καταλήξεις γραμμών για συγκεκριμένη πλατφόρμα. Αυτή η παρασκηνιακή τροποποίηση στα δεδομένα αρχείων είναι καλή για αρχεία κειμένου, αλλά θα καταστρέψει δυαδικά δεδομένα όπως αυτό σε αρχεία :file:`JPEG` ή :file:`EXE`. Να είστε πολύ προσεκτικοί να χρησιμοποιείτε τη δυαδική λειτουργία όταν διαβάζετε και γράφετε τέτοια αρχεία.

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
el: Είναι καλή πρακτική να χρησιμοποιείτε το keyword :keyword:`with` όταν ασχολούμαστε με αντικείμενα αρχείου. Το πλεονέκτημα είναι ότι το αρχείο κλείνει σωστά μετά την ολοκλήρωση της εκτέλεσής του, ακόμα κι αν κάποια στιγμή προκύψει εξαίρεση. Χρησιμοποιώντας το :keyword:`!with` είναι επίσης πολύ πιο σύντομο από την σύνταξη ισοδύναμου :keyword:`try`\ -\ :keyword:`finally` blocks::

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
el: Εάν δεν χρησιμοποιείτε τη keyword :keyword:`with`, τότε θα πρέπει να καλείτε τη ``f.close()`` για να κλείσετε το αρχείο και να ελευθερώσετε αμέσως τυχόν πόρους συστήματος που χρησιμοποιούνται από αυτό.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
el: Η κλήση του ``f.write()`` χωρίς τη χρήση της keyword :keyword:`!with` ή η κλήση του ``f.close()`` **μπορεί** να οδηγήσει στα ορίσματα του ``f.write()`` να μην εγγραφεί πλήρως στο δίσκο, ακόμα και αν το πρόγραμμα εξέλθει με επιτυχία.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
el: Μετά το κλείσιμο ενός αντικειμένου αρχείου, είτε μια δήλωση :keyword:`with` είτε καλώντας ``f.close()``, οι προσπάθειες χρήσης του αντικειμένου αρχείου θα αποτύχουν αυτόματα. ::

source: Methods of File Objects
el: Μέθοδοι Αντικειμένων Αρχείων

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
el: Τα υπόλοιπα παραδείγματα σε αυτήν την ενότητα θα υποθέσουν ότι ένα αντικείμενο αρχείου που ονομάζεται ``f`` έχει ήδη δημιουργηθεί.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
el: Για να διαβάσετε τα περιεχόμενα ενός αρχείου, καλέστε το ``f.read(size)``, το οποίο διαβάζει κάποια ποσότητα δεδομένων και την επιστρέφει ως συμβολοσειρά (σε λειτουργία κειμένου) ή ως αντικείμενο bytes (σε δυαδική λειτουργία). Το *size* είναι προαιρετικό αριθμητικό όρισμα. Όταν το *size* παραλείπεται ή είναι αρνητικό, ολόκληρο το περιεχόμενο του αρχείου θα διαβαστεί και θα επιστραφεί∙ είναι δικό σας πρόβλημα εάν το αρχείο είναι διπλάσιο από τη μνήμη του υπολογιστή σας. Διαφορετικά, διαβάζονται και επιστρέφονται το πολύ *size* χαρακτήρες (σε λειτουργία κειμένου) ή byte *size* (σε δυαδική λειτουργία). Εάν έχει φτάσει το τέλος του αρχείου, το ``f.read()`` θα επιστρέψει μια κενή συμβολοσειρά (``''``). ::

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
el: Το ``f.readline()`` διαβάζει μία γραμμή από το αρχείο· ένας χαρακτήρας νέας γραμμής (``\n``) παραμένει στο τέλος της συμβολοσειράς, και παραλείπεται μόνο στην τελευταία γραμμή του αρχείου εάν το αρχείο δεν τελειώνει σε μια νέα γραμμή. Αυτό καθιστά την τιμή επιστροφής σαφή· εάν το ``f.readline()`` επιστρέφει μια κενή συμβολοσειρά, έχει φτάσει στο τέλος του αρχείου, ενώ μια κενή γραμμή αντιπροσωπεύεται από ``'\n'``, μια συμβολοσειρά που περιέχει μόνο μία νέα γραμμή. ::

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
el: Για την ανάγνωση γραμμών από ένα αρχείο, μπορείτε να κάνετε loop πάνω από το αντικείμενο του αρχείου. Αυτό είναι αποδοτικό στη μνήμη, γρήγορο και οδηγεί σε απλό κώδικα::

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
el: Εάν θέλετε να διαβάσετε όλες τις γραμμές ενός αρχείου σε μια λίστα, μπορείτε επίσης να χρησιμοποιήσετε το ``list(f)`` ή ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
el: Το ``f.write(string)`` γράφει τα περιεχόμενα του *string* στο αρχείο, επιστρέφοντας τον αριθμό των χαρακτήρων που γράφτηκαν. ::

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
el: Άλλοι τύποι αντικειμένων πρέπει να μετατραπούν -- είτε σε μια συμβολοσειρά (σε λειτουργία κειμένου) ή σε ένα αντικείμενο bytes (σε δυαδική λειτουργία) -- πριν τα γράψετε::
