Repository: pygreece/python-docs-gr
Catalog: tutorial/inputoutput.po
Languages: el

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
el: Το ``f.tell()`` επιστρέφει έναν ακέραιο που δίνει την τρέχουσα θέση του αντικειμένου αρχείου στο αρχείο που αντιπροσωπεύεται ως αριθμό byte από την αρχή του αρχείου όταν βρίσκεται σε δυαδική λειτουργία και έναν αδιαφανή αριθμό όταν βρίσκεται σε λειτουργία κειμένου.

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
el: Για να αλλάξετε τη θέση του αντικειμένου, χρησιμοποιήστε το ``f.seek(offset, whence)``. Η θέση υπολογίζεται από την προσθήκη *offset* σε ένα σημείο αναφοράς· το σημείο αναφοράς επιλέγεται από το όρισμα *whence*. Μια 0 τιμή *whence* μετρά από την αρχή του αρχείο το 1 χρησιμοποιεί την τρέχουσα θέση αρχείου και το 2 χρησιμοποιεί το τέλος του αρχείου ως σημείο αναφοράς. Το *whence* μπορεί να παραληφθεί και να οριστεί από προεπιλογή 0, χρησιμοποιώντας την αρχή του αρχείου ως σημείο αναφοράς. ::

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
el: Σε αρχεία κειμένου (αυτά που ανοίγουν χωρίς ``b`` στη λειτουργία string), επιτρέπονται μόνο αναζητήσεις σε σχέση με την αρχή του αρχείου (η εξαίρεση είναι η αναζήτηση μέχρι το ίδιο το αρχείο που τελειώνει με ``seek(0, 2)``) και οι μόνες έγκυρες τιμές *offset* είναι αυτές που επιστρέφονται από το ``f.tell()``, ή μηδέν. Οποιαδήποτε άλλη τιμή *offset* παράγει απροσδιόριστη συμπεριφορά.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
el: Τα αντικείμενα αρχείου έχουν ορισμένες πρόσθετες μεθόδους, όπως :meth:`~io.IOBase.isatty` και :meth:`~io.IOBase.truncate` που χρησιμοποιούνται λιγότερο συχνά· συμβουλευτείτε την Αναφορά της Βιβλιοθήκης για έναν πλήρη οδηγό για τα αντικείμενα αρχείων.

source: Saving structured data with :mod:`json`
el: Αποθήκευση δομημένων δεδομένων με :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
el: Οι συμβολοσειρές μπορούν εύκολα να γραφούν και να διαβαστούν από ένα αρχείο. Οι αριθμοί απαιτούν λίγο περισσότερη προσπάθεια, καθώς η μέθοδος :meth:`~io.TextIOBase.read` επιστρέφει μόνο συμβολοσειρές, οι οποίες θα πρέπει να περάσουν μια συνάρτηση όπως :func:`int`, που παίρνει μια συμβολοσειρά όπως ``'123'`` και επιστρέφει την αριθμητική της τιμή 123. Όταν θέλετε να αποθηκεύσετε πιο σύνθετους τύπους δεδομένων, όπως ένθετε λίστες και λεξικά, η ανάλυση και η σειριοποίηση με το χέρι γίνεται περίπλοκη.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
el: Αντί να χρειάζεται οι χρήστες να γράφουν και να διορθώνουν συνεχώς κώδικα για να αποθηκεύουν πολύπλοκους τύπους δεδομένων σε αρχεία, η Python σας επιτρέπει να χρησιμοποιείτε τη δημοφιλή μορφή ανταλλαγής δεδομένων που ονομάζεται `JSON (JavaScript Object Notation) <https://json.org>`_. Το standard module που ονομάζεται :mod:`json` μπορεί να λάβει ιεραρχίες δεδομένων Python, και να τις μετατρέψει σε αναπαραστάσεις συμβολοσειρών· αυτή η διαδικασία ονομάζεται :dfn:`serializing`.. Η ανασύνθεση των δεδομένων από την αναπαράσταση συμβολοσειράς ονομάζεται :dfn:`deserializing`. Μεταξύ σειριοποίησης και αποσειριοποίησης, η συμβολοσειρά που αντιπροσωπεύει το αντικείμενο μπορεί να έχει αποθηκευτεί σε ένα αρχείο ή δεδομένα ή να έχει σταλεί μέσω μιας σύνδεσης δικτύου σε κάποιο απομακρυσμένο μηχάνημα.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
el: Η μορφή JSON χρησιμοποιείται συνήθως από σύγχρονες εφαρμογές για να επιτρέπει την ανταλλαγή δεδομένων. Πολλοί προγραμματιστές είναι ήδη εξοικειωμένοι με αυτήν, γεγονός που την καθιστά καλή επιλογή για διαλειτουργικότητα.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
el: Εάν έχετε ένα αντικείμενο ``x``, μπορείτε να δείτε την αναπαράσταση συμβολοσειράς JSON με μια απλή γραμμή κώδικα::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
el: Μια άλλη παραλλαγή της συνάρτησης :func:`~json.dumps`, που ονομάζεται :func:`~json.dump`, απλώς σειριοποιεί το αντικείμενο σε ένα :term:`text file`. Έτσι, εάν το ``f`` είναι ένα αντικείμενο :term:`text file` που ανοίγει για εγγραφή, μπορούμε να κάνουμε αυτό::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
el: Για να αποκωδικοποιήσετε ξανά το αντικείμενο, εάν το ``f`` είναι ένα αντικείμενο :term:`binary file` ή :term:`text file` που έχει ανοίξει για ανάγνωση::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
el: Τα αρχεία JSON πρέπει να είναι κωδικοποιημένα σε UTF-8. Χρησιμοποιήστε το ``encoding="utf-8"`` όταν ανοίγετε το αρχείο JSON ως :term:`text file` τόσο για ανάγνωση όσο και για εγγραφή.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
el: Αυτή η απλή τεχνική σειριοποίησης μπορεί να χειριστεί λίστες και λεξικά, άλλα η σειριοποίηση αυθαίρετων στιγμιοτύπων κλάσεων σε JSON απαιτεί λίγη επιπλέον προσπάθεια. Η αναφορά για το module :mod:`json` περιέχει μια εξήγηση για αυτό.

source: :mod:`pickle` - the pickle module
el: :mod:`pickle` - το pickle module

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
el: Σε αντίθεση με το :ref:`JSON <tut-json>`, το *pickle* είναι ένα πρωτόκολλο που επιτρέπει τη σειριοποίηση αυθαίρετα πολύπλοκων αντικειμένων Python. Ως εκ τούτου, είναι συγκεκριμένο για την Python και δεν μπορεί να χρησιμοποιηθεί για επικοινωνία με εφαρμογές γραμμένες σε άλλες γλώσσες. Είναι επίσης ανασφαλές από προεπιλογή: η αποσειριοποίηση pickle δεδομένων που προέρχονται από μια μη αξιόπιστη πηγή μπορεί να εκτελέσει αυθαίρετο κώδικα, εάν τα δεδομένα έχουν δημιουργηθεί από έναν έμπειρο εισβολέα.

source: built-in function
el: ενσωματωμένη (built-in) συνάρτηση
