Repository: pygreece/python-docs-gr
Catalog: tutorial/interpreter.po
Languages: el

source: Using the Python Interpreter
el: Χρησιμοποιώντας τον Interpreter της Python

source: Invoking the Interpreter
el: Κάνοντας invoke τον Interpreter

source: The Python interpreter is usually installed as :file:`/usr/local/bin/python3.12` on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
el: Ο Interpreter της Python συνήθως είναι εγκατεστημένος ως :file:`/usr/local/bin/python3.12` σε εκείνα τα μηχανήματα όπου είναι διαθέσιμο· βάζοντας :file:`/usr/local/bin` στη διαδρομή αναζήτησης του Unix shell σας επιτρέπει να το εκκινήσετε πληκτρολογώντας την εντολή:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
el: στο shell. [#]_ Εφόσον η επιλογή του καταλόγου όπου βρίσκεται ο interpreter είναι μια επιλογή εγκατάστασης, και άλλα μέρη είναι πιθανά∙ επικοινωνήστε με τον τοπικό σας guru της Python ή τον διαχειριστή συστήματος. (π.χ., :file:`/usr/local/python` είναι μια δημοφιλής εναλλακτική τοποθεσία.)

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the :file:`python3.12` command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
el: Σε μηχανήματα με Windows όπου έχετε εγκαταστήσει την Python από το :ref:`Microsoft Store <windows-store>`, η εντολή :file:`python3.12` θα είναι διαθέσιμη. Εάν έχετε το πρόγραμμα εκκίνησης :ref:`py.exe launcher <launcher>` εγκατεστημένο, μπορείτε να χρησιμοποιήσετε την εντολή :file:`py`. Βλ. :ref:`setting-envvars` για άλλους τρόπους εκκίνησης της Python.

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
el: Η πληκτρολόγηση ενός χαρακτήρα τέλους αρχείου (:kbd:`Control-D` στο Unix, :kbd:`Control-Z` στα Windows) στην κύρια γραμμή εντολών αναγκάζει τον interpreter να βγει με μηδενική κατάσταση εξόδου. Εάν αυτό δεν λειτουργεί, μπορείτε να βγείτε από τον διερμηνέα πληκτρολογώντας την ακόλουθη εντολή: ``quit()``.

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
el: Οι δυνατότητες επεξεργασίας γραμμής του interpreter περιλαμβάνουν interactive επεξεργασία, αντικατάσταση ιστορικού και συμπλήρωση κώδικα σε συστήματα που υποστηρίζουν την `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ βιβλιοθήκη. Ίσως ο πιο γρήγορος έλεγχος για να δείτε αν υποστηρίζεται η επεξεργασία της γραμμής εντολών είναι να πληκτρολογήσετε :kbd:`Control-P` στην πρώτη γραμμή εντολών Python που λαμβάνετε. Εάν ηχήσει, έχετε επεξεργασία γραμμής εντολών∙ βλ. το παράρτημα :ref:`tut-interacting` για εισαγωγή στα πλήκτρα. Εάν δεν φαίνεται να συμβαίνει τίποτα ή αν ηχήσει το ``^P``, η επεξεργασία της γραμμής εντολών δεν είναι διαθέσιμη∙ θα μπορείτε να χρησιμοποιήσετε μόνο το backspace για να αφαιρέσετε χαρακτήρες από την τρέχουσα γραμμή.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
el: Ο interpreter λειτουργεί κάπως όπως το Unix shell: όταν καλείται μια standard είσοδο συνδεδεμένη σε μια συσκευή tty, διαβάζει και εκτελεί εντολές αλληλεπιδραστικά∙ όταν καλείται με ένα όρισμα ονόματος αρχείου ή με ένα αρχείο ως standard είσοδο, διαβάζει και εκτελεί ένα *script* από αυτό το αρχείο.

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety.
el: Ένας δεύτερος τρόπος εκκίνησης του interpreter είναι ``python -c command [arg] ...``, η οποία εκτελεί τις εντολές στο *command*, ανάλογο με την επιλογή :option:`-c` του shell. Εφόσον οι δηλώσεις Python συχνά περιέχουν κενά διαστήματα ή άλλους χαρακτήρες που είναι ειδικοί για το shell, συνήθως συνίσταται να αναφέρετε το *command* στο σύνολο του.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
el: Ορισμένα Python modules είναι επίσης χρήσιμα ως scripts. Αυτά μπορούν να κληθούν χρησιμοποιώντας το ``python -m module [arg] ...``, το οποίο εκτελεί το πηγαίο αρχείο για το *module* σαν να είχατε γράψει το πλήρες όνομα του, στη γραμμή εντολών.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
el: Όταν χρησιμοποιείται ένα script αρχείο, μερικές φορές είναι χρήσιμο να μπορείτε να εκτελέσετε το script και να εισέλθετε σε interactive λειτουργία μετά. Αυτό μπορεί να γίνει περνώντας το :option:`-i` πριν από το script.

source: All command line options are described in :ref:`using-on-general`.
el: Όλες οι επιλογές της γραμμής εντολών περιγράφονται στο :ref:`using-on-general`.

source: Argument Passing
el: Εισαγωγή Ορίσματος

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
el: Όταν είναι γνωστά στον interpreter, το όνομα του script και τα πρόσθετα ορίσματα στην συνέχεια μετατρέπονται σε λίστα συμβολοσειρών και εκχωρούνται στην μεταβλητή ``argv`` στο module ``sys``. Μπορείτε να αποκτήσετε πρόσβαση σε αυτήν την λίστα εκτελώντας το ``import sys``. Το μήκος της λίστας είναι τουλάχιστον ένα∙ όταν δεν δίνονται script και δεν δίνονται ορίσματα, το ``sys.argv[0]`` είναι μια κενή συμβολοσειρά. Όταν το όνομα του script δίνεται ως ``'-'`` (που σημαίνει standard είσοδος), το ``sys.argv[0]`` ορίζεται ως ``'-'``. Όταν χρησιμοποιείται η *εντολή* :option:`-c`, το ``sys.argv[0]``ορίζεται σε ``'-c'``. Όταν χρησιμοποιείται η *εντολή* :option:`-m` , το ``sys.argv[0]`` ορίζεται ως το πλήρες όνομα του module που βρίσκεται. Οι επιλογές που βρέθηκαν μετά την *εντολή* :option:`-c` ή το :option:`-m` *module* δεν καταναλώνονται από τον επεξεργαστή επιλογών του interpreter της Python αλλά αφήνονται στο ``sys.argv`` για την εντολή ή το module να το διαχειριστεί.

source: Interactive Mode
el: Interactive Λειτουργία

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
el: Όταν διαβάζονται εντολές από ένα tty, ο interpreter λέγεται ότι βρίσκεται σε *interactive λειτουργία*. Σε αυτή τη λειτουργία υπενθυμίζει την επόμενη εντολή με την *κύρια εντολή*, συνήθως τρία σύμβολα μεγαλύτερο (``>>>``)∙ για τις γραμμές συνέχειας, υπενθυμίζει με τη *δευτερεύουσα εντολή*, από προεπιλογή τρεις τελείες (``...``). Ο interpreter εκτυπώνει ένα μήνυμα καλωσορίσματος που αναφέρει τον αριθμό έκδοσης και μια ειδοποίηση πνευματικών δικαιωμάτων πριν εκτυπώσει το πρώτο μήνυμα:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
el: Απαιτούνται γραμμές συνέχειας όταν εισάγεται μια κατασκευή πολλών γραμμών. Για παράδειγμα ρίξτε μια ματιά σε αυτήν την δήλωση :keyword:`if`::

source: For more on interactive mode, see :ref:`tut-interac`.
el: Για περισσότερα σχετικά με την interactive λειτουργία, βλ. :ref:`tut-interac`.

source: The Interpreter and Its Environment
el: Ο Interpreter και το Περιβάλλον του

source: Source Code Encoding
el: Κωδικοποίηση Πηγαίου Κώδικα

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
el: Από προεπιλογή, τα πηγαία αρχεία Python αντιμετωπίζονται ως κωδικοποιημένα στο UTF-8. Σε αυτήν την κωδικοποίηση, οι χαρακτήρες των περισσότερων γλωσσών στον κόσμο μπορούν να χρησιμοποιηθούν ταυτόχρονα σε literal συμβολοσειρές, αναγνωριστικά και σχόλια --- αν και η τυπική βιβλιοθήκη χρησιμοποιεί μόνο χαρακτήρες ASCII για αναγνωριστικά, μια σύμβαση που πρέπει να ακολουθεί οποιοδήποτε φορητός κώδικας. Για να εμφανίσει σωστά όλους αυτούς τους χαρακτήρες, το λογισμικό επεξεργασίας σας πρέπει να αναγνωρίσει ότι το αρχείο είναι UTF-8 και πρέπει να χρησιμοποιεί μια γραμματοσειρά που να υποστηρίζει όλους τους χαρακτήρες του αρχείου.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
el: Για να δηλώσετε μια κωδικοποίηση διαφορετική από την προεπιλεγμένη, θα πρέπει να προστεθεί μια ειδική γραμμή σχολίων ως *πρώτη* γραμμή του αρχείου. Η σύνταξη είναι η εξής::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
el: όπου το *encoding* είναι ένα από τα έγκυρα :mod:`codecs` που υποστηρίζονται από την Python.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
el: Για παράδειγμα, για να δηλώσετε ότι πρόκειται να χρησιμοποιηθεί η κωδικοποίηση Windows-1252 , η πρώτη γραμμή του αρχείου του πηγαίου κώδικα θα πρέπει να είναι::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
el: Μια εξαίρεση στον κανόνα *first line* είναι όταν ο πηγαίος κώδικας ξεκινά με μια γραμμή :ref:`UNIX "shebang" <tut-scripts>`. Σε αυτήν την περίπτωση, η δήλωση κωδικοποίησης θα πρέπει να προστεθεί ως δεύτερη γραμμή του αρχείου. Για παράδειγμα::

source: Footnotes
el: Υποσημειώσεις

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
el: Στο Unix, ο Python 3.x interpreter από προεπιλογή δεν είναι εγκατεστημένος με το εκτελέσιμο αρχείο που ονομάζεται ``python``, έτσι ώστε να μην έρχεται σε conflict με ένα εκτελέσιμο Python 2.x που εγκαθίσταται ταυτόχρονα.
