Repository: pygreece/python-docs-gr
Catalog: tutorial/modules.po
Languages: el

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
el: Εάν βγείτε από τον interpreter της Python και μπείτε ξανά, οι ορισμοί που έχετε κάνει (συναρτήσεις και μεταβλητές) χάνονται. Επομένως, εάν θέλετε να γράψετε ένα κάπως μεγαλύτερο πρόγραμμα, είναι προτιμότερο να χρησιμοποιήσετε έναν επεξεργαστή κειμένου για να προετοιμάσετε την εισαγωγή για τον interpreter και την εκτέλεση του με αυτό το αρχείο ως input. Αυτό είναι γνωστό ως δημιουργία *script*. Καθώς το πρόγραμμα σας μεγαλώνει, μπορεί να θέλετε να το χωρίσετε σε πολλά αρχεία για ευκολότερη συντήρηση. Μπορεί επίσης να θέλετε να χρησιμοποιήσετε μια εύχρηστη συνάρτηση που έχετε γράψει σε πολλά προγράμματα χωρίς να αντιγράψετε τον ορισμό της σε κάθε πρόγραμμα.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
el: Για να το υποστηρίξει αυτό, η Python έχει έναν τρόπο να βάζει ορισμούς σε ένα αρχείο και να τους χρησιμοποιεί σε ένα script ή σε ένα διαδραστικό instance του interpreter. Ένα τέτοιο αρχείο ονομάζεται *module*∙ ορισμοί από μια ενότητα μπορούν να *εισαχθούν* σε άλλα modules ή στο *κύριο* module (η συλλογή των μεταβλητών στις οποίες έχετε πρόσβαση σε ένα script που εκτελείται στον ανώτερο επίπεδο και σε λειτουργία αριθμομηχανής).

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
el: Ένα module είναι ένα αρχείο που περιέχει ορισμούς και δηλώσεις Python. Το όνομα αρχείου είναι το όνομα του module με το επίθημα :file:`.py`. Μέσε σε ένα module, το όνομα του module (ως συμβολοσειρά) είναι διαθέσιμο ως τιμή της global μεταβλητής ``__name__``. Για παράδειγμα, χρησιμοποιήστε το αγαπημένος σας πρόγραμμα επεξεργασίας κειμένου για να δημιουργήσετε ένα αρχείο που ονομάζεται :file:`fibo.py` στον τρέχοντα κατάλογο με τα ακόλουθα περιεχόμενα::

source: Now enter the Python interpreter and import this module with the following command::
el: Τώρα εισάγετε τον Python interpreter και εισάγετε αυτό το module με την ακόλουθη εντολή::

source: This does not add the names of the functions defined in ``fibo`` directly to the current :term:`namespace` (see :ref:`tut-scopes` for more details); it only adds the module name ``fibo`` there. Using the module name you can access the functions::
el: Αυτό δεν προσθέτει τα ονόματα των συναρτήσεων που ορίζονται στο ``fibo`` απευθείας στον τρέχοντα :term:`namespace` (βλ. :ref:`tut-scopes` για περισσότερες λεπτομέρειες): προσθέτει μόνο το όνομα του module ``fibo`` εκεί. Χρησιμοποιώντας το όνομα του module μπορείτε να αποκτήσετε πρόσβαση στις λειτουργίες::

source: If you intend to use a function often you can assign it to a local name::
el: Εάν σκοπεύετε να χρησιμοποιείτε συχνά μια συνάρτηση, μπορείτε να την αντιστοιχίσετε σε ένα τοπικό όνομα::

source: More on Modules
el: Περισσότερα για τα Modules

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
el: Ένα module μπορεί να περιέχει εκτελέσιμες δηλώσεις καθώς και ορισμούς συναρτήσεων. Αυτές οι δηλώσεις προορίζονται για την προετοιμασία του module. Εκτελούνται μόνο την *πρώτη* φορά που εμφανίζεται το όνομα του module σε μια δήλωση εισαγωγής. [#]_ (Εκτελούνται επίσης εάν το αρχείο εκτελείται ως script.)

source: Each module has its own private namespace, which is used as the global namespace by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
el: Κάθε module έχει τον δικό της ιδιωτικό namespace, ο οποίος χρησιμοποιείται ως global namespace από όλες τις συναρτήσεις που ορίζονται στο module. Έτσι, ο συντάκτης μιας ενότητας μπορεί να χρησιμοποιήσει global μεταβλητές στο module χωρίς να ανησυχεί για τυχαία conflicts με τις global μεταβλητές του χρήστη. Από την άλλη πλευρά, εάν ξέρετε τι κάνετε, μπορείτε να αγγίξετε τις global μεταβλητές ενός module με το ίδιο notation που χρησιμοποιείται για να αναφέρεται στις συναρτήσεις, ``modname.itemname``.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names, if placed at the top level of a module (outside any functions or classes), are added to the module's global namespace.
el: Τα modules μπορούν να εισάγουν άλλα modules. Είναι σύνηθες, αλλά δεν απαιτείται να τοποθετούνται όλες οι δηλώσεις :keyword:`import` στην αρχή μιας ενότητα (ή σεναρίου, για αυτό το θέμα). Τα ονόματα των modules που εισάγονται, εάν τοποθετούνται στο ανώτερο επίπεδο του ένα module (εκτός οποιωνδήποτε συναρτήσεων ή κλάσεων), προστίθενται στον global namespace του module.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's namespace. For example::
el: Υπάρχει μια παραλλαγή της δήλωσης :keyword:`import` που εισάγει ονόματα από ένα module απευθείας στον χώρο στα importing module's namespace. Για παράδειγμα::

source: This does not introduce the module name from which the imports are taken in the local namespace (so in the example, ``fibo`` is not defined).
el: Αυτό δεν εισάγει το όνομα ενός module από το οποίο λαμβάνονται οι εισαγωγές στο τοπικό namespace (αρά στο παράδειγμα, το ``fibo`` δεν ορίζεται).

source: There is even a variant to import all names that a module defines::
el: Υπάρχει ακόμη και μια παραλλαγή για την εισαγωγή όλων των ονομάτων που ορίζει μια ενότητα::

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
el: Αυτό εισάγει όλα τα ονόματα εκτός από αυτά που ξεκινούν με κάτω παύλα (``_``). Στις περισσότερες περιπτώσεις, οι προγραμματιστές Python δεν χρησιμοποιούν αυτήν την δυνατότητα , καθώς εισάγει ένα άγνωστο σύνολο ονομάτων στον interpreter, κρύβοντας πιθανώς κάποια πράγματα που έχετε ήδη ορίσει.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
el: Λάβετε υπόψη ότι γενικά η πρακτική της εισαγωγής ``*`` από ένα module ή ένα πακέτο αποδοκιμάζεται, καθώς προκαλεί συχνά κακώς αναγνώσιμο κώδικα. Ωστόσο, είναι εντάξει να τον χρησιμοποιήσετε για να αποθηκεύσετε την πληκτρολόγηση σε διαδραστικές περιόδους σύνδεσης.

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
el: Εάν το όνομα του module ακολουθείται από :keyword:`!as`, τότε το όνομα που ακολουθεί :keyword:`!as` συνδέεται απευθείας με το εισαγόμενο module.

source: This is effectively importing the module in the same way that ``import fibo`` will do, with the only difference of it being available as ``fib``.
el: Αυτό ουσιαστικά εισάγει το module με τον ίδιο τρόπο που θα κάνει το ``import fibo`` , με τη μόνη διαφορά ότι είναι διαθέσιμο ως ``fib``.

source: It can also be used when utilising :keyword:`from` with similar effects::
el: Μπορεί επίσης να χρησιμοποιηθεί όταν χρησιμοποιείτε :keyword:`from` με παρόμοια εφέ::

source: For efficiency reasons, each module is only imported once per interpreter session. Therefore, if you change your modules, you must restart the interpreter -- or, if it's just one module you want to test interactively, use :func:`importlib.reload`, e.g. ``import importlib; importlib.reload(modulename)``.
el: Για λόγους αποτελεσματικότητας, κάθε module εισάγεται μόνο μία φορά ανά περίοδο λειτουργίες του interpreter. Επομένως, εάν αλλάξετε τα modules σας, πρέπει να επανεκκινήσετε τον διερμηνέα -- ή, εάν είναι μόνο ένα module που θέλετε να δοκιμάσετε διαδραστικά, χρησιμοποιήστε το :func:`importlib.reload`, π.χ. ``import importlib; importlib.reload(modulename)``.

source: Executing modules as scripts
el: Εκτέλεση modules ως scripts

source: When you run a Python module with ::
el: Όταν εκτελείτε ένα Python module με::

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
el: ο κώδικας στο module θα εκτελεστεί, ακριβώς σαν να τον εισαγάγετε, αλλά με το ``name`` να έχει οριστεί σε ``"__main__"``. Αυτό σημαίνει ότι προσθέτοντας αυτόν τον κώδικα στο τέλος του module σας::

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file:
el: μπορείτε να κάνετε το αρχείο χρησιμοποιήσιμο ως script καθώς και ως module που μπορεί να εισαχθεί, επειδή ο κώδικας που αναλύει την γραμμή εντολών εκτελείται μόνο εάν το module εκτελείται ως το "main" αρχείο:

source: If the module is imported, the code is not run::
el: Εάν το module έχει εισαχθεί, ο κώδικας δεν εκτελείται::

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
el: Αυτό χρησιμοποιείται συχνά είτε για την παροχή ενός βολικού user interface σε ένα module, είτε για σκοπούς δοκιμής (η εκτέλεση του module ως script εκτελεί μια δοκιμαστική σουίτα).

source: The Module Search Path
el: Το Search Path του Module

source: When a module named :mod:`!spam` is imported, the interpreter first searches for a built-in module with that name. These module names are listed in :data:`sys.builtin_module_names`. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
el: Όταν εισάγετε ένα module με το όνομα :mod:`!spam`, ο interpreter αναζητά πρώτα ένα ενσωματωμένο module με αυτό το όνομα. Αυτά τα ονόματα των module παρατίθενται στο :data:`sys.builtin_module_names`. Εάν δεν βρεθεί, τότε αναζητά ένα αρχείο με το όνομα :file:`spam.py` σε μια λίστα καταλόγων που δίνονται από τη μεταβλητή :data:`sys.path`. Το :data:`sys.path` αρχικοποιείται από αυτές τις θέσεις:

source: The directory containing the input script (or the current directory when no file is specified).
el: Ο κατάλογος που περιέχει το input script (ή τον τρέχοντα κατάλογο όταν δεν έχει καθοριστεί αρχείο).

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
el: :envvar:`PYTHONPATH` (μια λίστα ονομάτων καταλόγου, με την ίδια σύνταξη με τη μεταβλητή του shell :envvar:`PATH`).

source: The installation-dependent default (by convention including a ``site-packages`` directory, handled by the :mod:`site` module).
el: Η προεπιλογή που εξαρτάται από την εγκατάσταση (κατά σύμβαση, συμπεριλαμβανομένου ενός καταλόγου ``site-packages``, που χειρίζεται το module :mod:`site`.

source: More details are at :ref:`sys-path-init`.
el: Περισσότερες λεπτομέρειες βρίσκονται στο :ref:`sys-path-init`.

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
el: Στα συστήματα αρχείων που υποστηρίζουν symlinks, ο κατάλογο που περιέχει το input script υπολογίζεται αφού ακολουθηθεί το symlink. Με άλλα λόγια, ο κατάλογος που περιέχει το symlink **δεν** προστίθεται στη διαδρομή αναζήτησης του module.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
el: Μετά την προετοιμασία, τα προγράμματα Python μπορούν να τροποποιήσουν το :data:`sys.path`. Ο κατάλογος που περιέχει το script που εκτελείται τοποθετείται στην αρχή της διαδρομής αναζήτησης , μπροστά από την τυπική διαδρομή της βιβλιοθήκης. Αυτό σημαίνει ότι τα scripts σε αυτόν τον κατάλογο θα είναι φορτωμένα αντί για τα modules με το ίδιο όνομα στον κατάλογο μιας βιβλιοθήκης. Αυτό είναι ένα σφάλμα, εκτός εάν προορίζεται η αντικατάσταση. Βλ. την ενότητα :ref:`tut-standardmodules` για περισσότερες πληροφορίες.

source: "Compiled" Python files
el: "Compiled" Python αρχεία

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
el: Για να επιταχύνει τη φόρτωση modules, η Python κάνει cache την compiled έκδοση κάθε module στον κατάλογο ``__pycache__`` κάτω από το όνομα :file:`module.{version}.pyc`, όπου η έκδοση κωδικοποιεί τη μορφή του compiled αρχείου∙ γενικά περιέχει τον αριθμό έκδοσης της Python. Για παράδειγμα, στην έκδοση CPython 3.3 η compiled έκδοση του spam.py θα αποθηκευτεί ως ``__pycache__/spam.cpython-33.pyc``. Αυτή η σύμβαση ονομασίας, επιτρέπει σε compiled modules από διαφορετικές εκδόσεις και διαφορετικές εκδόσεις της Python να συνυπάρχουν.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
el: Η Python ελέγχει την ημερομηνία τροποποίησης του πηγαίου έναντι της compiled έκδοσης για να δει εάν είναι ξεπερασμένη και χρειάζεται να γίνει compile ξανά. Αυτή είναι μια εντελώς αυτόματη διαδικασία. Επίσης, τα compiled modules είναι ανεξάρτητες από πλατφόρμα, επομένως η ίδια βιβλιοθήκη μπορεί να κοινοποιηθεί ανάμεσα σε συστήματα με διαφορετικές αρχιτεκτονικές.

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
el: Η Python δεν ελέγχει την cache σε δύο περιπτώσεις. Πρώτον, πάντα κάνει compile ξανά και δεν αποθηκεύει το αποτέλεσμα για το module που φορτώνεται απευθείας από τη γραμμή εντολών. Δεύτερον, δεν ελέγχει τη μνήμη cache εάν δεν υπάρχει το source module. Για να υποστηρίξετε μια διανομή χωρίς πηγαίο (compiled μόνο), το compiled module πρέπει να βρίσκεται στον source κατάλογο και δεν πρέπει να υπάρχει source module.

source: Some tips for experts:
el: Μερικές συμβουλές για ειδικούς:

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
el: Μπορείτε να χρησιμοποιήσετε τους switches :option:`-O` ή :option:`-OO` στην εντολή Python για να μειώσετε το μέγεθος ενός compiled module. Το ``-O`` switch αφαιρεί τις assert statements, το ``-OO`` switch αφαιρεί τόσο τα assert statements όσο και τις __doc__ συμβολοσειρές . Εφόσον ορισμένα προγράμματα μπορεί να βασίζονται στην ύπαρξη αυτών των διαθέσιμων, θα πρέπει να χρησιμοποιήσετε αυτήν την επιλογή μόνο εάν γνωρίζετε τι κάνετε. "Optimized" modules έχουν ένα ``opt-`` tag και είναι συνήθως μικρότερες. Οι μελλοντικές εκδόσεις μπορεί να αλλάξουν τα αποτελέσματα της βελτιστοποίησης.

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
el: Ένα πρόγραμμα δεν εκτελείται πιο γρήγορα όταν διαβάζεται από ένα αρχείο ``.pyc`` από ό,τι όταν διαβάζεται από ένα αρχείο ``.py``∙ το μόνο πράγμα που είναι πιο γρήγορο από τα αρχεία ``.pyc`` είναι η ταχύτητα με την οποία φορτώνονται.

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
el: Το module :mod:`compileall` μπορεί να δημιουργήσει αρχεία .pyc για όλα τα modules σε ένα κατάλογο.

source: There is more detail on this process, including a flow chart of the decisions, in :pep:`3147`.
el: Υπάρχουν περισσότερες λεπτομέρειες σχετικά με αυτή τη διαδικασία, συμπεριλαμβανομένου ενός διαγράμματος ροής των αποφάσεων, στο :pep:`3147`.

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
el: Η Python συνοδεύεται από μια βιβλιοθήκη standard modules, η οποία περιγράφεται σε ένα ξεχωριστό έγγραφο, την Αναφορά Βιβλιοθήκης Python ("Library Reference" hereafter). Ορισμένα modules είναι ενσωματωμένα στον interpreter∙ αυτές παρέχουν πρόσβαση σε λειτουργίες που δεν αποτελούν μέρος του πυρήνα της γλώσσας, αλλά εντούτοις είναι ενσωματωμένα, είτε για αποτελεσματικότητα είτε για την παροχή πρόσβασης σε πρωτόγονα στοιχεία του λειτουργικού συστήματος όπως οι κλήσεις συστήματος. Το σύνολο τέτοιων modules είναι μια επιλογή διαμόρφωσης που εξαρτάται επίσης από την υποκείμενη πλατφόρμα. Για παράδειγμα, το module :mod:`winreg` παρέχεται μόνο σε συστήματα Windows. Ένα συγκεκριμένο module που αξίζει κάποια προσοχή είναι το :mod:`sys`, το οποίο είναι ενσωματωμένο στον interpreter της Python. Οι μεταβλητές ``sys.ps1`` και ``sys.ps2`` ορίζουν τις συμβολοσειρές που χρησιμοποιούνται ως κύρια και δευτερεύοντα prompts::

source: These two variables are only defined if the interpreter is in interactive mode.
el: Αυτές οι δύο μεταβλητές ορίζονται μόνο εάν ο interpreter βρίσκεται σε διαδραστική λειτουργία.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
el: Η μεταβλητή ``sys.path`` είναι μια λίστα συμβολοσειρών που καθορίζει τη διαδρομή αναζήτησης του διερμηνέα για modules. Αρχικοποιείται σε μια προεπιλεγμένη διαδρομή που λαμβάνεται από τη μεταβλητή περιβάλλοντος :envvar:`PYTHONPATH`, ή από μια ενσωματωμένη προεπιλογή εάν το :envvar:`PYTHONPATH` δεν έχει οριστεί. Μπορείτε να το τροποποιήσετε χρησιμοποιώντας τυπικές λειτουργίες λίστας::

source: The :func:`dir` Function
el: Η συνάρτηση :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
el: Η ενσωματωμένη συνάρτηση :func:`dir` χρησιμοποιείται για να ανακαλύψει ποια ονόματα ορίζει ένα module. Επιστρέφει μια ταξινομημένη λίστα συμβολοσειρών::

source: Without arguments, :func:`dir` lists the names you have defined currently::
el: Χωρίς ορίσματα, η :func:`dir` παραθέτει τα ονόματα που έχετε ορίσει αυτήν τη στιγμή::

source: Note that it lists all types of names: variables, modules, functions, etc.
el: Λάβετε υπόψη ότι παραθέτει όλους τους τύπους ονομάτων: μεταβλητές, modules, συναρτήσεις, κ.λπ.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
el: Η :func:`dir` δεν παραθέτει τα ονόματα των ενσωματωμένων συναρτήσεων και μεταβλητών. Εάν θέλετε μια λίστα από αυτές, ορίζονται στην τυπική ενότητα :mod:`builtins`::

source: Packages
el: Πακέτα

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`!A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
el: Τα πακέτα είναι ένας τρόπος δόμησης του namespace του module χρησιμοποιώντας "dotted module names". Για παράδειγμα, το όνομα του module :mod:`!A.B` υποδηλώνει ένα submodule με όνομα ``B`` σε ένα πακέτο με όνομα ``A``. Ακριβώς όπως η χρήση των modules σώζει τους δημιουργούς διαφορετικών modules να ανησυχούν ο ένας για τα καθολικά ονόματα μεταβλητών του άλλου, η χρήση dotted module ονομάτων σώζει τους δημιουργούς των multi-module πακέτων όπως το NumbPY ή το Pillow από το να χρειάζεται να ανησυχούν ο ένας για τα module ονόματα του άλλου.
