Repository: pygreece/python-docs-gr
Catalog: tutorial/modules.po
Languages: el

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
el: Ας υποθέσουμε ότι θέλετε να σχεδιάσετε μια συλλογή από module (ένα "πακέτο") για τον ομοιόμορφο χειρισμό αρχείων ήχου και δεδομένων ήχου. Υπάρχουν πολλές διαφορετικές μορφές αρχείων ήχου (που συνήθως αναγνωρίζονται από την επέκτασή τους, για παράδειγμα: :file:`.wav`, :file:`.aiff`, :file:`.au`), επομένως μπορεί να χρειαστεί να δημιουργήσετε και να διατηρήσετε μια αυξανόμενη συλλογή λειτουργιών για τη μετατροπή μεταξύ των διαφόρων μορφών αρχείων. Υπάρχουν επίσης πολλές διαφορετικές λειτουργίες που μπορεί να θέλετε να εκτελέσετε σε δεδομένα ήχου (όπως μίξη, προσθήκη ηχούς, εφαρμογή μιας λειτουργίας ισοσταθμιστή, δημιουργία τεχνητού στερεοφωνικού εφέ), επομένως επιπλέον θα γράφετε μια ατελείωτη ροή από modules για να εκτελέσετε αυτές τις λειτουργίες. Ακολουθεί μια πιθανή δομή για το πακέτο σας (που εκφράζεται ως ιεραρχικό σύστημα αρχείων):

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
el: Κατά την εισαγωγή του πακέτου, η Python πραγματοποιεί αναζήτηση στους καταλόγους στο ``sys.path`` αναζητώντας τον υποκατάλογο του πακέτου.

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages (unless using a :term:`namespace package`, a relatively advanced feature). This prevents directories with a common name, such as ``string``, from unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
el: Τα :file:`__init__.py` αρχεία απαιτούνται για να κάνει την Python να αντιμετωπίζει του καταλόγου που περιέχουν το αρχείο ως πακέτα (εκτός εάν χρησιμοποιεί ένα :term:`namespace package`, ένα σχετικά προηγμένο χαρακτηριστικό). Αυτό αποτρέπει τους καταλόγους με κοινό όνομα, όπως π.χ. ως ``string``, από την ακούσια απόκρυψη έγκυρων modules που εμφανίζονται αργότερα στο path αναζήτησης του module. Στην απλούστερη περίπτωση, το :file:`__init__.py` μπορεί απλώς να είναι κενό αρχείο, αλλά μπορεί επίσης να εκτελέσει initialization κώδικα για το πακέτο ή να ορίσει την μεταβλητή ``__all__``, που περιγράφεται αργότερα.

source: Users of the package can import individual modules from the package, for example::
el: Οι χρήστες του πακέτου μπορούν να εισάγουν μεμονωμένα module από το πακέτο, για παράδειγμα::

source: This loads the submodule :mod:`!sound.effects.echo`. It must be referenced with its full name. ::
el: Αυτό φορτώνει το submodule :mod:`!sound.effects.echo`. Πρέπει να αναφέρεται με το πλήρες όνομά του. ::

source: An alternative way of importing the submodule is::
el: Ένα εναλλακτικός τρόπος για την εισαγωγή του submodule είναι::

source: This also loads the submodule :mod:`!echo`, and makes it available without its package prefix, so it can be used as follows::
el: Αυτό φορτώνει επίσης το submodule :mod:`!echo`, και την καθιστά διαθέσιμη χωρίς το πρόθεμα πακέτου, ώστε να μπορεί να χρησιμοποιηθεί ως εξής::

source: Yet another variation is to import the desired function or variable directly::
el: Μια άλλη παραλλαγή είναι η απευθείας εισαγωγή της επιθυμητής συνάρτησης ή μεταβλητής::

source: Again, this loads the submodule :mod:`!echo`, but this makes its function :func:`!echofilter` directly available::
el: Και πάλι, αυτό φορτώνει το submodule :mod:`!echo`, αλλά αυτό κάνει τη συνάρτηση της :func:`!echofilter` άμεσα διαθέσιμη::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
el: Λάβετε υπόψη ότι όταν χρησιμοποιείτε ``from package import item``, το στοιχείο μπορεί να είναι είτε submodule (ή υποπακέτο) του πακέτου ή κάποιο άλλο όνομα που ορίζεται στο πακέτο, όπως μια συνάρτηση, κλάση ή μεταβλητή. Η ``import`` δήλωση ελέγχει πρώτα εάν το στοιχείο έχει οριστεί στο πακέτο, εάν όχι, υποθέτει ότι είναι ένα module και επιχειρεί να το φορτώσει , αν δεν το βρει δημιουργεί η εξαίρεση :exc:`ImportError`.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
el: Αντίθετα, όταν χρησιμοποιείται σύνταξη όπως ``import item.subitem.subsubitem``, κάθε στοιχείο εκτός από αυτό το τελευταίο πρέπει να είναι πακέτο∙ το τελευταίο στοιχείο μπορεί να είναι ένα module ή ένα πακέτο αλλά δεν μπορεί να είναι μια κλάση ή συνάρτηση ή μεταβλητή που ορίζεται από προηγούμενο στοιχείο.

source: Importing \* From a Package
el: Εισάγοντας \* από ένα Πακέτο

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
el: Τώρα τι συμβαίνει όταν ο χρήστης γράφει ``from sound.effects import *``; Ιδανικά, θα ήλπιζε κανείς ότι αυτό θα βγει με κάποιο τρόπο στο σύστημα αρχείων, θα βρει κάποια submodules που υπάρχουν το πακέτο, και θα τα εισάγει όλα σε αυτό. Αυτό θα μπορούσε να πάρει πολύ χρόνο και η εισαγωγή submodules μπορεί να έχει ανεπιθύμητες παρενέργειες που θα έπρεπε να συμβούν όταν το submodule εισάγεται ρητά.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
el: Η μόνη λύση είναι να παρέχει ο συντάκτης του πακέτου ένα ρητό ευρετήριο του πακέτου. Η δήλωση :keyword:`import` χρησιμοποιεί την ακόλουθη σύμβαση: εάν ο κώδικας :file:`__init__.py` του πακέτου ορίζει μια λίστα με το όνομα ``__all__``, θεωρείται ότι είναι η λίστα με τα ονόματα των modules που θα πρέπει να εισαχθούν όταν συναντήσετε ``from package import *``. Είναι στην διακριτή ευχέρεια του συντάκτη του πακέτου να διατηρεί αυτή τη λίστα ενημερωμένη, όταν κυκλοφορήσει μια νέα έκδοση του πακέτου. Οι συντάκτες του πακέτου ενδέχεται επίσης να αποφασίσουν να μην το υποστηρίξουν, εάν δεν βλέπουν ότι χρησιμοποιείται η εισαγωγή του \* από το πακέτο τους. Για παράδειγμα το αρχείο :file:`sound/effects/__init__.py` θα μπορούσε να περιέχει τον ακόλουθο κώδικα::

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`!sound.effects` package.
el: Αυτό θα σήμαινε ότι ``from sound.effects import *`` θα εισαγάγει τα τρία submodules με το όνομα του πακέτου :mod:`!sound.effects`.

source: Be aware that submodules might become shadowed by locally defined names. For example, if you added a ``reverse`` function to the :file:`sound/effects/__init__.py` file, the ``from sound.effects import *`` would only import the two submodules ``echo`` and ``surround``, but *not* the ``reverse`` submodule, because it is shadowed by the locally defined ``reverse`` function::
el: Λάβετε υπόψη ότι τα submodules ενδέχεται να σκιάζονται από τοπικά καθορισμένα ονόματα. Για παράδειγμα, εάν προσθέσατε μια ``reverse`` συνάρτηση στο αρχείο :file:`sound/effects/__init__.py`, το ``from sound.effects import *`` θα εισαγάγει μόνο τα δύο submodules ``echo`` και ``surround``, αλλά *όχι* το submodule ``reverse``, επειδή επισκιάζεται από την τοπικά καθορισμένη συνάρτηση ``reverse``::

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`!sound.effects` into the current namespace; it only ensures that the package :mod:`!sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
el: Εάν δεν έχει οριστεί το ``__all__``, η δήλωση ``from sound.effects import *`` *δεν* εισάγει όλα τα submodules από το πακέτο :mod:`!sound.effects` στο τρέχων namespace∙ διασφαλίζει μόνο ότι το πακέτο :mod:`!sound.effects` έχει εισαχθεί (ενδεχομένως να εκτελείται οποιοσδήποτε κωδικός προετοιμασίας στο στο :file:`__init__.py`) και στη συνέχεια εισάγει οποιαδήποτε ονόματα ορίζονται στο πακέτο. Αυτό περιλαμβάνει τυχόν ονόματα που ορίζονται (και submodules που έχουν φορτωθεί ρητά) από το :file:`__init__.py`. Περιλαμβάνει επίσης τυχόν submodules του πακέτου που φορτώθηκαν ρητά από προηγούμενες δηλώσεις :keyword:`import`. Σκεφτείτε αυτόν τον κώδικα::

source: In this example, the :mod:`!echo` and :mod:`!surround` modules are imported in the current namespace because they are defined in the :mod:`!sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
el: Σε αυτό το παράδειγμα, τα modules :mod:`!echo` και :mod:`!surround` εισάγονται στο τρέχον namespace επειδή ορίζονται στο πακέτο :mod:`!sound.effects`όταν η δήλωση ``from...import`` εκτελείται. (Αυτό λειτουργεί επίσης όταν ορίζεται το ``__all__``).

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
el: Αν και ορισμένα modules έχουν σχεδιαστεί για να εξάγουν μόνο ονόματα που ακολουθούν ορισμένα μοτίβα όταν χρησιμοποιείτε το ``import *``, εξακολουθεί να θεωρείται κακή πρακτική στον κώδικα παραγωγής.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
el: Θυμηθείτε, δεν υπάρχει τίποτα κακό με τη χρήση του ``from package import specific_submodule``! Στην πραγματικότητα, αυτή είναι η προτεινόμενη σημείωση, εκτός εάν το module εισαγωγής χρειάζεται να χρησιμοποιήσει submodules με το ίδιο όνομα από διαφορετικά πακέτα.

source: Intra-package References
el: Intra-package αναφορές

source: When packages are structured into subpackages (as with the :mod:`!sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`!sound.filters.vocoder` needs to use the :mod:`!echo` module in the :mod:`!sound.effects` package, it can use ``from sound.effects import echo``.
el: Όταν τα πακέτα είναι δομημένα σε υποπακέτα (όπως με το πακέτο :mod:`!sound` στο παράδειγμα), μπορείτε να χρησιμοποιήσετε απόλυτες εισαγωγές για να αναφερθείτε σε submodules αδερφών πακέτων. Για παράδειγμα, εάν το module :mod:`!sound.filters.vocoder` πρέπει να χρησιμοποιήσει το module :mod:`!echo` στο πακέτο :mod:`!sound.effects` , μπορεί να χρησιμοποιήσει το ``from sound.effects import echo``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`!surround` module for example, you might use::
el: Μπορείτε επίσης να γράψετε σχετικές εισαγωγές, με τη φόρμα ``from module import name`` της δήλωσης εισαγωγής. Αυτές οι εισαγωγές χρησιμοποιούν leading dots για να υποδείξουν τα τρέχοντα και γονικά πακέτα που εμπλέκονται στη σχετική εισαγωγή. Από το :mod:`!surround` module για παράδειγμα, μπορεί να χρησιμοποιήσετε::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
el: Λάβετε υπόψη ότι οι σχετικές εισαγωγές βασίζονται στο όνομα του τρέχοντος module. Επειδή το όνομα του κύριου module είναι πάντα ``"__main__"``, τα modules που προορίζονται για χρήση ως κύριο module μιας εφαρμογής Python πρέπει πάντα να χρησιμοποιούν απόλυτες εισαγωγές.

source: Packages in Multiple Directories
el: Πακέτα σε Πολλαπλούς Καταλόγους

source: Packages support one more special attribute, :attr:`__path__`. This is initialized to be a list containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
el: Τα πακέτα υποστηρίζουν ένα ακόμη ειδικό χαρακτηριστικό, :attr:`__path__`. Αυτό έχει αρχικοποιηθεί ώστε να είναι μια λίστα που περιέχει το όνομα του καταλόγου που το :file:`__init__.py` του πακέτου πριν από την εκτέλεση του κώδικα σε αυτό το αρχείο. Αυτή η μεταβλητή μπορεί να τροποποιηθεί, αυτό επηρεάζει τις μελλοντικές αναζητήσεις για modules και υποπακέτα που περιέχονται στο πακέτο.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
el: Ενώ αυτή η δυνατότητα δεν χρειάζεται συχνά, μπορεί να χρησιμοποιηθεί για την επέκταση του συνόλου των modules που βρίσκονται σε ένα πακέτο.

source: Footnotes
el: Υποσημειώσεις

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition adds the function name to the module's global namespace.
el: Στην πραγματικότητα, οι ορισμοί συναρτήσεων είναι επίσης 'statements' που 'εκτελούνται'∙ η εκτέλεση ενός ορισμού συνάρτησης σε επίπεδο module προσθέτει το όνομα της συνάρτησης στον καθολικό namespace του module.

source: search
el: αναζήτηση
