Repository: pygreece/python-docs-gr
Catalog: tutorial/venv.po
Languages: el

source: Virtual Environments and Packages
el: Εικονικά Περιβάλλοντα και πακέτα

source: Introduction
el: Εισαγωγή

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
el: Οι εφαρμογές Python συχνά χρησιμοποιούν πακέτα και modules που δεν αποτελούν μέρος της τυπικής βιβλιοθήκης. Οι εφαρμογές μερικές φορές χρειάζονται μια συγκεκριμένη έκδοση μιας βιβλιοθήκης, επειδή η εφαρμογή μπορεί να απαιτεί την επιδιόρθωση ενός συγκεκριμένου σφάλματος ή επειδή η εφαρμογή έχει γραφεί χρησιμοποιώντας μια ξεπερασμένη έκδοση της διεπαφής της βιβλιοθήκης.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
el: Αυτό σημαίνει ότι μπορεί να μην είναι δυνατό για μία εγκατάσταση Python να πληροί τις απαιτήσεις κάθε εφαρμογής. Εάν η εφαρμογή A χρειάζεται την έκδοση 1.0 ενός συγκεκριμένου module, αλλά η εφαρμογή B χρειάζεται την έκδοση 2.0, τότε οι απαιτήσεις βρίσκονται σε σύγκρουση και η εγκατάσταση της έκδοσης 1.0 ή 2.0 θα αφήσει μια εφαρμογή ανίκανη να εκτελεστεί.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
el: Η λύση για αυτό το πρόβλημα είναι να δημιουργήσετε ένα :term:`virtual environment`, ένα αυτόνομο δέντρο καταλόγου που περιέχει μια εγκατάσταση Python για μια συγκεκριμένη έκδοση της Python, καθώς και έναν αριθμό πρόσθετων πακέτων.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
el: Διαφορετικές εφαρμογές μπορούν στη συνέχεια να χρησιμοποιούν διαφορετικά εικονικά περιβάλλοντα. Για να επιλύσετε το προηγούμενο παράδειγμα αντικρουόμενων απαιτήσεων, η εφαρμογή A μπορεί να έχει το δικό της εικονικό περιβάλλον με εγκατεστημένη την έκδοση 1.0 ενώ η εφαρμογή B έχει άλλο εικονικό περιβάλλον με την έκδοση 2.0. Εάν η εφαρμογή B απαιτεί αναβάθμιση βιβλιοθήκης στην έκδοση 3.0, αυτό δεν θα επηρεάσει το περιβάλλον της εφαρμογής A.

source: Creating Virtual Environments
el: Δημιουργία εικονικών περιβάλλοντων

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will usually install the most recent version of Python that you have available. If you have multiple versions of Python on your system, you can select a specific Python version by running ``python3`` or whichever version you want.
el: Το module που χρησιμοποιείται για τη δημιουργία και τη διαχείριση εικονικών περιβαλλόντων ονομάζεται :mod:`venv`. Το :mod:`venv` θα εγκαταστήσει συνήθως την πιο πρόσφατη έκδοση της Python που έχετε διαθέσιμη. Εάν έχετε πολλές εκδόσεις της Python στο σύστημά σας, μπορείτε να επιλέξετε μια συγκεκριμένη έκδοση Python εκτελώντας το ``python3`` ή όποια έκδοση θέλετε.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
el: Για να δημιουργήσετε ένα εικονικό περιβάλλον, αποφασίστε έναν φάκελο όπου θέλετε να το τοποθετήσετε και εκτελέστε το module :mod:`venv` ως ένα script με τη διαδρομή καταλόγου::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
el: Αυτό θα δημιουργήσει τον κατάλογο ``tutorial-env`` εάν δεν υπάρχει, και επίσης θα δημιουργήσει καταλόγους μέσα σε αυτόν που περιέχουν ένα αντίγραφο του interpreter της Python και διάφορα υποστηρικτικά αρχεία.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
el: Μια κοινή τοποθεσία καταλόγου για ένα εικονικό περιβάλλον είναι ``.venv``. Αυτό το όνομα κρατά τον κατάλογο συνήθως κρυμμένο στο shell σας και συνεπώς μακριά από τη διαδρομή, ενώ του δίνει ένα όνομα που εξηγεί γιατί υπάρχει ο κατάλογος. Αποτρέπει επίσης τη σύγκρουση με αρχεία ορισμού μεταβλητών περιβάλλοντος ``.env`` που υποστηρίζουν ορισμένα εργαλεία.

source: Once you've created a virtual environment, you may activate it.
el: Μόλις δημιουργήσετε ένα εικονικό περιβάλλον, μπορεί να το ενεργοποιήσετε.

source: On Windows, run::
el: Σε Windows, εκτελέστε::

source: On Unix or MacOS, run::
el: Σε Unix ή MacOS, εκτελέστε::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
el: (Αυτό το script είναι γραμμένο για το bash shell. Εάν χρησιμοποιείτε τα shells :program:`csh` ή :program:`fish`, υπάρχουν εναλλακτικά scripts που θα πρέπει να χρησιμοποιούνται αντί αυτών, όπως ``activate.csh`` και ``activate.fish``.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
el: Η ενεργοποίηση του εικονικού περιβάλλοντος θα αλλάξει το prompt του shell σας για να δείξει ποιο εικονικό περιβάλλον χρησιμοποιείτε και θα τροποποιήσει το περιβάλλον έτσι ώστε η εκτέλεση της ``python`` να σας δώσει τη συγκεκριμένη έκδοση και εγκατάσταση της Python. Για παράδειγμα:

source: To deactivate a virtual environment, type::
el: Για να απενεργοποιήσετε ένα εικονικό περιβάλλον, πληκτρολογήστε::

source: into the terminal.
el: μέσα στο terminal.

source: Managing Packages with pip
el: Διαχείριση Πακέτων με το pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
el: Μπορείτε να εγκαταστήσετε, να αναβαθμίσετε και να αφαιρέσετε πακέτα χρησιμοποιώντας ένα πρόγραμμα που ονομάζεται :program:`pip`. Από προεπιλογή το ``pip`` θα εγκαταστήσει πακέτα από το `Python Package Index <https://pypi.org>`_. Εσείς μπορείτε να περιηγηθείτε στο Python Package Index μεταβαίνοντας σε αυτό στο πρόγραμμα περιήγησης σας.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
el: Το ``pip`` έχει έναν αριθμό υποεντολών: "install", "uninstall", "freeze", κ.λπ. (Συμβουλευτείτε τον οδηγό :ref:`installing-index` για πλήρη τεκμηρίωση για το ``pip``.)

source: You can install the latest version of a package by specifying a package's name:
el: Μπορείτε να εγκαταστήσετε την τελευταία έκδοση ενός πακέτου προσδιορίζοντας ένα όνομα ενός πακέτου:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
el: Μπορείτε επίσης να εγκαταστήσετε μια συγκεκριμένη έκδοση ενός πακέτου δίνοντας το όνομα του πακέτου ακολουθούμενο από ``==`` και τον αριθμό έκδοσης:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
el: Εάν εκτελέσετε ξανά αυτήν την εντολή, το ``pip`` θα παρατηρήσει ότι η ζητούμενη έκδοση είναι ήδη εγκατεστημένη και δεν θα κάνει τίποτα. Μπορείτε να δώσετε έναν διαφορετικό αριθμός έκδοσης για να λάβετε αυτήν την έκδοση ή μπορείτε να εκτελέσετε το ``python -m pip install --upgrade`` για να αναβαθμίσετε το πακέτο στην πιο πρόσφατη έκδοση:

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
el: Το ``python -m pip uninstall`` συνοδευόμενο από ένα ή περισσότερα ονόματα πακέτου θα διαγράψει τα πακέτα από το εικονικό περιβάλλον.

source: ``python -m pip show`` will display information about a particular package:
el: Το ``python -m pip show`` θα εμφανίσει πληροφορίες σχετικά με ένα συγκεκριμένο πακέτο:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
el: Το ``python -m pip list`` θα εμφανίσει όλα τα πακέτα που είναι εγκατεστημένα στο εικονικό περιβάλλον:

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
el: Το ``python -m pip freeze`` θα δημιουργήσει μια παρόμοια λίστα με τα εγκατεστημένα πακέτα, αλλά η έξοδος χρησιμοποιεί τη μορφή που αναμένει το ``python -m pip install``. Μια κοινή σύμβαση είναι να τοποθετήσετε αυτήν τη λίστα σε ένα ``requirements.txt`` αρχείο:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
el: Το ``requirements.txt`` μπορεί στη συνέχεια να δημοσιευθεί στον έλεγχο έκδοσης και να διατεθεί ως μέρος μιας εφαρμογής. Οι χρήστες μπορούν στη συνέχεια να εγκαταστήσουν όλα τα απαραίτητα πακέτα με το ``install -r``:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the `Python packaging user guide`_.
el: Το ``pip`` έχει πολλές περισσότερες επιλογές. Συμβουλευτείτε τον οδηγό :ref:`installing-index` για πλήρη τεκμηρίωση για το ``pip``. Όταν έχετε γράψει ένα πακέτο και θέλετε να το κάνετε διαθέσιμο στο Ευρετήριο Πακέτων Python, συμβουλευτείτε τον `οδηγό χρήσης packaging Python`_.
