Repository: pygreece/python-docs-gr
Catalog: tutorial/whatnow.po
Languages: el

source: What Now?
el: Και τώρα τι;

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
el: Η ανάγνωση αυτού του διδακτικού υλικού πιθανότατα ενίσχυσε το ενδιαφέρον σας για τη χρήση της Python --- θα πρέπει να είστε πρόθυμοι να εφαρμόσετε την Pyhton για την επίλυση των προβλημάτων του πραγματικού σας κόσμου. Που πρέπει να πάτε για να μάθετε περισσότερα;

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
el: Αυτό το διδακτικό υλικό είναι μέρος του συνόλου τεκμηρίωσης της Python. Μερικά άλλα έγγραφα του συνόλου είναι:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
el: Θα πρέπει να περιηγηθείτε σε αυτό το εγχειρίδιο, το οποίο παρέχει πλήρες (αν και συνοπτικό) υλικό σχετικά με τους τύπους, τις συναρτήσεις, και τα modules στην standard βιβλιοθήκη. Η standard διανομή Python περιλαμβάνει *πολύ* πρόσθετο κώδικα. Υπάρχουν modules για ανάγνωση ηλεκτρονικού γραμματοκιβωτίου Unix, ανάκτηση εγγράφων μέσω HTTP, δημιουργία τυχαίων αριθμών, ανάλυση επιλογών γραμμής εντολών, συμπίεση δεδομένων και πολλές εργασίες. Το Skimming μέσω της βιβλιοθήκης θα σας δώσει μια ιδέα για το τι είναι διαθέσιμο.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
el: :ref:`installing-index` εξηγεί πως να εγκαταστήσετε πρόσθετα modules γραμμένα από άλλους χρήστες Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
el: :ref:`reference-index`: Μια λεπτομερής εξήγηση της σύνταξης και της σημασιολογίας. Είναι βαριά ανάγνωση, αλλά είναι χρήσιμο ως πλήρης οδηγός για την ίδια τη γλώσσα.

source: More Python resources:
el: Περισσότερα Βοηθήματα για Python:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
el: https://www.python.org: Ο κύριος ιστότοπος της Python. Περιέχει κώδικα, τεκμηρίωση, και δείκτες που σχετίζονται με την Python στο web.

source: https://docs.python.org: Fast access to Python's documentation.
el: https://docs.python.org: Γρήγορη πρόσβαση στην τεκμηρίωση της Python.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
el: https://pypi.org: Το ευρετήριο Πακέτων Python, που προηγουμένως ονομαζόταν επίσης Τυροκομείο [#]_, είναι ένα ευρετήριο Python modules που έχουν δημιουργηθεί από χρήστες που είναι διαθέσιμα για λήψη. Μόλις ξεκινήσετε την κυκλοφορία του κώδικα, μπορείτε να τον καταχωρήσετε εδώ για το βρουν άλλοι.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
el: https://code.activestate.com/recipes/langs/python/: Το Python Cookbook είναι μια αρκετά μεγάλη συλλογή παραδειγμάτων κώδικα, μεγαλύτερα modules και χρήσιμα scripts. Ιδιαίτερα αξιοσημείωτες συνεισφορές συλλέγονται σε ένα βιβλίο με τίτλο Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
el: https://pyvideo.org συλλέγει συνδέσμους προς βίντεο που σχετίζονται με την Python από συνέδρια και συναντήσεις ομάδων χρηστών.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
el: https://scipy.org: Το έργο Scientific Python περιλαμβάνει modules για γρήγορους υπολογισμούς και χειρισμούς πινάκων συν μια σειρά από πακέτα για πράγματα όπως η γραμμική άλγεβρα, οι μετασχηματισμοί Fourier, οι μη γραμμικοί λύτες, οι κατανομές τυχαίνω αριθμών, η στατιστική ανάλυση και τα λοιπά παρόμοια.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
el: Για ερωτήσεις και αναφορές προβλημάτων που σχετίζονται με Python, μπορείτε να δημοσιεύσετε στην ομάδα συζήτησης :newsgroup:`comp.lang.python`, ή να τις στείλετε στη λίστα αλληλογραφίας στην διεύθυνση python-list@python.org. Η ομάδα συζήτησης και η λίστα αλληλογραφίας είναι gatewayed , έτσι ώστε τα μηνύματα που δημοσιεύονται στο ένα θα προωθούνται αυτόματα στο άλλο. Υπάρχουν εκατοντάδες αναρτήσεις την ημέρα, που κάνουν (και απαντούν) ερωτήσεις, προτείνουν νέες δυνατότητες και ανακοινώνουν νέα modules. Τα αρχεία της λίστα αλληλογραφίας είναι διαθέσιμα στη διεύθυνση https://mail.python.org/pipermail/.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
el: Πριν από τη δημοσίευση, φροντίστε να ελέγξετε τη λίστα με :ref:`Frequently Asked Questions <faq-index>` (σε συντομογραφία FAQ). Οι FAQ ερωτήσεις απαντούν σε πολλές από τις ερωτήσεις που εμφανίζονται ξανά και ξανά και μπορεί να περιέχουν ήδη τη λύση για το πρόβλημά σας.

source: Footnotes
el: Υποσημειώσεις

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
el: Το "Cheese Shop" είναι ένα σκίτσο των Monty Python: ένα πελάτης μπαίνει σε ένα τυροκομείο αλλά ό,τι τυρί ζητήσει, ο υπάλληλος λέει ότι δεν υπάρχει.
