Repository: pygreece/python-docs-gr
Catalog: license.po
Languages: el

source: History and License
el: Ιστορία και Άδεια

source: History of the software
el: Η ιστορία του λογισμικού

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
el: Η Python δημιουργήθηκε στις αρχές του 1990 από τον Guido van Rossum στο Stichting Mathematisch Centrum (CWI, βλ. https://www.cwi.nl/) στην Ολλανδία ως διάδοχος μια γλώσσας που ονομάζεται ABC. Ο Guido παραμένει ο κύριος συγγραφέας της Python, παρόλα αυτά περιλαμβάνει συνεισφορές και από άλλα άτομα.

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see https://www.cnri.reston.va.us/) in Reston, Virginia where he released several versions of the software.
el: Το 1995, ο Guido συνέχισε το έργο του για την Python στο Corporation for National Research Initiatives (CNRI, βλ. https://www.cnri.reston.va.us/) στο Reston της Virginia, όπου κυκλοφόρησε πολλές εκδόσεις του λογισμικού.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations (now Zope Corporation; see https://www.zope.org/). In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation is a sponsoring member of the PSF.
el: Τον Μάιο του 2000, ο Guido και η βασική ομάδα ανάπτυξης της Python μετακόμισαν στο BeOpen.com για να σχηματίσουν την ομάδα BeOpen PythonLabs. Τον Οκτώβριο του ίδιου έτους, η ομάδα του PythonLabs μετακόμισε στην Digital Creations (τώρα Zope Corporation, βλ. https://www.zope.org/). Το 2001, το Python Software Foundation (PSF, βλ. https://www.python.org/psf/) δημιουργήθηκε ως ένας μη κερδοσκοπικός οργανισμός με στόχο να κατέχει την πνευματική ιδιοκτησία που σχετίζεται με την Python. Η Zope Corporation είναι μέλος-χορηγός του PSF.

source: All Python releases are Open Source (see https://opensource.org/ for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
el: Όλες οι εκδόσεις της Python είναι Ανοιχτού Κώδικα (βλ. https://opensource.org/ για τον ορισμό του Ανοιχτού Κώδικα). Ιστορικά οι περισσότερες, αλλά όχι όλες, εκδόσεις της Python ήταν επίσης συμβατές με την άδεια GPL: ο παρακάτω πίνακας συνοψίζει τις διάφορες εκδόσεις.

source: Release
el: Έκδοση

source: Derived from
el: Προερχόμενη από

source: Year
el: Έτος

source: Owner
el: Ιδιοκτησία

source: GPL compatible?
el: Συμβατότητα GPL;

source: 0.9.0 thru 1.2
el: 0.9.0 έως 1.2

source: n/a
el: δ/υ

source: yes
el: ναι

source: 1.3 thru 1.5.2
el: 1.3 έως 1.5.2

source: no
el: όχι

source: 2.2 and above
el: 2.2 και πάνω

source: 2001-now
el: 2001-σήμερα

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
el: Η συμβατότητα με GPL δεν σημαίνει ότι διανέμεται η Python κάτω από την άδεια GPL. Όλες οι άδειες της Python, σε αντίθεση με την GPL, σας επιτρέπουν να διανείμετε μια τροποποιημένη έκδοση χωρίς να κάνετε τις αλλαγές σας, ανοιχτού κώδικα. Οι άδειες με συμβατότητα GPL καθιστούν δυνατό τον συνδυασμό της Python με άλλο λογισμικό που κυκλοφορεί με βάσει της GPL, ενώ οι άλλες όχι.

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
el: Χάρη, στους πολλούς εξωτερικούς εθελοντές που εργάστηκαν κάτω από τις οδηγίες του Guido, αυτές οι εκδόσεις έγιναν εφικτές.

source: Terms and conditions for accessing or otherwise using Python
el: Όροι και προϋποθέσεις για την πρόσβαση ή την χρήση της Python με άλλους τρόπους

source: Python software and documentation are licensed under the :ref:`PSF License Agreement <PSF-license>`.
el: To λογισμικό και η τεκμηρίωση της Python αδειοδοτούνται σύμφωνα με :ref:` Σύμβαση άδειας χρήσης PSF <PSF-license>`.

source: Starting with Python 3.8.6, examples, recipes, and other code in the documentation are dual licensed under the PSF License Agreement and the :ref:`Zero-Clause BSD license <BSD0>`.
el: Ξεκινώντας από την Python 3.8.6, παραδείγματα, συνταγές και ο άλλος κώδικας στην τεκμηρίωση έχουν διπλή άδεια χρήσης, βάση της Άδεια Χρήσης PSF και της :ref: `Zero-Clause BSD άδεια <BSD0>`.

source: Some software incorporated into Python is under different licenses. The licenses are listed with code falling under that license. See :ref:`OtherLicenses` for an incomplete list of these licenses.
el: Κάποιο λογισμικό που είναι ενσωματωμένο στην Python είναι υπό διαφορετικές άδειες χρήσης. Οι άδειες παρατίθενται με κώδικα που εμπίπτει σε αυτήν την άδεια. Δείτε :ref:`OtherLicenses` για μια ελλιπή λίστα αυτών των αδειών.

source: PSF LICENSE AGREEMENT FOR PYTHON |release|
el: ΣΥΜΦΩΝΙΑ ΑΔΕΙΑΣ PSF ΓΙΑ ΤΗΝ PYTHON |release|

source: BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0
el: ΣΥΜΦΩΝΙΑ ΑΔΕΙΑΣ BEOPEN.COM ΓΙΑ PYTHON 2.0

source: BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1
el: ΣΥΜΦΩΝΙΑ ΑΔΕΙΑΣ ΑΝΟΙΧΤΟΥ ΚΩΔΙΚΑ BEOPEN PYTHON ΕΚΔΟΣΗ 1

source: CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1
el: ΣΥΜΦΩΝΙΑ ΑΔΕΙΑΣ CNRI ΓΙΑ PYTHON 1.6.1

source: CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2
el: ΣΥΜΦΩΝΙΑ ΑΔΕΙΑΣ CWI ΓΙΑ PYTHON 0.9.0 ΕΩΣ 1.2

source: ZERO-CLAUSE BSD LICENSE FOR CODE IN THE PYTHON |release| DOCUMENTATION
el: ZERO-CLAUSE BSD ΑΔΕΙΑ ΓΙΑ ΤΟΝ ΚΩΔΙΚΑ ΣΤΗΝ ΤΕΚΜΗΡΙΩΣΗ ΤΗΣ PYTHON |release|

source: Licenses and Acknowledgements for Incorporated Software
el: Άδειες και Ευχαριστίες για Ενσωματωμένο Λογισμικό

source: This section is an incomplete, but growing list of licenses and acknowledgements for third-party software incorporated in the Python distribution.
el: Αυτή η ενότητα είναι μια ημιτελής, αλλά αυξανόμενη λίστα αδειών και ευχαριστιών για λογισμικό τρίτων, που ενσωματώνεται στην διανομή της Python.

source: The :mod:`!_random` C extension underlying the :mod:`random` module includes code based on a download from http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. The following are the verbatim comments from the original code::
el: Η επέκταση :mod:`!_random` C που βρίσκεται κάτω από την ενότητα :mod:`random` περιλαμβάνει έναν κώδικα με βάση μια λήψη από http://www.math.sci.hiroshima-u.ac.jp/~m-mat/ MT/MT2002/emt19937ar.html. Ακολουθούν κατά λέξη τα σχόλια από το αρχικό κώδικα::

source: The :mod:`socket` module uses the functions, :c:func:`!getaddrinfo`, and :c:func:`!getnameinfo`, which are coded in separate source files from the WIDE Project, https://www.wide.ad.jp/. ::
el: Η ενότητα :mod:`socket` χρησιμοποιεί τις συναρτήσεις, :c:func:`!getaddrinfo`, και :c:func:`!getnameinfo`, τα οποία έχουν υλοποιηθεί σε διαφορετικά αρχεία από το WIDE Έργο, https://www.wide.ad.jp/. ::

source: Asynchronous socket services
el: Ασύγχρονες socket υπηρεσίες

source: The :mod:`!test.support.asynchat` and :mod:`!test.support.asyncore` modules contain the following notice::
el: Οι ενότητες :mod:`!test.support.asynchat` και :mod:`!test.support.asyncore` περιέχουν την παρακάτω ειδοποίηση::

source: Cookie management
el: Διαχείριση Cookie

source: The :mod:`http.cookies` module contains the following notice::
el: Η ενότητα :mod:`http.cookies` περιέχει την παρακάτω ειδοποίηση::

source: Execution tracing
el: Ανίχνευση εκτέλεσης

source: The :mod:`trace` module contains the following notice::
el: Η ενότητα :mod:`trace` περιέχει την παρακάτω ειδοποίηση::

source: UUencode and UUdecode functions
el: Συναρτήσεις UUencode και UUdecode

source: The :mod:`uu` module contains the following notice::
el: Η ενότητα :mod:`uu` περιέχει την παρακάτω ειδοποίηση::

source: XML Remote Procedure Calls
el: Κλήσεις Απομακρυσμένης Διαδικασίας XML

source: The :mod:`xmlrpc.client` module contains the following notice::
el: Η ενότητα :mod:`xmlrpc.client` περιέχει την παρακάτω ειδοποίηση::

source: The :mod:`!test.test_epoll` module contains the following notice::
el: Η ενότητα :mod:`!test.test_epoll` περιέχει την παρακάτω ειδοποίηση::

source: Select kqueue
el: Επιλογή kqueue

source: The :mod:`select` module contains the following notice for the kqueue interface::
el: Η ενότητα :mod:`select` περιέχει την παρακάτω ειδοποίηση για την kqueue διεπαφή::

source: The file :file:`Python/pyhash.c` contains Marek Majkowski' implementation of Dan Bernstein's SipHash24 algorithm. It contains the following note::
el: Το αρχείο :file:`Python/pyhash.c` περιέχει την υλοποίηση του Marek Majkowski του αλγορίθμου τού Dan Bernstein, SipHash24. Αυτό περιέχει την παρακάτω σημείωση::

source: strtod and dtoa
el: strtod και dtoa

source: The file :file:`Python/dtoa.c`, which supplies C functions dtoa and strtod for conversion of C doubles to and from strings, is derived from the file of the same name by David M. Gay, currently available from https://web.archive.org/web/20220517033456/http://www.netlib.org/fp/dtoa.c. The original file, as retrieved on March 16, 2009, contains the following copyright and licensing notice::
el: Το αρχείο :file:`Python/dtoa.c`, που παρέχει τις συναρτήσεις dtoa και strtod της C για μετατροπή των C doubles προς και από strings, προέρχεται από το ομώνυμο αρχείο του David M. Gay, προς το παρόν διαθέσιμο από https://web.archive.org/web/20220517033456/http://www.netlib.org/fp/dtoa.c. Το αρχικό αρχείο, όπως ανακτήθηκε στις 16 Μαρτίου, 2009, περιέχει τα ακόλουθα πνευματικά δικαιώματα και την ειδοποίηση αδειοδότησης::

source: The modules :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` use the OpenSSL library for added performance if made available by the operating system. Additionally, the Windows and macOS installers for Python may include a copy of the OpenSSL libraries, so we include a copy of the OpenSSL license here. For the OpenSSL 3.0 release, and later releases derived from that, the Apache License v2 applies::
el: Οι μονάδες :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` χρησιμοποιούν την βιβλιοθήκη OpenSSL για επιπλέον απόδοση, εάν διατίθενται από το λειτουργικό σύστημα. Επιπλέον, τα προγράμματα εγκατάστασης για την Python για Windows και macOS, ενδέχεται να περιλαμβάνουν ένα αντίγραφο των βιβλιοθηκών OpenSSL, επομένως συμπεριλαμβάνουμε ένα αντίγραφο της άδειας OpenSSL εδώ. Για την έκδοση OpenSSL 3.0 και για νεότερες εκδόσεις που προέρχονται από αυτή, ισχύει η άδεια Apache v2::

source: The :mod:`pyexpat <xml.parsers.expat>` extension is built using an included copy of the expat sources unless the build is configured ``--with-system-expat``::
el: Η επέκταση :mod:`pyexpat <xml.parsers.expat>` δημιουργείται χρησιμοποιώντας ένα συμπεριλαμβανόμενο αντίγραφο των πηγών expat, εκτός εάν η έκδοση έχει την ρύθμιση ``--with-system-expat``::

source: The :mod:`!_ctypes` C extension underlying the :mod:`ctypes` module is built using an included copy of the libffi sources unless the build is configured ``--with-system-libffi``::
el: Η επέκταση της C :mod:`!_ctypes` που βρίσκεται κάτω από την ενότητα :mod:`ctypes` δημιουργείται χρησιμοποιώντας ένα συμπεριλαμβανόμενο αντίγραφο των πηγών libffi, εκτός εάν η έκδοση έχει την ρύθμιση ``--with-system-libffi``::

source: The :mod:`zlib` extension is built using an included copy of the zlib sources if the zlib version found on the system is too old to be used for the build::
el: Η επέκταση :mod:`zlib` δημιουργείται χρησιμοποιώντας ένα συμπεριλαμβανόμενου αντίγραφο των πηγών zlib, εάν η έκδοση του zlib που βρίσκεται στο σύστημα είναι πολύ παλιά για να χρησιμοποιηθεί για την κατασκευή::

source: The implementation of the hash table used by the :mod:`tracemalloc` is based on the cfuhash project::
el: Η υλοποίηση του πίνακα κατακερματισμού που χρησιμοποιείται από το :mod:`tracemalloc` βασίζεται στο έργο cfuhash::

source: The :mod:`!_decimal` C extension underlying the :mod:`decimal` module is built using an included copy of the libmpdec library unless the build is configured ``--with-system-libmpdec``::
el: Η επέκταση :mod:`!_decimal` που βρίσκεται κάτω από την ενότητα :mod:`decimal` είναι φτιαγμένη χρησιμοποιώντας ένα συμπεριλαμβανόμενο αντίγραφο της βιβλιοθήκης libmpdec, εκτός αν ή έκδοση έχει ρύθμιση ``--with-system-libmpdec``::

source: W3C C14N test suite
el: W3C C14N σουίτα δοκιμής

source: The C14N 2.0 test suite in the :mod:`test` package (``Lib/test/xmltestdata/c14n-20/``) was retrieved from the W3C website at https://www.w3.org/TR/xml-c14n2-testcases/ and is distributed under the 3-clause BSD license::
el: Η σουίτα δοκιμής C14N 2.0 στο πακέτο :mod:`test` (``Lib/test/xmltestdata/c14n-20/``) ανακτήθηκε από τον ιστότοπο του W3C https://www.w3.org/TR/xml-c14n2-testcases/ και διανέμεται με την άδεια 3 ρήτρων BSD::

source: The audioop module uses the code base in g771.c file of the SoX project. https://sourceforge.net/projects/sox/files/sox/12.17.7/sox-12.17.7.tar.gz
el: Το module audioop χρησιμοποιεί ως βάση κώδικα του αρχείου g771.c του έργου Sox. https://sourceforge.net/projects/sox/files/sox/12.17.7/sox-12.17.7.tar.gz

source: This source code is a product of Sun Microsystems, Inc. and is provided for unrestricted use. Users may copy or modify this source code without charge.
el: Αυτό ο πηγαίος κώδικας είναι προϊόν της Sun Microsystems, Inc. και παρέχεται για απεριόριστη χρήση. Οι χρήστες μπορούν να αντιγράψουν ή να τροποποιήσουν αυτόν τον πηγαίο κώδικα χωρίς χρέωση.

source: SUN SOURCE CODE IS PROVIDED AS IS WITH NO WARRANTIES OF ANY KIND INCLUDING THE WARRANTIES OF DESIGN, MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE, OR ARISING FROM A COURSE OF DEALING, USAGE OR TRADE PRACTICE.
el: Ο ΠΗΓΑΙΟΣ ΚΩΔΙΚΑΣ ΤΟΥ SUN ΠΑΡΕΧΕΤΑΙ ΟΠΩΣ ΕΧΕΙ ΧΩΡΙΣ ΚΑΝΕΝΟΣ ΕΙΔΟΥΣ ΕΓΓΥΗΣΕΙΣ ΣΥΜΠΕΡΙΛΑΜΒΑΝΟΜΕΝΩΝ ΕΓΓΥΗΣΕΩΝ ΣΧΕΔΙΑΣΜΟΥ, ΕΜΠΟΡΕΥΣΙΜΟΤΗΤΑΣ ΚΑΙ ΚΑΤΑΛΛΗΛΟΤΗΤΑΣ ΓΙΑ ΣΥΓΚΕΚΡΙΜΕΝΟ ΣΚΟΠΟ Ή ΠΟΥ ΠΡΟΚΥΠΤΕΙ ΑΠΟ ΚΑΠΟΙΑ ΠΟΡΕΙΑ ΣΥΝΑΛΛΑΓΗΣ, ΧΡΗΣΗΣ Ή ΕΜΠΟΡΙΚΗΣ ΠΡΑΚΤΙΚΗΣ.

source: Sun source code is provided with no support and without any obligation on the part of Sun Microsystems, Inc. to assist in its use, correction, modification or enhancement.
el: Ο πηγαίος κώδικας του Sun παρέχεται χωρίς την υποστήριξη και χωρίς καμία υποχρέωση εκ μέρους της Sun Microsystems, Inc. να βοηθήσει στην χρήση, στη διόρθωση, τροποποίηση ή βελτίωση του.

source: SUN MICROSYSTEMS, INC. SHALL HAVE NO LIABILITY WITH RESPECT TO THE INFRINGEMENT OF COPYRIGHTS, TRADE SECRETS OR ANY PATENTS BY THIS SOFTWARE OR ANY PART THEREOF.
el: Η SUN MICROSYSTEMS, INC. ΔΕΝ ΕΧΕΙ ΚΑΜΙΑ ΕΥΘΥΝΗ ΣΧΕΤΙΚΑ ΜΕ ΤΗΝ ΠΑΡΑΒΙΑΣΗ ΠΝΕΥΜΑΤΙΚΩΝ ΔΙΚΑΙΩΜΑΤΩΝ, ΕΜΠΟΡΙΚΩΝ ΑΠΟΡΡΗΤΩΝ Ή ΟΠΟΙΑΔΗΠΟΤΕ ΕΥΡΕΣΙΤΕΧΝΙΑ ΑΠΟ ΑΥΤΟ ΤΟ ΛΟΓΙΣΜΙΚΟ Ή ΟΠΟΙΟΔΗΠΟΤΕ ΜΕΡΟΣ ΑΥΤΟΥ.

source: In no event will Sun Microsystems, Inc. be liable for any lost revenue or profits or other special, indirect and consequential damages, even if Sun has been advised of the possibility of such damages.
el: Σε καμία περίπτωση η Sun Microsystems, Inc. δεν φέρει ευθύνη για τυχόν απώλεια εσόδων ή κερδών ή άλλες ειδικές, έμμεσες και επακόλουθες ζημίες, ακόμη και αν η Sun έχει ενημερωθεί για την πιθανότητα τέτοιων ζημιών.

source: Sun Microsystems, Inc. 2550 Garcia Avenue Mountain View, California 94043
el: Sun Microsystems, Inc. 2550 Garcia Avenue Mountain View, Καλιφόρνια 94043

source: Parts of the :mod:`asyncio` module are incorporated from `uvloop 0.16 <https://github.com/MagicStack/uvloop/tree/v0.16.0>`_, which is distributed under the MIT license::
el: Μέρη της ενότητας :mod:`asyncio` ενσωματώνονται από το `uvloop 0.16 <https://github.com/MagicStack/uvloop/tree/v0.16.0>`_, η οποία διανέμεται με άδεια MIT::
