Repository: pygreece/python-docs-gr
Catalog: library/functions.po
Languages: el

source: Built-in Functions
el: Ενσωματωμένες (Built-in) Συναρτήσεις

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
el: O interpreter της Python έχει έναν αριθμό από συναρτήσεις και τύπους ενσωματωμένους (built-in) σε αυτόν, που είναι πάντα διαθέσιμα. Παρατίθενται εδώ με αλφαβητική σειρά.

source: Return the absolute value of a number. The argument may be an integer, a floating point number, or an object implementing :meth:`~object.__abs__`. If the argument is a complex number, its magnitude is returned.
el: Επιστρέφει την απόλυτη τιμή ενός αριθμού. Το όρισμα μπορεί να είναι ένας ακέραιος, ένας αριθμός κινητής υποδιαστολής, ή ένα αντικείμενο που υλοποιεί την :meth:`~object.__abs__`. Εάν το όρισμα είναι ένας περίπλοκος αριθμός επιστρέφεται το μέγεθός του.

source: Return an :term:`asynchronous iterator` for an :term:`asynchronous iterable`. Equivalent to calling ``x.__aiter__()``.
el: Επιστρέφεται ένας :term:`asynchronous iterator` για ένα :term:`asynchronous iterable`. Ισοδυναμεί με την κλήση του ``x.__aiter__()``.

source: Note: Unlike :func:`iter`, :func:`aiter` has no 2-argument variant.
el: Σημείωση: Σε αντίθεση με το :func:`iter`, το :func:`aiter` δεν έχει παραλλαγή 2 ορισμάτων.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
el: Επιστρέφει ``True`` εάν όλα τα στοιχεία του *iterable* είναι true (ή εάν το iterable είναι κενό). Ισοδυναμεί με::

source: When awaited, return the next item from the given :term:`asynchronous iterator`, or *default* if given and the iterator is exhausted.
el: Όταν αναμένεται, επιστρέφεται το επόμενο στοιχείο από το :term:`asynchronous iterator`, ή *default* (προεπιλογή) εάν δίνεται και ο iterator έχει εξαντληθεί.

source: This is the async variant of the :func:`next` builtin, and behaves similarly.
el: Αυτό είναι μια ασύγχρονη παραλλαγή της ενσωματωμένης συνάρτησης :func:`next`, και συμπεριφέρεται παρόμοια.

source: This calls the :meth:`~object.__anext__` method of *async_iterator*, returning an :term:`awaitable`. Awaiting this returns the next value of the iterator. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopAsyncIteration` is raised.
el: Αυτό καλεί την μέθοδο :meth:`~object.__anext__` του *async_iterator*, επιστρέφοντας ένα :term:`awaitable`. Αναμένοντας αυτό, επιστρέφει την επόμενη τιμή του iterator. Αν δίνεται το *default* (προεπιλογή), αυτό επιστρέφεται εάν ο iterator έχει εξαντληθεί, αλλιώς γίνεται raise ένα :exc:`StopAsyncIteration`.

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
el: Επιστρέφει ``True`` εάν οποιοδήποτε στοιχείο του *iterable* είναι αληθές. Εάν το iterable είναι κενό, επιστρέφει ``False``. Ισοδυναμεί με::

source: As :func:`repr`, return a string containing a printable representation of an object, but escape the non-ASCII characters in the string returned by :func:`repr` using ``\x``, ``\u``, or ``\U`` escapes. This generates a string similar to that returned by :func:`repr` in Python 2.
el: Όπως η :func:`repr`, επιστρέφει μια συμβολοσειρά που περιέχει μια εκτυπώσιμη απεικόνιση ενός αντικειμένου, αλλά αναιρεί τους μη-ASCII χαρακτήρες στη συμβολοσειρά που επιστρέφεται από το :func:`repr` χρησιμοποιώντας ``\x``, ``\u``, ή ``\U`` αποδράσεις. Αυτό παράγει μια συμβολοσειρά παρόμοια με αυτή που επιστρέφεται από την :func:`repr` στην Python 2.

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
el: Μετατροπή ενός ακέραιου αριθμού σε μια δυαδική συμβολοσειρά με πρόθεμα "0b". Το αποτέλεσμα είναι μια έγκυρη έκφραση Python. Εάν το *x* δεν είναι αντικείμενο της Python :class:`int`, πρέπει να οριστεί μια μέθοδος :meth:`~object.__index__` που επιστρέφει έναν ακέραιο αριθμό. Κάποια παραδείγματα:

source: If the prefix "0b" is desired or not, you can use either of the following ways.
el: Εάν το πρόθεμα "0b" είναι επιθυμητό ή όχι, μπορείτε να χρησιμοποιήσετε έναν από τους παρακάτω τρόπους.

source: See also :func:`format` for more information.
el: Δείτε επίσης τη :func:`format` για περισσότερες πληροφορίες.

source: Return a Boolean value, i.e. one of ``True`` or ``False``. *x* is converted using the standard :ref:`truth testing procedure <truth>`. If *x* is false or omitted, this returns ``False``; otherwise, it returns ``True``. The :class:`bool` class is a subclass of :class:`int` (see :ref:`typesnumeric`). It cannot be subclassed further. Its only instances are ``False`` and ``True`` (see :ref:`typebool`).
el: Επιστρέφετε μια δυαδική τιμή, π.χ. μία από τις τιμές ``True`` ή ``False``. Το *x* μετατρέπεται χρησιμοποιώντας την τυπική :ref:`truth testing procedure <truth>`. Εάν το *x* είναι ψευδές ή παραλειφθεί, αυτό επιστρέφει ``False``∙ διαφορετικά, επιστρέφει ``True``. Η κλάση :class:`bool` είναι μια υποκλάση της :class:`int` (βλ. :ref:`typesnumeric`). Δεν μπορεί να γίνει περαιτέρω υποκλάση. Οι μόνες περιπτώσεις είναι ``False`` και ``True`` (βλ. :ref:`typebool`).

source: *x* is now a positional-only parameter.
el: Το *x* είναι πλέον μόνο παράμετρος θέσης.

source: This function drops you into the debugger at the call site. Specifically, it calls :func:`sys.breakpointhook`, passing ``args`` and ``kws`` straight through. By default, ``sys.breakpointhook()`` calls :func:`pdb.set_trace()` expecting no arguments. In this case, it is purely a convenience function so you don't have to explicitly import :mod:`pdb` or type as much code to enter the debugger. However, :func:`sys.breakpointhook` can be set to some other function and :func:`breakpoint` will automatically call that, allowing you to drop into the debugger of choice. If :func:`sys.breakpointhook` is not accessible, this function will raise :exc:`RuntimeError`.
el: Αυτή η συνάρτηση μας μεταφέρει στο πρόγραμμα εντοπισμού σφαλμάτων στην τοποθεσία της κλήσης. Συγκεκριμένα, καλεί το :func:`sys.breakpointhook`, περνώντας απευθείας τα ``args`` και ``kws``. Από προεπιλογή, το ``sys.breakpointhook()`` καλεί την :func:`pdb.set_trace()` χωρίς να περιμένει ορίσματα. Σε αυτήν την περίπτωση, είναι καθαρά μια βολική συνάρτηση, επομένως δεν χρειάζεται να εισάγετε ρητά το :mod:`pdb` ή να πληκτρολογήσετε τόσο πολύ κώδικα. Ωστόσο η :func:`sys.breakpointhook` μπορεί να ρυθμιστεί σε κάποια άλλη συνάρτηση και το :func:`breakpoint` θα το καλέσει αυτόματα, επιτρέποντας σας να πέσετε στο πρόγραμμα εντοπισμού σφαλμάτων της επιλογής σας. Εάν η :func:`sys.breakpointhook` δεν είναι προσβάσιμη, αυτή η συνάρτηση θα κάνει raise το :exc:`RuntimeError`.

source: By default, the behavior of :func:`breakpoint` can be changed with the :envvar:`PYTHONBREAKPOINT` environment variable. See :func:`sys.breakpointhook` for usage details.
el: Από προεπιλογή, η συμπεριφορά της :func:`breakpoint` μπορεί να αλλάξει με την μεταβλητή περιβάλλοντος :envvar:`PYTHONBREAKPOINT`. Βλ. την :func:`sys.breakpointhook` για λεπτομέρειες χρήσης.

source: Note that this is not guaranteed if :func:`sys.breakpointhook` has been replaced.
el: Λάβετε υπόψη ότι αυτό δεν είναι εγγυημένο εάν η :func:`sys.breakpointhook` έχει αντικατασταθεί.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
el: Εγείρει ένα :ref:`auditing event <auditing>` ``builtins.breakpoint`` με όρισμα ``breakpointhook``.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
el: Επιστρέφετε ένας νέος πίνακας από bytes. Η κλάση :class:`bytearray` είναι μια μεταβλητή ακολουθία ακεραίων στο εύρος 0 <= x < 256. Έχει τις περισσότερες από τις συνήθεις μεθόδους μεταβλητών ακολουθιών, που περιγράφονται στο :ref:`typesseq-mutable`, καθώς και τις περισσότερες μεθόδους που έχει ο τύπος :class:`bytes`, δείτε :ref:`bytes-methods`.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
el: Η προαιρετική παράμετρος *source* μπορεί να χρησιμοποιηθεί για την αρχικοποίηση του πίνακα με μερικούς διαφορετικούς τρόπους:

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
el: Εάν είναι *string*, πρέπει επίσης να δώσετε τις παραμέτρους *encoding* (και προαιρετικά, *errors*)∙ η :func:`bytearray` στη συνέχεια μετατρέπει τη συμβολοσειρά σε byte χρησιμοποιώντας :meth:`str.encode`.

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
el: Εάν είναι *integer*, ο πίνακας θα έχει αυτό το μέγεθος και θα αρχικοποιηθεί με null bytes.

source: If it is an object conforming to the :ref:`buffer interface <bufferobjects>`, a read-only buffer of the object will be used to initialize the bytes array.
el: Εάν είναι αντικείμενο που συμμορφώνεται με το :ref:`buffer interface <bufferobjects>`, θα χρησιμοποιηθεί μια προσωρινή μνήμη μόνο για ανάγνωση του αντικείμενου για την προετοιμασία του πίνακα με τα bytes.

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
el: Εάν είναι *iterable*, πρέπει να είναι ένας iterable ακεραίων στο εύρος ``0 <= x < 256``, οι οποίοι χρησιμοποιούνται ως αρχικά περιεχόμενα του πίνακα.

source: Without an argument, an array of size 0 is created.
el: Χωρίς όρισμα δημιουργείται ένας πίνακας μεγέθους 0.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
el: Βλ. επίσης :ref:`binaryseq` και :ref:`typebytearray`.

source: Return a new "bytes" object which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
el: Επιστρέφεται ένα νέο αντικείμενο "bytes", που είναι μια αμετάβλητη ακολουθία ακεραίων στο εύρος ``0 <= x < 256``. Η :class:`bytes` είναι μια αμετάβλητη έκδοση του :class:`bytearray` -- έχει τις ίδιες μεθόδους χωρίς μετάλλαξη και την ίδια συμπεριφορά ευρετηριοποίησης και τεμαχισμού.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
el: Συνεπώς, τα ορίσματα του constructor ερμηνεύονται ως :func:`bytearray`.

source: Bytes objects can also be created with literals, see :ref:`strings`.
el: Τα αντικείμενα bytes μπορούν επίσης να δημιουργηθούν με literals, βλέπε :ref:`strings`.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
el: Βλέπε επίσης :ref:`binaryseq`, :ref:`typebytes`, και :ref:`bytes-methods`.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`~object.__call__` method.
el: Επιστρέφει :const:`True` εάν το όρισμα *object* εμφανίζεται ως callable, και :const:`False` εάν όχι. Εάν αυτό επιστρέψει ``True``, είναι ακόμα πιθανό μια κλήση να αποτύχει, αλλά εάν είναι ``False``, η κλήση του *object* δεν θα πετύχει ποτέ. Σημειώστε ότι οι κλάσεις μπορούν να κληθούν (η κλήση μιας κλάσης επιστρέφει ένα νέο instance). Τα instances μπορούν να κληθούν αν η κλάση τους έχει τη μέθοδο :meth:`~object.__call__`.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
el: Αυτή η συνάρτηση πρώτα αφαιρέθηκε στην Python 3.0 και στη συνέχεια επανήλθε στην Python 3.2.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
el: Επιστρέφει τη συμβολοσειρά που αντιπροσωπεύει έναν χαρακτήρα του οποίου ο κωδικός σημείου Unicode είναι ο ακέραιος *i*. Για παράδειγμα, ``chr(97)`` επιστρέφει τη συμβολοσειρά ``'a'``, ενώ το ``chr(8364)`` επιστρέφει τη συμβολοσειρά ``'€'``. Αυτό είναι το αντίστροφο του :func:`ord`.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
el: Το έγκυρο εύρος για το όρισμα είναι από 0 έως 1,114,111 (0x10FFFF στη βάση 16). Το :exc:`ValueError` θα γίνει raise εάν το *i* είναι εκτός αυτού του εύρους.

source: Transform a method into a class method.
el: Μετατροπή μιας μεθόδου σε μέθοδο κλάσης.

source: A class method receives the class as an implicit first argument, just like an instance method receives the instance. To declare a class method, use this idiom::
el: Μια μέθοδος κλάσης λαμβάνει την κλάση ως σιωπηρό πρώτο όρισμα, όπως μια instance μέθοδος λαμβάνει το instance. Για να δηλώσετε μια μέθοδο κλάσης, χρησιμοποιήστε αυτό το ιδίωμα::

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
el: Η φόρμα ``@classmethod`` είναι μια συνάρτηση :term:`decorator` -- βλέπε :ref:`function` για λεπτομέρειες.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
el: Μια μέθοδος κλάσης μπορεί να κληθεί είτε στην κλάση (όπως ``C.f()``) είτε σε ένα instance (όπως ``C().f()``). Το instance αγνοείται εκτός από την κλάση της. Εάν μια μέθοδος κλάσης καλείται για μια παραγόμενη κλάση, το αντικείμενο παραγόμενης κλάσης μεταβιβάζεται ως το υπονοούμενο πρώτο όρισμα.

source: Class methods are different than C++ or Java static methods. If you want those, see :func:`staticmethod` in this section. For more information on class methods, see :ref:`types`.
el: Οι μέθοδοι κλάσης διαφέρουν από τις στατικές μεθόδους C++ ή Java. Αν θέλετε, ανατρέξτε στο :func:`staticmethod` σε αυτήν την ενότητα. Για περισσότερες πληροφορίες σχετικά με τις μεθόδους κλάσης, ανατρέξτε στο :ref:`types`.

source: Class methods can now wrap other :term:`descriptors <descriptor>` such as :func:`property`.
el: Οι μέθοδοι κλάσης μπορούν πλέον να αναδιπλώσουν άλλους :term:`descriptors <descriptor>` όπως η :func:`property`.

source: Class methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``) and have a new ``__wrapped__`` attribute.
el: Οι μέθοδοι κλάσης κληρονομούν πλέον τα χαρακτηριστικά της μεθόδους (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` και ``__annotations__``) και έχουν ένα νέο χαρακτηριστικό ``__wrapped__``.

source: Class methods can no longer wrap other :term:`descriptors <descriptor>` such as :func:`property`.
el: Οι μέθοδοι κλάσης δεν μπορούν πλέον να κάνουν wrap άλλους :term:`descriptors <descriptor>` όπως :func:`property`.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
el: Μεταγλωττίστε το *source* σε έναν κώδικα ή αντικείμενο AST. Τα αντικείμενα κώδικα μπορούν να εκτελεστούν από :func:`exec` ή :func:`eval`. Η *source* μπορεί να είναι είτε μια κανονική συμβολοσειρά, μια συμβολοσειρά byte ή μια συμβολοσειρά AST αντικείμενου. Ανατρέξτε στην τεκμηρίωση του module :mod:`ast` για πληροφορίες σχετικά με τον τρόπο εργασίας με αντικείμενα AST.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
el: Το όρισμα *filename* θα πρέπει να δίνει το αρχείο από το οποίο διαβάζεται ο κώδικας∙ να περάσει κάποια αναγνωρίσιμη τιμή εάν δεν διαβαστεί από ένα αρχείο (χρησιμοποιείται συνήθως ``'<string>'``).

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
el: Το όρισμα *mode* καθορίζει το είδος του κώδικα που πρέπει να μεταγλωττιστεί∙ μπορεί να είναι ``'exec'`` εάν η *source* αποτελείται από μια ακολουθία δηλώσεων, ``'eval'`` εάν αποτελείται από μία μόνο έκφραση, ή ``'single'`` εάν αποτελείται από μία μόνο διαδραστική πρόταση (στην τελευταία περίπτωση, θα εκτυπωθούν δηλώσεις έκφρασης που αξιολογούνται σε κάτι διαφορετικό από ``None``).

source: The optional arguments *flags* and *dont_inherit* control which :ref:`compiler options <ast-compiler-flags>` should be activated and which :ref:`future features <future>` should be allowed. If neither is present (or both are zero) the code is compiled with the same flags that affect the code that is calling :func:`compile`. If the *flags* argument is given and *dont_inherit* is not (or is zero) then the compiler options and the future statements specified by the *flags* argument are used in addition to those that would be used anyway. If *dont_inherit* is a non-zero integer then the *flags* argument is it -- the flags (future features and compiler options) in the surrounding code are ignored.
el: Τα προαιρετικά ορίσματα *flags* και *dont_inherit* ελέγχουν ποιες :ref:`compiler options <ast-compiler-flags>` θα πρέπει να ενεργοποιηθούν και ποιες :ref:`future features <future>` θα πρέπει να επιτρέπονται. Εάν δεν υπάρχει καμία (ή και οι δύο είναι μηδέν) ο κώδικας μεταγλωττίζεται με τα ίδια flags που επηρεάζουν τον κώδικα που καλεί :func:`compile`. Εάν το όρισμα *flags* δίνεται και το *dont_inherit* δεν είναι (ή είναι μηδέν), τότε οι επιλογές του μεταγλωττιστή και οι μελλοντικές δηλώσεις που καθορίζονται από το όρισμα *flags* χρησιμοποιούνται ανεξάρτητα από αυτές που θα χρησιμοποιούνταν ούτως ή άλλως. Εάν το *dont_inherit* είναι ένα μη μηδενικός ακέραιος, τότε το όρισμα *flags* είναι αυτό -- οι σημαίες (μελλοντικές δυνατότητες και επιλογές μεταγλωττιστή) στον περιβάλλοντα κώδικα αγνοούνται.

source: Compiler options and future statements are specified by bits which can be bitwise ORed together to specify multiple options. The bitfield required to specify a given future feature can be found as the :attr:`~__future__._Feature.compiler_flag` attribute on the :class:`~__future__._Feature` instance in the :mod:`__future__` module. :ref:`Compiler flags <ast-compiler-flags>` can be found in :mod:`ast` module, with ``PyCF_`` prefix.
el: Οι επιλογές του μεταγλωττιστή και οι μελλοντικές εντολές καθορίζονται από bits που μπορούν να συνδυαστούν κατά bit ORed μαζί για να καθορίσουν πολλές επιλογές. Το πεδίο bit που απαιτείται για το καθορισμό ενός δεδομένου μελλοντικού χαρακτηριστικού μπορεί να βρεθεί ως το χαρακτηριστικό :attr:`~__future__.Το _Feature.compiler_flag` στο :class:`~__future__._Feature` instance του module :mod:`__future__`. :ref:`Compiler flags <ast-compiler-flags>` μπορούν να βρεθούν στο module :mod:`ast`, με το πρόθεμα ``PyCF_``.

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
el: Το όρισμα *optimize* καθορίζει το επίπεδο βελτιστοποίησης του μεταγλωττιστή∙ η προεπιλεγμένη τιμή ``-1`` επιλέγει το επίπεδο βελτιστοποίησης του διερμηνέα όπως δίνεται από τις επιλογές :option:`-O`. Τα ρητά επίπεδα είναι ``0`` (χωρίς βελτιστοποίηση∙ το ``__debug__`` είναι αληθές), ``1`` (οι ισχυρισμοί καταργήθηκαν, το ``__debug__`` είναι ψευδές) ή ``2`` (οι συμβολοσειρές εγγραφών καταργήθηκαν επίσης).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
el: Αυτή η συνάρτηση κάνει raise :exc:`SyntaxError` εάν ο μεταγλωττισμένος κώδικας είναι άκυρος, και το :exc:`ValueError` εάν ο κώδικας περιλαμβάνει null bytes.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
el: Εάν θέλετε να αναλύσετε τον κώδικα Python στην αναπαράσταση του AST, δείτε το :func:`ast.parse`.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source``, ``filename``.
el: Εγείρει ένα :ref:`auditing event <auditing>` ``compile`` με ορίσματα ``source``, ``filename``.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
el: Κάνει raise ένα :ref:`auditing event <auditing>` ``compile`` με ορίσματα ``source`` και ``filename``. Αυτό το συμβάν μπορεί επίσης να προκύψει από έμμεση μεταγλώττιση.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
el: Κατά τη μεταγλώττιση μιας συμβολοσειράς με κωδικό πολλαπλών γραμμών στη λειτουργία ``'single'`` ή ``'eval'``, η είσοδος πρέπει να τερματίζεται με τουλάχιστον έναν χαρακτήρα νέας γραμμής. Αυτό γίνεται για να διευκολυνθεί ο εντοπισμός μη ολοκληρωμένων και ολοκληρωμένων δηλώσεων στο module :mod:`code`.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
el: Είναι δυνατό να καταρρεύσει ο interpreter της Python με μια αρκετά μεγάλη/σύνθετη συμβολοσειρά κατά τη μεταγλώττιση σε ένα αντικείμενο AST λόγω περιορισμών βάθους στοίβας στον μεταγλωττιστή AST της Python.

source: Allowed use of Windows and Mac newlines. Also, input in ``'exec'`` mode does not have to end in a newline anymore. Added the *optimize* parameter.
el: Επιτρέπεται η χρήση νέων γραμμών Windows και Mac. Επίσης, η εισαγωγή στη λειτουργία ``'exec'`` δεν χρειάζεται πλέον να τελειώνει σε νέα γραμμή. Προστέθηκε η παράμετρος *optimize*.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
el: Προηγουμένως, το :exc:`TypeError` έγινε raise όταν null bytes συναντήθηκαν στο *source*.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
el: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` μπορεί τώρα να μεταβιβαστεί σε σημαίες για να ενεργοποιηθεί η υποστήριξη για ``await``, ``async for``, και ``async with``.
