Repository: pygreece/python-docs-gr
Catalog: library/functions.po
Languages: el

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If :meth:`~object.__float__` is not defined then it falls back to :meth:`~object.__index__`.
el: Για ένα γενικό αντικείμενο Python ``x``, ``float(x)`` εκχωρεί στο ``x.__float__()``. Εάν το :meth:`~object.__float__` δεν έχει οριστεί, τότε επιστρέφει στο :meth:`~object.__index__`.

source: If no argument is given, ``0.0`` is returned.
el: Εάν δεν δοθεί όρισμα, επιστρέφεται το ``0.0``.

source: Examples::
el: Παραδείγματα::

source: The float type is described in :ref:`typesnumeric`.
el: Ο τύπος float περιγράφεται στο :ref:`typesnumeric`.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__float__` is not defined.
el: Επιστρέφει στο :meth:`~object.__index__` εάν το :meth:`~object.__float__` δεν έχει οριστεί.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument; however, there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
el: Μετατρέπει ένα *value* σε μια αναπαράσταση "formatted", όπως ελέγχεται από το *format_spec*. Η ερμηνεία του *format_spec* θα εξαρτηθεί από τον τύπο του ορίσματος *value* ∙ ωστόσο υπάρχει μια τυπική σύνταξη μορφοποίησης που χρησιμοποιείται από τους περισσότερους ενσωματωμένους τύπους: :ref:`formatspec`.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
el: Η προεπιλεγμένη *format_spec* είναι μια κενή συμβολοσειρά που συνήθως δίνει το ίδιο αποτέλεσμα με την κλήση του :func:`str(value) <str>`.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`~object.__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
el: Μια κλήση στο ``format(value, format_spec)`` μεταφράζεται σε ``type(value).__format__(value, format_spec)`` το οποίο παρακάμπτει το instance του λεξικού κατά την αναζήτηση της τιμής της μεθόδου :meth:`~object.__format__`. Μια εξαίρεση :exc:`TypeError` γίνεται raise εάν η αναζήτηση της μεθόδου φτάσει στο :mod:`object` και το *format_spec* δεν είναι κενό ή εάν είτε το *format_spec* είτε η τιμή επιστροφής δεν είναι συμβολοσειρές.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
el: Το ``object().__format__(format_spec)`` κάνει raise το :exc:`TypeError` εάν το *format_spec* δεν είναι κενή συμβολοσειρά.

source: Return a new :class:`frozenset` object, optionally with elements taken from *iterable*. ``frozenset`` is a built-in class. See :class:`frozenset` and :ref:`types-set` for documentation about this class.
el: Επιστρέφει ένα νέο αντικείμενο :class:`frozenset`, προαιρετικά με στοιχεία που λαμβάνονται από το *iterable*. Το ``frozenset`` είναι μια ενσωματωμένη κλάση. Δείτε το :class:`frozenset` και το :ref:`types-set` για τεκμηρίωση αυτής της κλάσης.

source: For other containers see the built-in :class:`set`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
el: Για άλλα containers, ανατρέξτε στις ενσωματωμένες κλάσεις :class:`set`, :class:`list`, :class:`tuple`, και :class:`dict`, καθώς και το module :mod:`collections`.

source: Return the value of the named attribute of *object*. *name* must be a string. If the string is the name of one of the object's attributes, the result is the value of that attribute. For example, ``getattr(x, 'foobar')`` is equivalent to ``x.foobar``. If the named attribute does not exist, *default* is returned if provided, otherwise :exc:`AttributeError` is raised. *name* need not be a Python identifier (see :func:`setattr`).
el: Επιστρέφει την τιμή του ονομασμένου χαρακτηριστικού του *object* Το *name* πρέπει να είναι μια συμβολοσειρά. Εάν η συμβολοσειρά είναι το όνομα ενός από τα χαρακτηριστικά του αντικειμένου, το αποτέλεσμα είναι η τιμή αυτού του χαρακτηριστικού. Για παράδειγμα, ``getattr(x, 'foobar')`` είναι ισοδύναμο με το ``x.foobar``. Εάν το χαρακτηριστικό γνώρισμα δεν υπάρχει, το *default* επιστρέφεται εάν παρέχεται, διαφορετικά γίνεται raise το :exc:`AttributeError`. Το *name* δεν χρειάζεται να είναι αναγνωριστικό Python (δείτε :func:`setattr`).

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to retrieve it with :func:`getattr`.
el: Δεδομένου ότι το :ref:`private name mangling <private-name-mangling>` συμβαίνει κατά τη στιγμή της μεταγλώττισης, πρέπει κανείς να παραμορφώνει χειροκίνητα το όνομα ενός ιδιωτικού χαρακτηριστικού (χαρακτηριστικά με δύο κορυφαίες υπογραμμίσεις) για να ανακτήσει με :func:`getattr`.

source: Return the dictionary implementing the current module namespace. For code within functions, this is set when the function is defined and remains the same regardless of where the function is called.
el: Επιστρέφει το λεξικό που υλοποιεί τον τρέχοντα χώρο ονομάτων του module. Για κώδικα εντός συναρτήσεων, αυτό ορίζεται όταν ορίζεται η συνάρτηση και παραμένει το ίδιο ανεξάρτητη από το που καλείται η συνάρτηση.

source: The arguments are an object and a string. The result is ``True`` if the string is the name of one of the object's attributes, ``False`` if not. (This is implemented by calling ``getattr(object, name)`` and seeing whether it raises an :exc:`AttributeError` or not.)
el: Τα ορίσματα είναι ένα αντικείμενο και μια συμβολοσειρά (string). Το αποτέλεσμα είναι ``True`` εάν η συμβολοσειρά είναι το όνομα ενός από τα χαρακτηριστικά του αντικειμένου, ``False`` εάν όχι. (Αυτό υλοποιείται καλώντας το ``getattr(object, name)`` και να δούμε αν γίνεται raise ένα :exc:`AttributeError` ή όχι.)

source: Return the hash value of the object (if it has one). Hash values are integers. They are used to quickly compare dictionary keys during a dictionary lookup. Numeric values that compare equal have the same hash value (even if they are of different types, as is the case for 1 and 1.0).
el: Επιστρέφει την τιμή κατακερματισμού του αντικειμένου (αν έχει). Οι τιμές κατακερματισμού είναι ακέραιοι. Χρησιμοποιούνται για τη γρήγορη σύγκριση των κλειδιών του λεξικού κατά τη διάρκεια μιας αναζήτησης λεξικού. Οι αριθμητικές τιμές που συγκρίνονται ίσες έχουν την ίδια τιμή κατακερματισμού (ακόμα και αν είναι διαφορετικοί τύποι, όπως συμβαίνει για τα 1 και 1.0).

source: For objects with custom :meth:`~object.__hash__` methods, note that :func:`hash` truncates the return value based on the bit width of the host machine.
el: Για αντικείμενα με προσαρμοσμένες μεθόδους :meth:`~object.__hash__`, σημειώστε ότι το :func:`hash` περικόπτει την τιμή επιστροφής με βάση το πλάτος bit του υπολογιστή.

source: Invoke the built-in help system. (This function is intended for interactive use.) If no argument is given, the interactive help system starts on the interpreter console. If the argument is a string, then the string is looked up as the name of a module, function, class, method, keyword, or documentation topic, and a help page is printed on the console. If the argument is any other kind of object, a help page on the object is generated.
el: Καλείται το ενσωματωμένο (built-in) σύστημα βοήθειας. (Αυτή η συνάρτηση προορίζεται για διαδραστική χρήση.) Εάν δεν δοθεί όρισμα, το διαδραστικό σύστημα βοήθειας ξεκινά την κονσόλα του interpreter. Εάν το όρισμα είναι μια συμβολοσειρά, τότε η συμβολοσειρά αναζητείται ως όνομα ενός module, μιας συνάρτησης, μια κλάσης μιας μεθόδου, μιας λέξης κλειδιού ή θέματος τεκμηρίωσης και μια σελίδα βοήθειας εκτυπώνεται στην κονσόλα. Εάν το όρισμα είναι οποιοδήποτε άλλο είδος αντικειμένου, δημιουργείται μια σελίδα βοήθειας στο αντικείμενο.

source: Note that if a slash(/) appears in the parameter list of a function when invoking :func:`help`, it means that the parameters prior to the slash are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
el: Λάβετε υπόψη ότι εάν εμφανίζεται μια κάθετος (/) στη λίστα παραμέτρων μιας συνάρτησης κατά την κλήση :func:`help`, σημαίνει ότι οι παράμετροι πριν από την κάθετο είναι μόνο θέσης. Για περισσότερες πληροφορίες, βλέπε :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.

source: This function is added to the built-in namespace by the :mod:`site` module.
el: Αυτή η συνάρτηση προστίθεται στον ενσωματωμένο χώρο ονομάτων από το module :mod:`site`.

source: Changes to :mod:`pydoc` and :mod:`inspect` mean that the reported signatures for callables are now more comprehensive and consistent.
el: Οι αλλαγές σε :mod:`pydoc` και :mod:`inspect` σημαίνουν ότι οι αναφερόμενες υπογραφές για callables είναι πλέον πιο ολοκληρωμένες και συνεπείς.

source: Convert an integer number to a lowercase hexadecimal string prefixed with "0x". If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
el: Μετατροπή ενός ακεραίου αριθμού σε μια πεζή δεκαεξαδική συμβολοσειρά (string) με πρόθεμα το "0x". Εάν το *x* δεν είναι αντικείμενο Python :class:`int`, πρέπει να ορίσει μια μέθοδο :meth:`~object.__index__` που επιστρέφει έναν ακέραιο αριθμό. Κάποια παραδείγματα:

source: If you want to convert an integer number to an uppercase or lower hexadecimal string with prefix or not, you can use either of the following ways:
el: Εάν θέλετε να μετατρέψετε έναν ακέραιο αριθμό σε μια κεφαλαία ή πεζή δεκαεξαδική συμβολοσειρά (string) με πρόθεμα ή όχι, μπορείτε να χρησιμοποιήσετε έναν από τους παρακάτω τρόπους:

source: See also :func:`int` for converting a hexadecimal string to an integer using a base of 16.
el: Δείτε επίσης τη :func:`int` για τη μετατροπή μιας δεκαεξαδικής συμβολοσειράς σε ακέραιο χρησιμοποιώντας μια βάση του 16.

source: To obtain a hexadecimal string representation for a float, use the :meth:`float.hex` method.
el: Για να αποκτήσετε μια αναπαράσταση δεκαεξαδικής συμβολοσειράς για ένα float, χρησιμοποιήστε τη μέθοδο :meth:`float.hex`.

source: Return the "identity" of an object. This is an integer which is guaranteed to be unique and constant for this object during its lifetime. Two objects with non-overlapping lifetimes may have the same :func:`id` value.
el: Επιστρέφει την "ταυτότητα" ενός αντικειμένου. Αυτό είναι ένα ακέραιος αριθμός που εγγυάται ότι είναι μοναδικός και σταθερός για αυτό το αντικείμενο κατά τη διάρκεια της ζωής του. Δύο αντικείμενα με μη επικαλυπτόμενες διάρκειες ζωής μπορεί να έχουν την ίδια τιμή :func:`id`.

source: This is the address of the object in memory.
el: Αυτό είναι η διεύθυνση του αντικειμένου στην μνήμη.

source: Raises an :ref:`auditing event <auditing>` ``builtins.id`` with argument ``id``.
el: Εγείρει ένα :ref:`auditing event <auditing>` ``builtins.id`` με όρισμα ``id``.

source: If the *prompt* argument is present, it is written to standard output without a trailing newline. The function then reads a line from input, converts it to a string (stripping a trailing newline), and returns that. When EOF is read, :exc:`EOFError` is raised. Example::
el: Εάν υπάρχει το όρισμα *prompt*, γράφεται στην τυπική έξοδο χωρίς μια νέα γραμμή μετάδοσης. Στη συνέχεια, η συνάρτηση διαβάζει μια γραμμή από την είσοδο, τη μετατρέπει σε μια συμβολοσειρά (με την αφαίρεση μιας νέας γραμμής) και την επιστρέφει. Όταν διαβάζεται το EOF, γίνεται raise η :exc:`EOFError`. Παράδειγμα::

source: If the :mod:`readline` module was loaded, then :func:`input` will use it to provide elaborate line editing and history features.
el: Εάν έχει φορτωθεί το module :mod:`readline`, τότε η :func:`input` θα το χρησιμοποιήσει για να παρέχει περίπλοκες λειτουργίες επεξεργασίας γραμμής και ιστορικού.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt``.
el: Κάνει raise ένα :ref:`auditing event <auditing>` ``builtins.input`` με όρισμα ``prompt``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt`` before reading input
el: Κάνει raise ένα :ref:`auditing event <auditing>` ``builtins.input`` με όρισμα ``prompt`` προτού διαβάσει την είσοδο

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with argument ``result``.
el: Κάνει raise ένα :ref:`auditing event <auditing>` ``builtins.input/result`` με όρισμα ``result``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with the result after successfully reading input.
el: Κάνει raise ένα :ref:`auditing event <auditing>` ``builtins.input/result`` με το αποτέλεσμα μετά την επιτυχή ανάγνωση των δεδομένων.

source: Return an integer object constructed from a number or string *x*, or return ``0`` if no arguments are given. If *x* defines :meth:`~object.__int__`, ``int(x)`` returns ``x.__int__()``. If *x* defines :meth:`~object.__index__`, it returns ``x.__index__()``. If *x* defines :meth:`~object.__trunc__`, it returns ``x.__trunc__()``. For floating point numbers, this truncates towards zero.
el: Επιστρέφει ένα ακέραιο αντικείμενο που έχει δημιουργηθεί από έναν αριθμό ή συμβολοσειρά *x*, ή επιστρέφει ``0`` εάν δεν δίνονται ορίσματα. Εάν το *x* ορίζει :meth:`~object.__int__`, ``int(x)`` επιστρέφει ``x.__int__()``. Εάν το *x* ορίζει :meth:`~object.__index__`, επιστρέφει``x.__index__()``. Εάν το *x* ορίζει :meth:`~object.__trunc__`, επιστρέφει``x.__trunc__()``. Για αριθμούς κινητής υποδιαστολής, αυτό περικόπτεται προς το μηδέν.

source: If *x* is not a number or if *base* is given, then *x* must be a string, :class:`bytes`, or :class:`bytearray` instance representing an integer in radix *base*. Optionally, the string can be preceded by ``+`` or ``-`` (with no space in between), have leading zeros, be surrounded by whitespace, and have single underscores interspersed between digits.
el: Εάν το *x* δεν είναι ένα αριθμός ή εάν το *base* δίνεται, τότε το *x* πρέπει να είναι μια συμβολοσειρά, η :class:`bytes`, ή :class:`bytearray` instances αντιπροσωπεύουν έναν ακέραιο στην ρίζα του *base*. Προαιρετικά, η συμβολοσειρά μπορεί να προηγηθεί από ``+`` ή ``-`` (χωρίς κενά ενδιάμεσα), προηγούνται από δυναμικά, περιβάλλονται από κενό διάστημα και έχουν μονές κάτω παύλες μεταξύ των ψηφίων.

source: A base-n integer string contains digits, each representing a value from 0 to n-1. The values 0--9 can be represented by any Unicode decimal digit. The values 10--35 can be represented by ``a`` to ``z`` (or ``A`` to ``Z``). The default *base* is 10. The allowed bases are 0 and 2--36. Base-2, -8, and -16 strings can be optionally prefixed with ``0b``/``0B``, ``0o``/``0O``, or ``0x``/``0X``, as with integer literals in code. For base 0, the string is interpreted in a similar way to an :ref:`integer literal in code <integers>`, in that the actual base is 2, 8, 10, or 16 as determined by the prefix. Base 0 also disallows leading zeros: ``int('010', 0)`` is not legal, while ``int('010')`` and ``int('010', 8)`` are.
el: Μια συμβολοσειρά (string) ακέραιου αριθμού βάσης n περιέχει ψηφία, καθένα από τα οποία αντιπροσωπεύει μια τιμή από το 0 έως το n-1. Οι τιμές 0--9 μπορούν να αναπαρασταθούν με οποιοδήποτε δεκαδικό ψηφίο Unicode. Οι τιμές 10--35 μπορούν να αναπαρασταθούν με ``a`` ως το ``z`` (ή ``A`` ως το ``Z``). Η προεπιλεγμένη *base* είναι 10. Οι επιτρεπόμενες βάσεις είναι 0 και 2--36. Οι συμβολοσειρές βάσης -2, -8 και -16 μπορούν προαιρετικά να έχουν το πρόθεμα ``0b``/``0B``, ``0o``/``0O``, ή ``0x``/``0X``, όπως και με ακέραιους αριθμούς στον κώδικα. Για την βάση 0, η συμβολοσειρά ερμηνεύεται με παρόμοιο τρόπο με έναν :ref:`integer literal in code <integers>`, στο ότι η πραγματική βάση είναι 2, 8, 10 ή 16 όπως προσδιορίζεται από το πρόθεμα. Η βάση 0 δεν επιτρέπει επίσης τα μηδενικά στην αρχή : ``int('010', 0)`` δεν είναι εφικτό, ενώ το ``int('010')`` και ``int('010', 8)`` είναι.

source: The integer type is described in :ref:`typesnumeric`.
el: Ο ακέραιος τύπος περιγράφεται στο :ref:`typesnumeric`.

source: If *base* is not an instance of :class:`int` and the *base* object has a :meth:`base.__index__ <object.__index__>` method, that method is called to obtain an integer for the base. Previous versions used :meth:`base.__int__ <object.__int__>` instead of :meth:`base.__index__ <object.__index__>`.
el: Εάν το *base* δεν είναι ένα instance της :class:`int` και το *base* αντικείμενο έχει μια μέθοδο :meth:`base.__index__ <object.__index__>`, αυτή η μέθοδος καλείται για να αποκτήσει τον ακέραιο της βάσης. Προηγούμενες εκδόσεις χρησιμοποιούσαν την :meth:`base.__int__ <object.__int__>` αντί της :meth:`base.__index__ <object.__index__>`.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__int__` is not defined.
el: Επιστρέφει πίσω στη :meth:`~object.__index__` αν η :meth:`~object.__int__` δεν έχει οριστεί.

source: The delegation to :meth:`~object.__trunc__` is deprecated.
el: Η ανάθεση στη :meth:`~object.__trunc__` έχει καταργηθεί.

source: :class:`int` string inputs and string representations can be limited to help avoid denial of service attacks. A :exc:`ValueError` is raised when the limit is exceeded while converting a string *x* to an :class:`int` or when converting an :class:`int` into a string would exceed the limit. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation.
el: Οι είσοδοι συμβολοσειράς και οι αναπαραστάσεις συμβολοσειρών :class:`int` μπορούν να περιοριστούν για να αποφευχθούν επιθέσεις άρνησης υπηρεσίας. Μια :exc:`ValueError` γίνεται raise όταν γίνεται υπέρβαση του ορίου κατά τη μετατροπή μιας συμβολοσειράς *x* σε μια :class:`int` ή κατά τη μετατροπή ενός :class:`int` σε μια συμβολοσειρά θα υπερβεί το όριο. Δείτε την τεκμηρίωση :ref:`integer string conversion length limitation <int_max_str_digits>`.

source: Return ``True`` if the *object* argument is an instance of the *classinfo* argument, or of a (direct, indirect, or :term:`virtual <abstract base class>`) subclass thereof. If *object* is not an object of the given type, the function always returns ``False``. If *classinfo* is a tuple of type objects (or recursively, other such tuples) or a :ref:`types-union` of multiple types, return ``True`` if *object* is an instance of any of the types. If *classinfo* is not a type or tuple of types and such tuples, a :exc:`TypeError` exception is raised. :exc:`TypeError` may not be raised for an invalid type if an earlier check succeeds.
el: Επιστρέφει ``True`` εάν το όρισμα *object* είναι ένα instance του ορίσματος *classinfo* , ή μιας (άμεσης, έμμεσης ή :term:`virtual <abstract base class>`) υποκλάσης αυτού. Εάν το *object* δεν είναι ένα αντικείμενο του δεδομένου τύπου, η συνάρτηση θα επιστρέφει πάντα ``False``. Εάν το *classinfo* είναι μια πλειάδα τύπου αντικειμένων (ή αναδρομικά, άλλες τέτοιες πλειάδες) ή μια :ref:`types-union` πολλαπλών τύπων, επιστρέφει ``True`` εάν το *object* είναι ένα instance οποιουδήποτε από τους τύπους. Εάν το *classinfo* δεν είναι ένα τύπος ή μια πλειάδα τύπων και τέτοιες πλειάδες, γίνεται raise μια εξαίρεση :exc:`TypeError`. Η :exc:`TypeError` δεν μπορεί να γίνει raise για μη έγκυρο τύπο, εάν ένας προηγούμενος έλεγχος είναι επιτυχής.

source: *classinfo* can be a :ref:`types-union`.
el: Το *classinfo* μπορεί να είναι ένα :ref:`types-union`.

source: Return ``True`` if *class* is a subclass (direct, indirect, or :term:`virtual <abstract base class>`) of *classinfo*. A class is considered a subclass of itself. *classinfo* may be a tuple of class objects (or recursively, other such tuples) or a :ref:`types-union`, in which case return ``True`` if *class* is a subclass of any entry in *classinfo*. In any other case, a :exc:`TypeError` exception is raised.
el: Επιστρέφει ``True`` εάν η *class* είναι μια υποκλάση (άμεση, έμμεση, ή :term:`virtual <abstract base class>`) του *classinfo*. Μια κλάση θεωρείται υποκλάση του εαυτού της. Το *classinfo* μπορεί να είναι μια πλειάδα (tuple) αντικειμένων κλάσης (ή αναδρομικά, άλλες τέτοιες πλειάδες) ή μια :ref:`types-union`, οπότε επιστρέφετε ``True`` εάν η *class* είναι υποκλάση οποιασδήποτε καταχώρισης στο *classinfo*. Σε οποιαδήποτε άλλη περίπτωση, γίνεται raise μια εξαίρεση :exc:`TypeError`.

source: Return an :term:`iterator` object. The first argument is interpreted very differently depending on the presence of the second argument. Without a second argument, *object* must be a collection object which supports the :term:`iterable` protocol (the :meth:`~object.__iter__` method), or it must support the sequence protocol (the :meth:`~object.__getitem__` method with integer arguments starting at ``0``). If it does not support either of those protocols, :exc:`TypeError` is raised. If the second argument, *sentinel*, is given, then *object* must be a callable object. The iterator created in this case will call *object* with no arguments for each call to its :meth:`~iterator.__next__` method; if the value returned is equal to *sentinel*, :exc:`StopIteration` will be raised, otherwise the value will be returned.
el: Επιστρέφετε ένα αντικείμενο :term:`iterator`. Το πρώτο όρισμα ερμηνεύεται πολύ διαφορετικά ανάλογα με την παρουσία του δεύτερου ορίσματος. Χωρίς δεύτερο όρισμα, το *object* πρέπει να είναι ένα αντικείμενο συλλογής που να υποστηρίζει το πρωτόκολλο :term:`iterable` (η μέθοδος :meth:`~object.__iter__`), ή πρέπει να υποστηρίζει το πρωτόκολλο ακολουθίας (η μέθοδος :meth:`~object.__getitem__` με ακέραια ορίσματα που ξεκινούν από ``0``). Εάν δεν υποστηρίζει κανένα από αυτά τα πρωτόκολλα, γίνεται raise μια :exc:`TypeError`. Εάν δοθεί το δεύτερο όρισμα *sentinel*, τότε το *object* πρέπει να είναι ένα callable αντικείμενο. Ο iterator που δημιουργήθηκε σε αυτή την περίπτωση θα καλέσει το *object* χωρίς ορίσματα για κάθε κλήση στη μέθοδο :meth:`~iterator.__next__`∙ εάν η τιμή που επιστρέφετια είναι ίση με *sentinel*, θα γίνει raise η :exc:`StopIteration`, διαφορετικά θα επιστραφεί η τιμή.

source: See also :ref:`typeiter`.
el: Δείτε επίσης :ref:`typeiter`.

source: One useful application of the second form of :func:`iter` is to build a block-reader. For example, reading fixed-width blocks from a binary database file until the end of file is reached::
el: Μια χρήσιμη εφαρμογή της δεύτερης μορφής του :func:`iter` είναι η κατασκευή ενός block-reader. Για παράδειγμα, η ανάγνωση μπλοκ σταθερού πλάτους από ένα δυαδικό αρχείο βάσης δεδομένων μέχρι να φτάσει στο τέλος του αρχείου::

source: Return the length (the number of items) of an object. The argument may be a sequence (such as a string, bytes, tuple, list, or range) or a collection (such as a dictionary, set, or frozen set).
el: Επιστρέφει το μήκος (τον αριθμό των ειδών-περιεχομένων) ενός αντικειμένου. Το όρισμα μπορεί να είναι μια ακολουθία (όπως μια συμβολοσειρά, bytes, πλειάδα, λίστα, ή εύρος) ή μια συλλογή (όπως ένα λεξικό, ένα σετ, ή ένα παγωμένο σετ).

source: ``len`` raises :exc:`OverflowError` on lengths larger than :data:`sys.maxsize`, such as :class:`range(2 ** 100) <range>`.
el: Το ``len`` κάνει raise μια :exc:`OverflowError` σε μήκη τα οποία είναι μεγαλύτερα από :data:`sys.maxsize`, όπως :class:`range(2 ** 100) <range>`.

source: Rather than being a function, :class:`list` is actually a mutable sequence type, as documented in :ref:`typesseq-list` and :ref:`typesseq`.
el: Αντί να είναι συνάρτηση, το :class:`list` είναι στην πραγματικότητα ένας μεταβλητός τύπος ακολουθίας, όπως τεκμηριώνεται στα :ref:`typesseq-list` και :ref:`typesseq`.
