Repository: pygreece/python-docs-gr
Catalog: library/functions.po
Languages: el

source: Update and return a dictionary representing the current local symbol table. Free variables are returned by :func:`locals` when it is called in function blocks, but not in class blocks. Note that at the module level, :func:`locals` and :func:`globals` are the same dictionary.
el: Ενημέρωση και επιστροφή ενός λεξικού που αντιπροσωπεύει τον τρέχοντα πίνακα τοπικών συμβόλων. Οι ελεύθερες μεταβλητές επιστρέφονται από :func:`locals` όταν καλείται σε μπλοκ συναρτήσεων, αλλά όχι σε μπλοκ κλάσεων. Σημειώστε ότι σε επίπεδο module, οι :func:`locals` και :func:`globals` είναι το ίδιο λεξικό.

source: The contents of this dictionary should not be modified; changes may not affect the values of local and free variables used by the interpreter.
el: Τα περιεχόμενα αυτού του λεξικού δεν πρέπει να τροποποιηθούν∙ οι αλλαγές ενδέχεται να μην επηρεάσουν τις τιμές των τοπικών και ελεύθερων μεταβλητών που χρησιμοποιούνται από τον διερμηνέα.

source: Return an iterator that applies *function* to every item of *iterable*, yielding the results. If additional *iterables* arguments are passed, *function* must take that many arguments and is applied to the items from all iterables in parallel. With multiple iterables, the iterator stops when the shortest iterable is exhausted. For cases where the function inputs are already arranged into argument tuples, see :func:`itertools.starmap`\.
el: Επιστρέφει έναν iterator που εφαρμόζει *function* σε κάθε στοιχείο του *iterable*, δίνοντας τα αποτελέσματα. Εάν περάσουν επιπλέον ορίσματα *iterables*, η *function* πρέπει να λάβει τόσα ορίσματα και να εφαρμόζεται στα στοιχεία από όλα τα iterables παράλληλα. Με πολλαπλούς iterables, ο iterator σταματά όταν εξαντληθεί ο συντομότερος iterable. Για περιπτώσεις όπου οι είσοδοι συνάρτησης είναι ήδη διατεταγμένες σε πλειάδες ορισμάτων, βλέπε :func:`itertools.starmap`\.

source: Return the largest item in an iterable or the largest of two or more arguments.
el: Επιστρέφει το μεγαλύτερο στοιχείο σε ένα iterable ή το μεγαλύτερο από δύο ή περισσότερα ορίσματα.

source: If one positional argument is provided, it should be an :term:`iterable`. The largest item in the iterable is returned. If two or more positional arguments are provided, the largest of the positional arguments is returned.
el: Εάν παρέχεται ένα όρισμα θέσης, θα πρέπει να είναι ένα :term:`iterable`. Επιστρέφεται το μεγαλύτερο στοιχείο στο iterable. Εάν παρέχονται δύο ή περισσότερα ορίσματα θέσης, επιστρέφεται το μεγαλύτερο από τα ορίσματα θέσης.

source: There are two optional keyword-only arguments. The *key* argument specifies a one-argument ordering function like that used for :meth:`list.sort`. The *default* argument specifies an object to return if the provided iterable is empty. If the iterable is empty and *default* is not provided, a :exc:`ValueError` is raised.
el: Υπάρχουν δύο προαιρετικά ορίσματα τύπου λέξη-κλειδί. Το όρισμα *key* καθορίζει μια συνάρτηση ταξινόμησης ενός ορίσματος όπως αυτή χρησιμοποιείται για το :meth:`list.sort`. Το όρισμα *default* καθορίζει ένα αντικείμενο που θα επιστρέψει εάν το iterable που παρέχεται είναι κενό. Εάν το iterable είναι κενό και το *default* δεν παρέχεται, γίνεται raise μια :exc:`ValueError`.

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
el: Εάν πολλά στοιχεία είναι μέγιστα, η συνάρτηση επιστρέφει το πρώτο που συναντήθηκε. Αυτό είναι σύμφωνο με άλλα εργαλεία διατήρησης σταθερότητας ταξινόμησης όπως ``sorted(iterable, key=keyfunc, reverse=True)[0]`` και ``heapq.nlargest(1, iterable, key=keyfunc)``.

source: Added the *default* keyword-only parameter.
el: Προστέθηκε η παράμετρος μόνο λέξης-κλειδί *default*.

source: The *key* can be ``None``.
el: Το *key* μπορεί να είναι ``None``.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
el: Επιστρέφει ένα αντικείμενο "memory view" που δημιουργήθηκε από το συγκεκριμένο όρισμα. Βλέπε :ref:`typememoryview` για περισσότερες λεπτομέρειες.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
el: Επιστρέφει το μικρότερο στοιχείο σε έναν iterable ή το μικρότερο από δύο ή περισσότερα ορίσματα.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
el: Εάν παρέχεται ένα όρισμα θέσης, θα πρέπει να είναι ένα :term:`iterable`. Επιστρέφει το μικρότερο στοιχείο στον iterable. Εάν παρέχονται δύο ή περισσότερα ορίσματα θέσης, επιστρέφεται το μικρότερο από τα ορίσματα θέσης.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
el: Εάν πολλά στοιχεία είναι ελάχιστα, η συνάρτηση επιστρέφει το πρώτο που συναντήθηκε. Αυτό είναι σύμφωνο με άλλα εργαλεία διατήρησης σταθερότητας ταξινόμησης, όπως ``sorted(iterable, key=keyfunc)[0]`` και ``heapq.nsmallest(1, iterable, key=keyfunc)``.

source: Retrieve the next item from the :term:`iterator` by calling its :meth:`~iterator.__next__` method. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopIteration` is raised.
el: Ανάκτηση του επόμενου στοιχείο από το :term:`iterator` καλώντας τη μέθοδο :meth:`~iterator.__next__`. Εάν δοθεί *default*, επιστρέφεται εάν ο iterator έχει εξαντληθεί, διαφορετικά γίνεται raise μια :exc:`StopIteration`.

source: Return a new featureless object. :class:`object` is a base for all classes. It has methods that are common to all instances of Python classes. This function does not accept any arguments.
el: Επιστρέφει ένα νέο αντικείμενο χωρίς χαρακτηριστικά. Το :class:`object` είναι μια βάση για όλες τις κλάσεις. Έχει μεθόδους που είναι κοινές σε όλες τις περιπτώσεις κλάσεων Python. Αυτή η συνάρτηση δεν δέχεται ορίσματα.

source: :class:`object` does *not* have a :attr:`~object.__dict__`, so you can't assign arbitrary attributes to an instance of the :class:`object` class.
el: Το :class:`object` *δεν* έχει :attr:`~object.__dict__` επομένως δεν μπορείτε να εκχωρήσετε αυθαίρετα χαρακτηριστικά σε ένα instance της κλάσης :class:`object`.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. For example:
el: Μετατρέπει έναν ακέραιο αριθμό σε μια οκταδική συμβολοσειρά με πρόθεμα "0o". Το αποτέλεσμα είναι μια έγκυρη έκφραση Python. Εάν το *x* δεν είναι ένα αντικείμενο Python :class:`int`, πρέπει να ορίσει μια μέθοδο :meth:`~object.__index__` που επιστρέφει έναν ακέραιο αριθμό. Για παράδειγμα:

source: If you want to convert an integer number to an octal string either with the prefix "0o" or not, you can use either of the following ways.
el: Εάν θέλετε να μετατρέψετε έναν ακέραιο αριθμό σε οκταδική συμβολοσειρά είτε με το πρόθεμα "0o" είτε όχι, μπορείτε να χρησιμοποιήσετε έναν από τους παρακάτω τρόπους.

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
el: Ανοίγει το *file* και επιστρέφει ένα αντίστοιχο :term:`file object`. Εάν το αρχείο δεν μπορεί να ανοίξει, γίνεται raise μια :exc:`OSError`. Δείτε το :ref:`tut-files` για περισσότερα παραδείγματα χρήσης αυτής της συνάρτησης.

source: *file* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the file to be opened or an integer file descriptor of the file to be wrapped. (If a file descriptor is given, it is closed when the returned I/O object is closed unless *closefd* is set to ``False``.)
el: Το *αρχείο* είναι ένα :term:`path-like object` που δίνει το όνομα διαδρομής (απόλυτο ή σε σχέση με τον τρέχοντα κατάλογο εργασίας) του αρχείου που θα ανοίξει ή ένας ακέραιος περιγραφέας αρχείου του αρχείου που πρόκειται να αναδιπλωθεί. (Εάν δίνεται ένας περιγραφέας αρχείου, κλείνει όταν το επιστρεφόμενο αντικείμενο I/O είναι κλειστό εκτός εάν *closefd* έχει οριστεί ως ``False``.)

source: *mode* is an optional string that specifies the mode in which the file is opened. It defaults to ``'r'`` which means open for reading in text mode. Other common values are ``'w'`` for writing (truncating the file if it already exists), ``'x'`` for exclusive creation, and ``'a'`` for appending (which on *some* Unix systems, means that *all* writes append to the end of the file regardless of the current seek position). In text mode, if *encoding* is not specified the encoding used is platform-dependent: :func:`locale.getencoding()` is called to get the current locale encoding. (For reading and writing raw bytes use binary mode and leave *encoding* unspecified.) The available modes are:
el: Το *mode* είναι μια προαιρετική συμβολοσειρά που καθορίζει τη λειτουργία στην οποία ανοίγει το αρχείο. Από προεπιλογή είναι ``'r'`` που σημαίνει ανοιχτό για ανάγνωση σε λειτουργία κειμένου. Άλλες κοινές τιμές είναι ``'w'`` για εγγραφή (περικοπή του αρχείου εάν υπάρχει ήδη), ``'x'`` για αποκλειστική δημιουργία και ``'a'`` για προσθήκη (κάτι που σε *μερικά* συστήματα Unix, σημαίνει ότι *όλες* οι εγγραφές προσαρτώνται στο τέλος του αρχείου ανεξάρτητα από την τρέχουσα θέση αναζήτησης). Στη λειτουργία κειμένου, εάν δεν έχει καθοριστεί το *encoding*, η κωδικοποίηση που χρησιμοποιείται εξαρτάται από την πλατφόρμα: :func:`locale.getencoding()` καλείται για να ληφθεί η τρέχουσα κωδικοποίηση τοπικών ρυθμίσεων. (Για την ανάγνωση και την εγγραφή ακατέργαστων bytes χρησιμοποιείται δυαδική λειτουργία και αφήνουν το *encoding* απροσδιόριστο.) Οι διαθέσιμες λειτουργίες είναι:

source: Character
el: Χαρακτήρας

source: Meaning
el: Έννοια

source: open for reading (default)
el: άνοιγμα για ανάγνωση (default)

source: open for writing, truncating the file first
el: άνοιγμα για εγγραφή, περικόπτοντας πρώτα το αρχείο

source: open for exclusive creation, failing if the file already exists
el: άνοιγμα για αποκλειστική δημιουργία, αποτυγχάνοντας εάν το αρχείο υπάρχει ήδη

source: open for writing, appending to the end of file if it exists
el: άνοιγμα για εγγραφή, προσαρτάται στο τέλος του αρχείου εάν υπάρχει

source: binary mode
el: δυαδική (binary) λειτουργία

source: text mode (default)
el: λειτουργία κειμένου (default)

source: open for updating (reading and writing)
el: άνοιγμα για ενημέρωση (ανάγνωση και εγγραφή)

source: The default mode is ``'r'`` (open for reading text, a synonym of ``'rt'``). Modes ``'w+'`` and ``'w+b'`` open and truncate the file. Modes ``'r+'`` and ``'r+b'`` open the file with no truncation.
el: Η προεπιλεγμένη λειτουργία είναι ``'r'`` (ανοίγει για ανάγνωση κειμένου, συνώνυμο του ``'rt'``). Οι λειτουργίες ``'w+'`` και ``'w+b'`` ανοίγει και περικόβει το αρχείο. Οι λειτουργίες ``'r+'`` and ``'r+b'`` ανοίγουν το αρχείο χωρίς περικοπή.

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
el: Όπως αναφέρεται στο :ref:`io-overview`, η Python κάνει διάκριση μεταξύ δυαδικού και κειμένου I/O. Τα αρχεία που ανοίγουν σε δυαδική λειτουργία (συμπεριλαμβανομένου του ``'b'`` στο όρισμα *mode*) επιστρέφουν τα περιεχόμενα ως :class:`bytes` αντικείμενα χωρίς αποκωδικοποίηση. Στη λειτουργία κειμένου (η προεπιλογή, ή όταν το ``'t'`` περιλαμβάνεται στο όρισμα *mode*), τα περιεχόμενα του αρχείου επιστρέφονται ως :class:`str`, τα bytes έχουν πρώτα αποκωδικοποιηθεί χρησιμοποιώντας μια εξαρτώμενη από πλατφόρμα κωδικοποίηση ή χρήση της καθορισμένης *κωδικοποίησης* εάν δίνεται.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
el: Η Python δεν εξαρτάται από την έννοια των αρχείων κειμένου του υποκείμενου λειτουργικού συστήματος∙ όλη η επεξεργασία γίνεται από την ίδια την Python και επομένως είναι ανεξάρτητη από την πλατφόρμα.

source: *buffering* is an optional integer used to set the buffering policy. Pass 0 to switch buffering off (only allowed in binary mode), 1 to select line buffering (only usable when writing in text mode), and an integer > 1 to indicate the size in bytes of a fixed-size chunk buffer. Note that specifying a buffer size this way applies for binary buffered I/O, but ``TextIOWrapper`` (i.e., files opened with ``mode='r+'``) would have another buffering. To disable buffering in ``TextIOWrapper``, consider using the ``write_through`` flag for :func:`io.TextIOWrapper.reconfigure`. When no *buffering* argument is given, the default buffering policy works as follows:
el: To *buffering* είναι ένας προαιρετικός ακέραιος που χρησιμοποιείται για το ορισμό της πολιτικής αποθήκευσης στην προσωρινή μνήμη. Περνάει το 0 για να απενεργοποιήσετε την προσωρινή μνήμη (επιτρέπεται μόνο σε δυαδική λειτουργία), το 1 για να επιλέξετε προσωρινή αποθήκευση γραμμής (μπορεί να χρησιμοποιηθεί μόνο όταν γράφετε σε λειτουργία κειμένου) και έναν ακέραιο > 1 για να υποδείξει το μέγεθος σε byte μιας προσωρινής μνήμης τμημάτων σταθερού μεγέθους. Λάβετε υπόψη ότι ο καθορισμός ενός μεγέθους buffer με αυτόν τον τρόπο ισχύει για I/O με δυαδική προσωρινή μνήμη, αλλά το ``TextIOWrapper`` (δηλαδή, τα αρχεία που ανοίγουν με ``mode='r+'``) θα έχουνε άλλη αποθήκευση. Για να απενεργοποιήσετε την προσωρινή αποθήκευση στο ``TextIOWrapper``, εξετάστε το ενδεχόμενο να χρησιμοποιήσετε μια ``write_through`` σημαία για :func:`io.TextIOWrapper.reconfigure`. Όταν δεν δίνεται όρισμα *buffering*, η προεπιλεγμένη πολιτική προσωρινής αποθήκευσης λειτουργεί ως εξής:

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :const:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
el: Τα δυαδικά αρχεία αποθηκεύονται στην προσωρινή μνήμη σε κομμάτια σταθερού μεγέθους∙ το μέγεθος του buffer επιλέγεται χρησιμοποιώντας μια ευρετική που προσπαθεί να προσδιορίσει το "μέγεθος του μπλοκ" της υποκείμενης συσκευής και επανέρχεται σε :const:`io.DEFAULT_BUFFER_SIZE`. Σε πολλά συστήματα, η προσωρινή μνήμη θα έχει συνήθως μήκος 4096 ή 8192 bytes.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
el: "Interactive" αρχεία κειμένου (αρχεία για τα οποία το :meth:`~io.IOBase.isatty` επιστρέφει ``True``) χρησιμοποιούν αποθήκευση γραμμής. Άλλα αρχεία κειμένου χρησιμοποιούν την πολιτική που περιγράφεται παραπάνω για δυαδικά αρχεία.

source: *encoding* is the name of the encoding used to decode or encode the file. This should only be used in text mode. The default encoding is platform dependent (whatever :func:`locale.getencoding` returns), but any :term:`text encoding` supported by Python can be used. See the :mod:`codecs` module for the list of supported encodings.
el: Το *encoding* είναι το όνομα της κωδικοποίησης που χρησιμοποιείται για την αποκωδικοποίηση ή την κωδικοποίηση του αρχείου. Θα πρέπει να χρησιμοποιείται μόνο σε λειτουργία κειμένου. Η προεπιλεγμένη κωδικοποίηση εξαρτάται από την πλατφόρμα (οτιδήποτε επιστρέφει η :func:`locale.getencoding`), αλλά οποιοδήποτε :term:`text encoding` που υποστηρίζεται από την Python. Δείτε το module :mod:`codecs` για τη λίστα των υποστηριζόμενων κωδικοποιήσεων.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
el: Το *errors* είναι μια προαιρετική συμβολοσειρά που καθορίζει τον τρόπο χειρισμού των σφαλμάτων κωδικοποίησης και αποκωδικοποίησης-αυτό δεν μπορεί να χρησιμοποιηθεί σε δυαδική λειτουργία. Διατίθεται μια ποικιλία τυπικών εργαλείων χειρισμού σφαλμάτων (παρατίθενται στην ενότητα :ref:`error-handlers`), αν και οποιοδήποτε όνομα χειρισμού σφαλμάτων έχει καταχωρηθεί με το :func:`codecs.register_error` είναι επίσης έγκυρο. Τα τυπικά ονόματα περιλαμβάνουν:

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
el: Το ``'strict'`` κάνει raise μια εξαίρεση :exc:`ValueError` εάν υπάρχει σφάλμα κωδικοποίησης. Η προεπιλεγμένη τιμή του ``None`` έχει το ίδιο αποτέλεσμα.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
el: Το ``'ignore'`` αγνοεί τα σφάλματα. Σημειώστε ότι η παράβλεψη σφαλμάτων κωδικοποίησης μπορεί να οδηγήσει σε απώλεια δεδομένων.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
el: Το ``'replace'`` προκαλεί την εισαγωγή ενός δείκτη αντικατάστασης (όπως ``'?'``) όταν υπάρχουν δεδομένα με λανθασμένη μορφή.

source: ``'surrogateescape'`` will represent any incorrect bytes as low surrogate code units ranging from U+DC80 to U+DCFF. These surrogate code units will then be turned back into the same bytes when the ``surrogateescape`` error handler is used when writing data. This is useful for processing files in an unknown encoding.
el: Το ``'surrogateescape'`` θα αντιπροσωπεύει τυχόν λανθασμένα bytes ως μονάδες χαμηλού υποκατάστατου κωδικού που κυμαίνονται από U+DC80 έως U+DCFF. Αυτές οι μονάδες υποκατάστατου κωδικού θα μετατραπούν στη συνέχεια στα ίδια bytes όταν ο χειριστής σφαλμάτων ``surrogateescape`` χρησιμοποιείται κατά την εγγραφή δεδομένων. Αυτό είναι χρήσιμο για την επεξεργασία αρχείων σε άγνωστη κωδικοποίηση.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference :samp:`&#{nnn};`.
el: Το ``'xmlcharrefreplace'`` υποστηρίζεται μόνο κατά την εγγραφή σε αρχείο. Οι χαρακτήρες που δεν υποστηρίζονται από την κωδικοποίηση αντικαθίστανται με την κατάλληλη αναφορά χαρακτήρων XML :samp:`&#{nnn};`.

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
el: Το ``'backslashreplace'`` αντικαθιστά δεδομένα με λανθασμένη μορφή από τις ακολουθίες διαφυγής με ανάστροφης καθέτου Python.

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
el: Το ``'namereplace'`` (υποστηρίζεται επίσης μόνο κατά τη σύνταξη) αντικαθιστά τους μη υποστηριζόμενους χαρακτήρες με ακολουθίες διαφυγής ``\N{...}``.

source: *newline* determines how to parse newline characters from the stream. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
el: Το *newline* καθορίζει τον τρόπο ανάλυσης χαρακτήρων νέας γραμμής από τη ροή. Μπορεί να είναι και ``None``, ``''``, ``'\n'``, ``'\r'``, και ``'\r\n'``. Λειτουργεί ως εξής:

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
el: Κατά την ανάγνωση εισόδου από την ροή, εάν το *newline* είναι ``None``, η καθολική λειτουργία νέων γραμμών είναι ενεργοποιημένη. Οι γραμμές στην είσοδο μπορούν να τελειώνουν σε ``'\n'``, ``'\r'``, ή ``'\r\n'``, και αυτά μεταφράζονται σε ``'\n'`` πριν επιστραφούν στον καλούντα. Εάν είναι ``''``, η καθολική λειτουργία νέων γραμμών είναι ενεργοποιημένη, αλλά οι καταλήξεις γραμμών επιστρέφονται στον καλούντα αμετάφραστα. Εάν έχει κάποια από τις άλλες νόμιμες τιμές, οι γραμμές εισόδου τερματίζονται μόνο από τη δεδομένη συμβολοσειρά και η κατάληξη γραμμής επιστρέφεται στον καλούντα αμετάφραστη.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
el: Κατά την εγγραφή εξόδου στη ροή, εάν το *newline* είναι ``None``, τυχόν χαρακτήρες ``'\n'`` μεταφράζονται στο διαχωριστικό προεπιλεγμένων γραμμών του συστήματος, :data:`os.linesep`. Εάν το *newline* είναι ``''`` ή ``'\n'``, δεν πραγματοποιείται μετάφραση εάν το *newline* είναι οποιαδήποτε από τις άλλες νόμιμες τιμές, γράφονται οποιοιδήποτε χαρακτήρες ``'\n'`` μεταφράζονται στη δεδομένη συμβολοσειρά.

source: If *closefd* is ``False`` and a file descriptor rather than a filename was given, the underlying file descriptor will be kept open when the file is closed. If a filename is given *closefd* must be ``True`` (the default); otherwise, an error will be raised.
el: Εάν το *closefd* είναι ``False`` και έχει δοθεί ένας περιγραφέας αρχείου αντί για ένα όνομα αρχείου, ο υποκειμενικός περιγραφέας αρχείου θα παραμείνει ανοιχτός όταν το αρχείο κλείσει. Εάν δοθεί ένα όνομα αρχείου το *closefd* πρέπει να είναι ``True`` (η προεπιλογή)∙ διαφορετικά, θα προκύψει ένα σφάλμα.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
el: Ένα προσαρμοσμένο πρόγραμμα ανοίγματος μπορεί να χρησιμοποιηθεί μεταβιβάζοντας ένα callable ως *opener*. Ο υποκείμενος περιγραφέας αρχείου για το αντικείμενο αρχείου λαμβάνεται στη συνέχεια καλώντας το *opener* με (*file*, *flags*). Το *opener* πρέπει να επιστρέψει ένα περιγραφέα ανοιχτού αρχείου (περνώντας :mod:`os.open` ως *opener* έχει ως αποτέλεσμα λειτουργικότητας παρόμοια με το να περάσουμε το ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
el: Το νέο δημιουργημένο αρχείο είναι :ref:`non-inheritable <fd_inheritance>`.

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
el: Το παρακάτω παράδειγμα χρησιμοποιεί την παράμετρο :ref:`dir_fd <dir_fd>` της συνάρτησης :func:`os.open` για να ανοίξει ένα αρχείο σε σχέση με έναν δεδομένο κατάλογο::
