Repository: pygreece/python-docs-gr
Catalog: library/functions.po
Languages: el

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
el: Ο τύπος του :term:`file object` που επιστρέφεται από τη συνάρτηση :func:`open` εξαρτάται από τη λειτουργία. Όταν το :func:`open` χρησιμοποιείται για το άνοιγμα ενός αρχείου σε λειτουργία κειμένου (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, κ.λπ.), επιστρέφει μια υποκλάση του :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). Όταν χρησιμοποιείται για το άνοιγμα ενός αρχείου σε δυαδική λειτουργία με προσωρινή αποθήκευση, η κλάση που επιστρέφεται είναι μια υποκλάση του :class:`io.BufferedIOBase`. Η ακριβής κλάση ποικίλλει: σε λειτουργία δυαδικής ανάγνωσης, επιστρέφει ένα :class:`io.BufferedReader` ∙ σε δυαδικές καταστάσεις εγγραφής και δυαδικής προσθήκης, επιστρέφει ένα :class:`io.BufferedWriter`, και στη λειτουργία ανάγνωσης/εγγραφής, επιστρέφει ένα :class:`io.BufferedRandom`. Όταν η προσωρινή αποθήκευση είναι απενεργοποιημένη, επιστρέφεται, η ακατέργαστη ροή , μια υποκλάση :class:`io.RawIOBase`, :class:`io.FileIO`.

source: See also the file handling modules, such as :mod:`fileinput`, :mod:`io` (where :func:`open` is declared), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, and :mod:`shutil`.
el: Δείτε επίσης τις ενότητες διαχείρισης αρχείων, όπως :mod:`fileinput`, :mod:`io` (όπου ορίζεται η :func:`open`), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, και :mod:`shutil`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``file``, ``mode``, ``flags``.
el: Εγείρει ένα :ref:`auditing event <auditing>` ``open`` με ορίσματα ``file``, ``mode``, ``flags``.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
el: Τα ορίσματα ``mode`` και ``flags`` μπορεί να έχουν τροποποιηθεί ή να έχουν συναχθεί από την αρχική κλήση.

source: The *opener* parameter was added.
el: Προστέθηκε η παράμετρος *opener*.

source: The ``'x'`` mode was added.
el: Προστέθηκε η λειτουργία ``'x'``.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
el: Το :exc:`IOError` γινόταν raise παλιά, τώρα είναι ψευδώνυμο του :exc:`OSError`.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
el: Το :exc:`FileExistsError` γίνεται raise τώρα εάν το αρχείο που ανοίγει σε λειτουργία αποκλειστικής δημιουργίας (``'x'``) υπάρχει ήδη.

source: The file is now non-inheritable.
el: Το αρχείο είναι πλέον μη κληρονομικό.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
el: Εάν η κλήση συστήματος διακοπεί και ο χειριστής σήματος δεν κάνει raise μια εξαίρεση, η συνάρτηση επαναλαμβάνει τώρα την κλήση συστήματος αντί να κάνει raise μια εξαίρεση :exc:`InterruptedError` (δείτε το :pep:`475` για το σκεπτικό).

source: The ``'namereplace'`` error handler was added.
el: Προστέθηκε το πρόγραμμα χειρισμού σφαλμάτων ``'namereplace'``.

source: Support added to accept objects implementing :class:`os.PathLike`.
el: Προστέθηκε υποστήριξη για την αποδοχή αντικειμένων που υλοποιούν :class:`os.PathLike`.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
el: Στα Windows, το άνοιγμα μιας προσωρινής μνήμης κονσόλας μπορεί να επιστρέψει μια υποκλάση του :class:`io.RawIOBase` εκτός από το :class:`io.FileIO`.

source: The ``'U'`` mode has been removed.
el: Η λειτουργία ``'U'`` έχει αφαιρεθεί.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
el: Δεδομένου μιας συμβολοσειράς που αντιπροσωπεύει έναν χαρακτήρα Unicode, επιστρέφει έναν ακέραιο που αντιπροσωπεύει το σημείο κωδικού Unicode αυτού του χαρακτήρα. Για παράδειγμα, το ``ord('a')`` επιστρέφει τον ακέραιο αριθμό ``97`` και ``ord('€')`` (σύμβολο του ευρώ) επιστρέφει ``8364``. Αυτό είναι το αντίστροφο του :func:`chr`.

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
el: Επιστρέφει *base* στην δύναμη *exp*∙ εάν υπάρχει το *mod*, επιστρέφει *base* στην δύναμη *exp*, modulo *mod* (υπολογίζεται πιο αποτελεσματικά από το ``pow(base, exp) % mod``). Η φόρμα δύο ορισμάτων ``pow(base, exp)`` ισοδυναμεί με τη χρήση του τελεστή δύναμης: ``base**exp``.

source: The arguments must have numeric types. With mixed operand types, the coercion rules for binary arithmetic operators apply. For :class:`int` operands, the result has the same type as the operands (after coercion) unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``pow(10, 2)`` returns ``100``, but ``pow(10, -2)`` returns ``0.01``. For a negative base of type :class:`int` or :class:`float` and a non-integral exponent, a complex result is delivered. For example, ``pow(-9, 0.5)`` returns a value close to ``3j``.
el: Τα ορίσματα πρέπει να έχουνε αριθμητικούς τύπους. Με μεικτούς τύπους τελεστών, ισχύουν οι κανόνες εξαναγκασμού για δυαδικούς τελεστές αριθμητικής. Για του τελεστές :class:`int`, το αποτέλεσμα έχει τον ίδιο τύπο με τους τελεστές (μετά τον εξαναγκασμό), εκτός εάν το δεύτερο όρισμα είναι αρνητικό∙ σε αυτή την περίπτωση, όλα τα ορίσματα μετατρέπονται σε float και επιστρέφεται ένα αποτέλεσμα τύπους float. Για παράδειγμα, ``pow(10, 2)`` επιστρέφει ``100``, αλλά το ``pow(10, -2)`` επιστρέφει ``0.01``. Για μια αρνητική βάση τύπου :class:`int` ή :class:`float` και έναν μη αναπόσπαστο εκθέτη, παραδίδεται ένα μιγαδικό αποτέλεσμα. Για παράδειγμα, ``pow(-9, 0.5)`` επιστρέφει μια τιμή κοντά στο ``3j``.

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
el: Για τους τελεστές της :class:`int` *base* και *exp*, εάν υπάρχει *mod*, το *mod* πρέπει επίσης να είναι ακεραίου τύπου και το *mod* πρέπει να είναι μη μηδενικό. Εάν υπάρχει *mod* και το *exp* είναι αρνητικό, το *base* πρέπει να είναι σχετικά πρώτο στο *mod*. Σε αυτήν την περίπτωση , επιστρέφεται το ``pow(inv_base, -exp, mod)``, όπου το *inv_base* είναι αντίστροφο του *base* modulo *mod*.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
el: Ακολουθεί ένα παράδειγμα υπολογισμού ενός αντίστροφου για το ``38`` modulo ``97``::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
el: Για του τελεστές :class:`int`, η μορφή τριών ορισμών του ``pow`` επιτρέπει τώρα το δεύτερο όρισμα να είναι αρνητικό, επιτρέποντας τον υπολογισμό των αρθρωτών αντίστροφων.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
el: Επιτρέπονται ορίσματα keyword. Παλαιότερα, υποστηρίζονταν μόνο ορίσματα θέσης.

source: Print *objects* to the text stream *file*, separated by *sep* and followed by *end*. *sep*, *end*, *file*, and *flush*, if present, must be given as keyword arguments.
el: Εκτυπώνει *objects* στην ροή κειμένου *file*, χωρισμένα με *sep* και ακολουθούμενα από *end*. Τα *sep*, *end*, *file*, και *flush*, εάν υπάρχουν, πρέπει να δίνονται ως ορίσματα keyword.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
el: Όλα τα μη keyword ορίσματα μετατρέπονται σε συμβολοσειρές όπως κάνει η :func:`str` και γράφονται στη ροή, χωρισμένα με *sep* και ακολουθούνται από *end*. Και τα δύο *sep* και *end* πρέπει να είναι συμβολοσειρές∙ μπορεί επίσης να είναι ``None``, που σημαίνει ότι θα χρησιμοποιηθούν οι προεπιλεγμένες τιμές. Εάν δεν δίνονται *αντικείμενα*, η :func:`print` θα γράψει απλά *end*.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
el: Το όρισμα *file* πρέπει να είναι αντικείμενο με μια μέθοδο ``write(string)``∙ εάν δεν υπάρχει ή είναι ``None``, θα χρησιμοποιηθεί το :data:`sys.stdout`. Επειδή τα τυπωμένα ορίσματα μετατρέπονται σε συμβολοσειρές κειμένου, η :func:`print` δεν μπορεί να χρησιμοποιηθεί με αντικείμενα αρχείου δυαδικής λειτουργίας. Για αυτά, χρησιμοποιούμε το ``file.write(...)``.

source: Output buffering is usually determined by *file*. However, if *flush* is true, the stream is forcibly flushed.
el: Η προσωρινή αποθήκευση εξόδου καθορίζεται συνήθως από το *αρχείο*. Ωστόσο, εάν το *flush* είναι αληθές, η ροή ξεπλένεται αναγκαστικά.

source: Added the *flush* keyword argument.
el: Προστέθηκε το όρισμα keyword *flush*.

source: Return a property attribute.
el: Επιστρέφει ένα χαρακτηριστικό ιδιότητας.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
el: Το *fget* είναι μια συνάρτηση για τη λήψη μιας τιμής χαρακτηριστικού. Το *fset* είναι μια συνάρτηση για τον ορισμό μιας τιμής χαρακτηριστικού. Το *fdel* είναι μια συνάρτηση για τη διαγραφή μιας τιμής χαρακτηριστικού. Και το *doc* δημιουργεί μια συμβολοσειρά εγγράφων για το χαρακτηριστικό.

source: A typical use is to define a managed attribute ``x``::
el: Μια τυπική χρήση είναι ο ορισμός ενός διαχειριζόμενου χαρακτηριστικού ``x``::

source: If *c* is an instance of *C*, ``c.x`` will invoke the getter, ``c.x = value`` will invoke the setter, and ``del c.x`` the deleter.
el: Εάν το *c* είναι ένα instance του *C*, το ``c.x`` θα καλέσει τον λήπτη, το ``c.x = value` θα καλέσει τον ρυθμιστή, και το ``del c.x`` τον διαγραφέα.

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
el: Εάν δίνεται, το *doc* θα είναι το docstring του χαρακτηριστικού ιδιότητας. Διαφορετικά , η ιδιότητα θα αντιγράψει τη συμβολοσειρά του *fget* (εάν υπάρχει). Αυτό καθιστά δυνατή τη δημιουργία ιδιοτήτων μόνο για ανάγνωση, εύκολα χρησιμοποιώντας τη :func:`property` ως :term:`decorator`::

source: The ``@property`` decorator turns the :meth:`!voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
el: Ο decorator ``@property`` μετατρέπει την μέθοδο :meth:`!voltage` σε "getter" για ένα χαρακτηριστικό μόνο για ανάγνωση με το ίδιο όνομα, και ορίζει τη συμβολοσειρά εγγράφων για *voltage* σε "Get the current voltage."

source: A property object has ``getter``, ``setter``, and ``deleter`` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example:
el: Ένα αντικείμενο ιδιότητας έχει μεθόδους ``getter``, ``setter``, και ``deleter`` που μπορούν να χρησιμοποιηθούν ως διακοσμητές που δημιουργούν ένα αντίγραφο της ιδιότητας με την αντίστοιχη συνάρτηση accessor που έχει οριστεί στον decorator. Αυτό εξηγείται καλύτερα με ένα παράδειγμα:

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
el: Αυτός ο κώδικας είναι ακριβώς ισοδύναμος με το πρώτο παράδειγμα. Φροντίστε να δώσετε στις πρόσθετες συναρτήσεις το ίδιο όνομα με την αρχική ιδιότητα (``x`` σε αυτήν την περίπτωση.)

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
el: Το επιστρεφόμενο αντικείμενο ιδιότητας έχει επίσης τα χαρακτηριστικά ``fget``, ``fset``, και ``fdel`` που αντιστοιχούν στα ορίσματα του κατασκευαστή.

source: The docstrings of property objects are now writeable.
el: Τα *docstrings* των αντικειμένων ιδιότητας είναι πλέον εγγράψιμες.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
el: Αντί να είναι συνάρτηση, το :class:`range` είναι στην πραγματικότητα ένας αμετάβλητος τύπος ακολουθίας, όπως τεκμηριώνεται στα :ref:`typesseq-range` και :ref:`typesseq`.

source: Return a string containing a printable representation of an object. For many types, this function makes an attempt to return a string that would yield an object with the same value when passed to :func:`eval`; otherwise, the representation is a string enclosed in angle brackets that contains the name of the type of the object together with additional information often including the name and address of the object. A class can control what this function returns for its instances by defining a :meth:`~object.__repr__` method. If :func:`sys.displayhook` is not accessible, this function will raise :exc:`RuntimeError`.
el: Επιστρέφει μια συμβολοσειρά που περιέχει μια εκτυπώσιμη αναπαράσταση ενός αντικειμένου. Για πολλούς τύπους, αυτή η συνάρτηση κάνει μια προσπάθεια να επιστρέψει μια συμβολοσειρά που θα απέδιδε ένα αντικείμενο με την ίδια τιμή όταν μεταβιβαζόταν στο :func:`eval`∙ διαφορετικά, η αναπαράσταση είναι μια συμβολοσειρά που περικλείεται σε αγκύλες που περιέχει το όνομα του τύπου του αντικειμένου μαζί με πρόσθετες πληροφορίες που συχνά περιλαμβάνουν το όνομα και τη διεύθυνση του αντικειμένου. Μια κλάση μπορεί να ελέγξει τι επιστρέφει αυτή η συνάρτηση για τις οντότητες της ορίζοντας μια μέθοδο :meth:`~object.__repr__`. Εάν η :func:`sys.displayhook` δεν είναι προσβάσιμη, αυτή η συνάρτηση θα κάνει raise το :exc:`RuntimeError`.

source: This class has a custom representation that can be evaluated::
el: Αυτή η κλάση έχει μια προσαρμοσμένη αναπαράσταση που μπορεί να αξιολογηθεί::

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`~object.__reversed__` method or supports the sequence protocol (the :meth:`~object.__len__` method and the :meth:`~object.__getitem__` method with integer arguments starting at ``0``).
el: Επιστρέφει ένα αντίστροφο :term:`iterator`. Το *seq* πρέπει να είναι ένα αντικείμενο που έχει μια μέθοδο :meth:`~object.__reversed__` ή υποστηρίζει το πρωτόκολλο ακολουθίας (η μέθοδος :meth:`~object.__len__` και η μέθοδος :meth:`~object.__getitem__` με ακέραια ορίσματα που ξεκινούν από ``0``).

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
el: Επιστρέφει τον *number* στρογγυλοποιημένο σε *ndigits* ακρίβεια μετά την υποδιαστολή. Εάν το *ndigits* παραληφθεί ή είναι ``None``, επιστρέφει τον πλησιέστερο ακέραιο αριθμό στην είσοδό του.

source: For the built-in types supporting :func:`round`, values are rounded to the closest multiple of 10 to the power minus *ndigits*; if two multiples are equally close, rounding is done toward the even choice (so, for example, both ``round(0.5)`` and ``round(-0.5)`` are ``0``, and ``round(1.5)`` is ``2``). Any integer value is valid for *ndigits* (positive, zero, or negative). The return value is an integer if *ndigits* is omitted or ``None``. Otherwise, the return value has the same type as *number*.
el: Για του ενσωματωμένους τύπους που υποστηρίζουν τη :func:`round`, οι τιμές στρογγυλοποιούνται στο πλησιέστερο πολλαπλάσιο του 10 στην δύναμη μείον *ndigits*∙ εάν δύο πολλαπλάσια είναι εξίσου κοντά, η στρογγυλοποίηση γίνεται προς την άρτια επιλογή (έτσι, για παράδειγμα, τόσο το ``round(0.5)`` και ``round(-0.5)`` είναι ``0``, και ``round(1.5)`` είναι ``2``). Οποιαδήποτε ακέραια τιμή είναι έγκυρη για *ndigits* (θετική, μηδενική, ή αρνητική). Η επιστρεφόμενη τιμή είναι ακέραιος εάν το *ndigits* παραλειφθεί ή είναι ``None``. Διαφορετικά, η τιμή επιστροφής έχει τον ίδιο τύπο με το *number*.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
el: Για ένα γενικό αντικείμενο Python ``number``, ``round`` εκχωρεί στο ``number.__round__``.

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
el: Η συμπεριφορά του :func:`round` για floats μπορεί να είναι εκπληκτική: για παράδειγμα, το ``round(2.675, 2)`` δίνει ``2.67`` αντί για το αναμενόμενο ``2.68``. Αυτό δεν είναι bug: είναι αποτέλεσμα του γεγονότος ότι τα περισσότερα δεκαδικά κλάσματα δεν μπορούν να αναπαρασταθούν ακριβώς ως float. Δείτε το :ref:`tut-fp-issues` για περισσότερες πληροφορίες.

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
el: Επιστρέφει ένα νέο αντικείμενο :class:`set`, προαιρετικά με στοιχεία που λαμβάνονται από το *iterable*. Το ``set`` είναι μια ενσωματωμένη κλάση. Δείτε :class:`set` και :ref:`types-set` για τεκμηρίωση αυτής της κλάσης.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
el: Για άλλα containers, δείτε τις ενσωματωμένες κλάσεις :class:`frozenset`, :class:`list`, :class:`tuple`, και :class:`dict`, καθώς και το module :mod:`collections`.

source: This is the counterpart of :func:`getattr`. The arguments are an object, a string, and an arbitrary value. The string may name an existing attribute or a new attribute. The function assigns the value to the attribute, provided the object allows it. For example, ``setattr(x, 'foobar', 123)`` is equivalent to ``x.foobar = 123``.
el: Αυτό είναι το αντίστοιχο τους :func:`getattr`. Τα ορίσματα είναι ένα αντικείμενο, μια συμβολοσειρά και μια αυθαίρετη τιμή. Η συμβολοσειρά μπορεί να ονομάσει ένα υπάρχον χαρακτηριστικό ή ένα νέο χαρακτηριστικό. Η συνάρτηση εκχωρεί την τιμή στο χαρακτηριστικό, με την προϋπόθεση ότι το αντικείμενο το επιτρέπει. Για παράδειγμα ``setattr(x, 'foobar', 123)`` ισοδυναμεί με το ``x.foobar = 123``.

source: *name* need not be a Python identifier as defined in :ref:`identifiers` unless the object chooses to enforce that, for example in a custom :meth:`~object.__getattribute__` or via :attr:`~object.__slots__`. An attribute whose name is not an identifier will not be accessible using the dot notation, but is accessible through :func:`getattr` etc..
el: Το *name* δεν χρειάζεται να είναι αναγνωριστικό Python όπως ορίζεται στο :ref:`identifiers` , εκτός εάν το αντικείμενο επιλέξει να το επιβάλει αυτό, για παράδειγμα σε ένα προσαρμοσμένο :meth:`~object.__getattribute__` ή μέσω :attr:`~object.__slots__`. Ένα χαρακτηριστικό του οποίου το όνομα δεν είναι αναγνωριστικό δεν θα είναι προσβάσιμο χρησιμοποιώντας τη σημειογραφία, αλλά είναι προσβάσιμο μέσω του :func:`getattr` κ.λπ..

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to set it with :func:`setattr`.
el: Δεδομένου ότι το :ref:`private name mangling <private-name-mangling>` συμβαίνει κατά τη στιγμή της μεταγλώττισης, πρέπει κανείς να παραμορφώσει με μη αυτόματο τρόπο το όνομα ενός ιδιωτικού χαρακτηριστικού (χαρακτηριστικά με δύο προπορευόμενες κάτω παύλες) για να το ορίσει με :func:`setattr`.

source: Return a :term:`slice` object representing the set of indices specified by ``range(start, stop, step)``. The *start* and *step* arguments default to ``None``.
el: Επιστρέφετε ένα αντικείμενο :term:`slice` που αντιπροσωπεύει το σύνολο των δεικτών που καθορίζονται από το ``range(start, stop, step)``. Τα ορίσματα *start* και *step* είναι από προεπιλογή ``None``.

source: Slice objects have read-only data attributes :attr:`!start`, :attr:`!stop`, and :attr:`!step` which merely return the argument values (or their default). They have no other explicit functionality; however, they are used by NumPy and other third-party packages.
el: Τα αντικείμενα τμημάτων έχουν χαρακτηριστικά δεδομένων μόνο για ανάγνωση :attr:`!start`, :attr:`!stop`, και :attr:`!step` τα οποία απλώς επιστρέφουν τις τιμές του ορίσματος (ή την προεπιλογή τους). Δεν έχουνε άλλη ρητή λειτουργικότητα∙ ωστόσο, χρησιμοποιούνται από το NumPy και άλλα πακέτα τρίτων.

source: Slice objects are also generated when extended indexing syntax is used. For example: ``a[start:stop:step]`` or ``a[start:stop, i]``. See :func:`itertools.islice` for an alternate version that returns an :term:`iterator`.
el: Τα αντικείμενα slice δημιουργούνται επίσης όταν χρησιμοποιείται εκτεταμένη σύνταξη ευρετηρίου. Για παράδειγμα: ``a[start:stop:step]`` ή ``a[start:stop, i]``. Δείτε τη :func:`itertools.islice` για μια εναλλακτική έκδοση που επιστρέφει ένα :term:`iterator`.

source: Slice objects are now :term:`hashable` (provided :attr:`~slice.start`, :attr:`~slice.stop`, and :attr:`~slice.step` are hashable).
el: Τα αντικείμενα slice είναι πλέον :term:`hashable` (με την προϋπόθεση :attr:`~slice.start`, :attr:`~slice.stop`, και :attr:`~slice.step` μπορούν να κατακερματιστούν).

source: Return a new sorted list from the items in *iterable*.
el: Επιστρέφει μια νέα ταξινομημένη λίστα από τα στοιχεία στο *iterable*.

source: Has two optional arguments which must be specified as keyword arguments.
el: Έχει δύο προαιρετικά ορίσματα που πρέπει να καθοριστούν ως ορίσματα λέξεων-κλειδιών.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
el: Το *key* καθορίζει μια συνάρτηση ενός ορίσματος που χρησιμοποιείται για την εξαγωγή ενός κλειδιού σύγκρισης από κάθε στοιχείο στο *iterable* (για παράδειγμα, ``key=str.lower``). Η προεπιλεγμένη τιμή είναι ``None`` (συγκρίνει τα στοιχεία απευθείας).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
el: Το *reverse* είναι μια δυαδική τιμή. Εάν οριστεί σε ``True``, τότε τα στοιχεία της λίστας ταξινομούνται σαν να είχε αντιστραφεί κάθε σύγκριση.
