Repository: pygreece/python-docs-gr
Catalog: library/functions.po
Languages: el

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
el: Η :func:`zip` σε συνδυασμό με τον τελεστή ``*`` μπορεί να χρησιμοποιηθεί για την αποσυμπίεση μιας λίστας::

source: Added the ``strict`` argument.
el: Προστέθηκε το όρισμα ``strict``.

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
el: Αυτή είναι μια προηγμένη συνάρτηση που δεν χρειάζεται στον καθημερινό προγραμματισμό της Python, σε αντίθεση με το :func:`importlib.import_module`.

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
el: Αυτή η συνάρτηση καλείται από τη δήλωση :keyword:`import`. Μπορεί να αντικατασταθεί (με εισαγωγή του module :mod:`builtins` και αντιστοίχιση σε ``builtins.__import__``) προκειμένου να αλλάξει η σημασιολογία της δήλωσης :keyword:`!import`, αλλά αυτό αποθαρρύνεται **σθεναρά**, καθώς είναι συνήθως απλούστερο να χρησιμοποιήσετε τα άγκιστρα εισαγωγής (δείτε :pep:`302`) για την επίτευξη των ίδιων στόχων και δεν προκαλεί προβλήματα με τον κώδικα που προϋποθέτει την χρήση της προεπιλεγμένης υλοποίησης εισαγωγής. Η άμεση χρήση του :func:`__import__` επίσης αποθαρρύνεται υπέρ του :func:`importlib.import_module`.

source: The function imports the module *name*, potentially using the given *globals* and *locals* to determine how to interpret the name in a package context. The *fromlist* gives the names of objects or submodules that should be imported from the module given by *name*. The standard implementation does not use its *locals* argument at all and uses its *globals* only to determine the package context of the :keyword:`import` statement.
el: Η συνάρτηση εισάγει το module *name*, χρησιμοποιώντας πιθανώς τα δεδομένα *globals* και *locals* για να καθορίσει τον τρόπο ερμηνείας του ονόματος σε ένα πλαίσιο πακέτου. Η *fromlist* δίνει τα ονόματα των αντικειμένων ή των υπομονάδων που θα πρέπει να εισαχθούν από το module που δίνεται από το *name*. Η τυπική υλοποίηση δεν χρησιμοποιεί καθόλου το όρισμα *locals* και χρησιμοποιεί τα *globals* της μόνο για να προσδιορίσει το πλαίσιο του πακέτου της δήλωσης :keyword:`import`.

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
el: Το *level* καθορίζει εάν θα χρησιμοποιηθούν απόλυτες ή σχετικές εισαγωγές. Το ``0`` (η προεπιλογή) σημαίνει μόνο απόλυτες εισαγωγές. Οι θετικές τιμές για το *level* υποδεικνύουν τον αριθμό των γονικών καταλόγων προς αναζήτηση σε σχέση με τον κατάλογο του module που καλεί την :func:`__import__` (δείτε το :pep:`328` για λεπτομέρειες).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
el: Όταν η μεταβλητή *name* είναι της μορφής ``package.module``, κανονικά, επιστρέφεται το πακέτο ανωτάτου επιπέδου (το όνομα μέχρι την πρώτη κουκκίδα), *όχι* το module που ονομάζεται *name*. Ωστόσο, όταν δίνεται ένα μη κενό όρισμα *fromlist*, επιστρέφεται το module με το όνομα *name*.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
el: Για παράδειγμα, η δήλωση ``import spam`` καταλήγει σε bytecode που μοιάζει με τον ακόλουθο κώδικα::

source: The statement ``import spam.ham`` results in this call::
el: Η δήλωση ``import spam.ham`` καταλήγει σε αυτήν την κλήση::

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
el: Σημειώστε πως το :func:`__import__` επιστρέφει το ανωτάτου επιπέδου module εδώ, επειδή αυτό είναι το αντικείμενο που συνδέεται με ένα όνομα με τη δήλωση :keyword:`import`.

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
el: Από την άλλη πλευρά, η δήλωση ``from spam.ham import eggs, sausage as saus`` καταλήγει σε ::

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
el: Εδώ, το module ``spam.ham`` επιστρέφεται από τη :func:`__import__`. Από αυτό το αντικείμενο, τα ονόματα προς εισαγωγή ανακτώνται και εκχωρούνται στα αντίστοιχα ονόματά τους.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
el: Εάν θέλετε απλώς να εισάγετε ένα module (ενδεχομένως μέσα σε ένα πακέτο) με το όνομα, χρησιμοποιήστε το :func:`importlib.import_module`.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
el: Αρνητικές τιμές για το *level* δεν υποστηρίζονται πλέον (το οποίο επίσης αλλάζει την προεπιλεγμένη τιμή σε 0).

source: When the command line options :option:`-E` or :option:`-I` are being used, the environment variable :envvar:`PYTHONCASEOK` is now ignored.
el: Όταν χρησιμοποιούνται επιλογές της γραμμής εντολών :option:`-E` ή :option:`-I`, τότε η μεταβλητή περιβάλλοντος :envvar:`PYTHONCASEOK` δεν λαμβάνεται υπόψιν.

source: Footnotes
el: Υποσημειώσεις

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
el: Λάβετε υπόψη ότι ο αναλυτής δέχεται μόνο τη σύμβαση τέλους γραμμής τύπου Unix. Εάν διαβάζετε τον κώδικα από ένα αρχείο βεβαιωθείτε ότι χρησιμοποιείτε την λειτουργία μετατροπής νέας γραμμής για την μετατροπή νέων γραμμών σε στυλ Windows ή Mac.

source: type
el: τύπος

source: built-in function
el: ενσωματωμένη συνάρτηση

source: Infinity
el: Άπειρο

source: format() (built-in function)
el: format() (ενσωματωμένη συνάρτηση)

source: file object
el: αντικείμενο αρχείου

source: open() built-in function
el: open() ενσωματωμένη συνάρτηση

source: file
el: αρχείο

source: modes
el: λειτουργίες

source: universal newlines
el: καθολικές νέες γραμμές

source: line-buffered I/O
el: γραμμική προσωρινή μνήμη I/O

source: buffer size, I/O
el: μέγεθος bugger, I/O

source: I/O control
el: Έλεγχος I/O

source: text mode
el: λειτουργία κειμένου

source: str() (built-in function)
el: str() (ενσωματωμένη συνάρτηση)

source: object
el: αντικείμενο

source: statement
el: δήλωση
