Repository: pygreece/python-docs-gr
Catalog: library/functions.po
Languages: el

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
el: Χρησιμοποιήστε το :func:`functools.cmp_to_key` για να μετατρέψετε μια συνάρτηση *cmp* παλιού τύπου σε συνάρτηση *key*.

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
el: Η ενσωματωμένη συνάρτηση :func:`sorted` είναι εγγυημένη ότι είναι σταθερή. Μια ταξινόμηση είναι σταθερή εάν εγγυάται ότι δεν θα αλλάξει η σχετική σειρά των στοιχείων που συγκρίνονται ίσα --- αυτό είναι χρήσιμο για ταξινόμηση σε πολλαπλά περάσματα (για παράδειγμα, ταξινόμηση ανά τμήμα, μετά ανά μισθολογικό βαθμό).

source: The sort algorithm uses only ``<`` comparisons between items. While defining an :meth:`~object.__lt__` method will suffice for sorting, :PEP:`8` recommends that all six :ref:`rich comparisons <comparisons>` be implemented. This will help avoid bugs when using the same data with other ordering tools such as :func:`max` that rely on a different underlying method. Implementing all six comparisons also helps avoid confusion for mixed type comparisons which can call reflected the :meth:`~object.__gt__` method.
el: Ο αλγόριθμος ταξινόμησης χρησιμοποιεί μόνο συγκρίσεις ``<`` μεταξύ στοιχείων. Ενώ ο ορισμός μιας μεθόδου :meth:`~object.__lt__` αρκεί για την ταξινόμηση, το :PEP:`8` συνιστά και τις έξι :ref:`rich comparisons <comparisons>` που θα εφαρμοστούν. Αυτό θα βοηθήσει στην αποφυγή σφαλμάτων κατά τη χρήση των ίδιων δεδομένων με άλλα εργαλεία διάταξης, όπως :func:`max` που βασίζονται σε διαφορετική υποκείμενη μέθοδο. Η υλοποίηση και των έξι συγκρίσεων βοηθά επίσης στην αποφυγή σύγχυσης για συγκρίσεις μικτού τύπου που μπορούν να καλέσουν την ανακλώμενη μέθοδο :meth:`~object.__gt__`.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
el: Για παραδείγματα ταξινόμησης και ένα σύντομο σεμινάριο ταξινόμησης, ανατρέξτε στο :ref:`sortinghowto`.

source: Transform a method into a static method.
el: Μετατροπή μιας μεθόδου σε στατική μέθοδο.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
el: Μια στατική μέθοδος δεν λαμβάνει ένα σιωπηρό πρώτο όρισμα. Για να δηλώσετε μια στατική μέθοδο, χρησιμοποιήστε αυτό το ιδίωμα::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
el: Η φόρμα ``@staticmethod`` είναι μια συνάρτηση :term:`decorator` -- δείτε :ref:`function` για λεπτομέρειες.

source: A static method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). Moreover, they can be called as regular functions (such as ``f()``).
el: Μια στατική μέθοδος μπορεί να κληθεί είτε στην κλάση (όπως ``C.f()``) είτε σε ένα instance (όπως ``C().f()``). Επιπλέον, μπορούν να κληθούν ως κανονικές συναρτήσεις (όπως ``f()``).

source: Static methods in Python are similar to those found in Java or C++. Also, see :func:`classmethod` for a variant that is useful for creating alternate class constructors.
el: Οι στατικές μέθοδοι στην Python είναι παρόμοιες με αυτές που βρίσκονται στην Java ή στη C++. Επίσης, ανατρέξτε στη :func:`classmethod` για μια παραλλαγή που είναι χρήσιμη για τη δημιουργία εναλλακτικών κατασκευαστών κλάσεων.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
el: Όπως όλοι οι διακοσμητές, είναι επίσης δυνατό να καλέσετε την ``staticmethod`` ως κανονική συνάρτηση και να κάνετε κάτι με το αποτέλεσμά της. Αυτό είναι απαραίτητο σε ορισμένες περιπτώσεις όπου χρειάζεστε μια αναφορά σε μια συνάρτηση από ένα σώμα κλάσης και θέλετε να αποφύγετε την αυτόματη μετατροπή σε instance μέθοδο. Για αυτές τις περιπτώσεις, χρησιμοποιήστε αυτό το ιδίωμα::

source: For more information on static methods, see :ref:`types`.
el: Για περισσότερες πληροφορίες σχετικά με τις στατικές μεθόδους, δείτε το :ref:`types`.

source: Static methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``), have a new ``__wrapped__`` attribute, and are now callable as regular functions.
el: Οι στατικές μέθοδοι κληρονομούν πλέον τα χαρακτηριστικά της μεθόδου (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` και ``__annotations__``), έχουν ένα νέο χαρακτηριστικό ``__wrapped__``, και μπορούν πλέον να καλούνται ως κανονικές λειτουργίες.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
el: Επιστρέφει μια έκδοση :class:`str` του *object*. Δείτε :func:`str` για λεπτομέρειες.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
el: Το ``str`` είναι η ενσωματωμένη συμβολοσειρά :term:`class`. Για γενικές πληροφορίες σχετικά με τις συμβολοσειρές, ανατρέξτε :ref:`textseq`.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
el: Αθροίζει το *start* και τα στοιχεία ενός *iterable* από αριστερά προς δεξιά και επιστρέφει το σύνολο. Τα στοιχεία του *iterable* είναι συνήθως αριθμοί και η τιμή έναρξης δεν επιτρέπεται να είναι συμβολοσειρά.

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
el: Για ορισμένες περιπτώσεις χρήσης, υπάρχουν καλές εναλλακτικές λύσεις για το :func:`sum`. Ο προτιμώμενος, γρήγορος τρόπος για να συνδέσετε μια ακολουθία συμβολοσειρών είναι καλώντας ``''.join(sequence)``. Για να προσθέσετε τιμές κινητής υποδιαστολής με εκτεταμένη ακρίβεια, δείτε :func:`math.fsum`\. Για να συνδυάσετε μια σειρά iterable, σκεφτείτε να χρησιμοποιήσετε το :func:`itertools.chain`.

source: The *start* parameter can be specified as a keyword argument.
el: Η παράμετρος *start* μπορεί να καθοριστεί ως όρισμα keyword.

source: Summation of floats switched to an algorithm that gives higher accuracy on most builds.
el: Η άθροιση των floats άλλαξε σε έναν αλγόριθμο που δίνει μεγαλύτερη ακρίβεια στις περισσότερες κατασκευές.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
el: Επιστρέφει ένα αντικείμενο διακομιστή μεσολάβησης που εκχωρεί κλήσεις μεθόδου σε μια γονική ή αδερφή κλάση *type*. Αυτό είναι χρήσιμο για την πρόσβαση σε μεταβιβασμένες μεθόδους που έχουν παρακαμφθεί σε μια κλάση.

source: The *object_or_type* determines the :term:`method resolution order` to be searched. The search starts from the class right after the *type*.
el: Το *object_or_type* καθορίζει το :term:`method resolution order` που θα αναζητηθεί. Η αναζήτηση ξεκινά από την κλάση αμέσως μετά τον *type*.

source: For example, if :attr:`~class.__mro__` of *object_or_type* is ``D -> B -> C -> A -> object`` and the value of *type* is ``B``, then :func:`super` searches ``C -> A -> object``.
el: Για παράδειγμα, εάν :attr:`~class.__mro__` του *object_or_type* είναι ``D -> B -> C -> A -> object`` και η τιμή του *type* είναι ``B``, τότε η :func:`super` αναζητά ``C -> A -> object``.

source: The :attr:`~class.__mro__` attribute of the *object_or_type* lists the method resolution search order used by both :func:`getattr` and :func:`super`. The attribute is dynamic and can change whenever the inheritance hierarchy is updated.
el: ¨Το χαρακτηριστικό :attr:`~class.__mro__` του *object_or_type* παραθέτει τη σειρά αναζήτησης ανάλυσης μεθόδου που χρησιμοποιείται και από τις :func:`getattr` και :func:`super`. Το χαρακτηριστικό είναι δυναμικό και μπορεί να αλλάξει κάθε φορά που ενημερώνεται η ιεραρχία κληρονομικότητας.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
el: Εάν το δεύτερο όρισμα παραλειφθεί, το υπεραντικείμενο που επιστράφηκε δεν είναι δεσμευμένο. Εάν το δεύτερο όρισμα είναι αντικείμενο, ``isinstance(obj, type)`` πρέπει να είναι αληθές. Εάν το δεύτερο όρισμα είναι ένας τύπος, το ``issubclass(type2, type)`` πρέπει να είναι αληθές (αυτό είναι χρήσιμο για μεθόδους κλάσης).

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
el: Υπάρχουν δύο τυπικές περιπτώσεις χρήσης για το *super*. Σε μια ιεραρχία κλάσεων με ενιαία κληρονομικότητα, το *super* μπορεί να χρησιμοποιηθεί για να αναφέρεται σε γονικές κλάσεις χωρίς να τις ονομάζει ρητά, καθιστώντας έτσι τον κώδικα πιο διατηρήσιμο. Αυτή η χρήση είναι πολύ παράλληλη με τη χρήση του *super* σε άλλες γλώσσες προγραμματισμού.

source: The second use case is to support cooperative multiple inheritance in a dynamic execution environment. This use case is unique to Python and is not found in statically compiled languages or languages that only support single inheritance. This makes it possible to implement "diamond diagrams" where multiple base classes implement the same method. Good design dictates that such implementations have the same calling signature in every case (because the order of calls is determined at runtime, because that order adapts to changes in the class hierarchy, and because that order can include sibling classes that are unknown prior to runtime).
el: Η δεύτερη περίπτωση χρήσης είναι η υποστήριξη πολλαπλής κληρονομικότητας συνεργασίας σε ένα δυναμικό περιβάλλον εκτέλεσης. Αυτή η περίπτωση χρήσης είναι μοναδική για την Python και δεν βρίσκεται σε στατικά μεταγλωττισμένες γλώσσες ή γλώσσες που υποστηρίζουν μόνο μεμονωμένη κληρονομικότητα. Αυτό καθιστά δυνατή την υλοποίηση "διαγραμμάτων διαμαντιών" όπου πολλές βασικές κλάσεις υλοποιούν την ίδια μέθοδο. Ο καλός σχεδιασμός υπαγορεύει ότι τέτοιες υλοποιήσεις έχουν την ίδια υπογραφή κλήσης σε κάθε περίπτωση (επειδή η σειρά των κλήσεων καθορίζεται κατά τον χρόνο εκτέλεσης, επειδή αυτή η σειρά προσαρμόζεται στις αλλαγές στην ιεραρχία κλάσεων και επειδή αυτή η διάταξη μπορεί να περιλαμβάνει αδερφικές κλάσεις πριν από τον χρόνο εκτέλεσης).

source: For both use cases, a typical superclass call looks like this::
el: Και για τις δύο περιπτώσεις χρήσης, μια τυπική κλήση υπερκλάσης μοιάζει με αυτό::

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
el: Εκτός από τις αναζητήσεις μεθόδων, το :func:`super` λειτουργεί επίσης για αναζητήσεις χαρακτηριστικών. Μια πιθανή περίπτωση χρήσης για αυτό είναι η κλήση :term:`descriptors <descriptor>` σε μια κλάση γονέα ή αδελφού.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`~object.__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
el: Λάβετε υπόψη ότι το :func:`super` υλοποιείται ως μέρος της διαδικασίας δέσμευσης για ρητές αναζητήσεις χαρακτηριστικών με κουκκίδες όπως ``super().__getitem__(name)``. Το κάνει εφαρμόζοντας τη δικιά του μέθοδο :meth:`~object.__getattribute__` για αναζήτηση κλάσεων με προβλέψιμη σειρά που υποστηρίζει πολλαπλή κληρονομικότητα. Συνεπώς, η :func:`super` δεν έχει οριστεί για σιωπηρές αναζητήσεις που χρησιμοποιούν δηλώσεις ή τελεστές όπως ``super()[name]``.

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
el: Λάβετε επίσης υπόψη ότι, εκτός από τη μορφή μηδενικού ορίσματος, η :func:`super` δεν περιορίζεται στη χρήση μεθόδων εντός. Η φόρμα δύο ορισμάτων καθορίζει ακριβώς τα ορίσματα και κάνει τις κατάλληλες αναφορές. Η φόρμα μηδενικού ορίσματος λειτουργεί μόνο μέσα σε έναν ορισμό κλάσης, καθώς ο μεταγλωττιστής συμπληρώνει τις απαραίτητες λεπτομέρειες για την σωστή ανάκτηση της κλάσης που ορίζεται, καθώς και για την πρόσβαση στην τρέχουσα παρουσία για συνηθισμένες μεθόδους.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
el: Για πρακτικές προτάσεις σχετικά με το πώς να σχεδιάσετε συνεργατικές τάξεις χρησιμοποιώντας το :func:`super`, ανατρέξτε `οδηγός χρήσης super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
el: Αντί να είναι συνάρτηση, το :class:`tuple` είναι στην πραγματικότητα ένα αμετάβλητος τύπος ακολουθίας, όπως τεκμηριώνεται στα :ref:`typesseq-tuple` και :ref:`typesseq`.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__ <instance.__class__>`.
el: Με ένα όρισμα, επιστρέψτε τον τύπο ενός *object*. Η τιμή που επιστρέφεται είναι ένα αντικείμενο τύπου και γενικά το ίδιο αντικείμενο με αυτό που επιστρέφεται από το :attr:`object.__class__ <instance.__class__>`.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
el: Η ενσωματωμένη συνάρτηση :func:`isinstance` συνίσταται για τη δοκιμή του τύπου ενός αντικειμένου, επειδή λαμβάνει υπόψη τις υποκλάσεις.

source: With three arguments, return a new type object. This is essentially a dynamic form of the :keyword:`class` statement. The *name* string is the class name and becomes the :attr:`~definition.__name__` attribute. The *bases* tuple contains the base classes and becomes the :attr:`~class.__bases__` attribute; if empty, :class:`object`, the ultimate base of all classes, is added. The *dict* dictionary contains attribute and method definitions for the class body; it may be copied or wrapped before becoming the :attr:`~object.__dict__` attribute. The following two statements create identical :class:`type` objects:
el: Με τρία ορίσματα, επιστρέφει ένα αντικείμενο νέου τύπου. Αυτή είναι ουσιαστικά μια δυναμική μορφή της δήλωσης :keyword:`class`. Η συμβολοσειρά *name* είναι το όνομα της κλάσης και γίνεται το χαρακτηριστικό :attr:`~definition.__name__`. Η πλειάδα *bases* περιέχει τις βασικές κλάσεις και γίνεται το χαρακτηριστικό :attr:`~class.__bases__` ∙ αν είναι κενό, προστίθεται το :class:`object`, η τελική βάση όλων των κλάσεων. Το λεξικό *dict* περιέχει ορισμούς χαρακτηριστικών και μεθόδων για το σώμα της κλάσης∙ μπορεί να αντιγραφεί ή να προσαρμοστεί πριν γίνει το χαρακτηριστικό :attr:`~object.__dict__`. Οι ακόλουθες δύο προτάσεις δημιουργούν πανομοιότυπα αντικείμενα :class:`type`:

source: See also :ref:`bltin-type-objects`.
el: Δείτε επίσης :ref:`bltin-type-objects`.

source: Keyword arguments provided to the three argument form are passed to the appropriate metaclass machinery (usually :meth:`~object.__init_subclass__`) in the same way that keywords in a class definition (besides *metaclass*) would.
el: Τα ορίσματα λέξεων-κλειδιών που παρέχονται στη φόρμα τριών ορισμάτων μεταβιβάζονται στον κατάλληλο μηχανισμό μετακλάσης (συνήθως :meth:`~object.__init_subclass__`) με τον ίδιο τρόπο που θα έκαναν οι λέξεις-κλειδιά στον ορισμό μιας κλάσης (εκτός από το *metaclass*).

source: See also :ref:`class-customization`.
el: Δείτε επίσης :ref:`class-customization`.

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
el: Οι υποκλάσης της :class:`type` που δεν αντικαθιστούν το ``type.__new__`` δεν μπορούν πλέον να χρησιμοποιούν τη φόρμα ενός επιχειρήματος για να λάβουν τον τύπο ενός αντικειμένου.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`~object.__dict__` attribute.
el: Επιστρέφει το χαρακτηριστικό :attr:`~object.__dict__` για ένα module, κλάση, instance, ή οποιοδήποτε άλλο αντικείμενο με ένα χαρακτηριστικό :attr:`~object.__dict__`.

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`~object.__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
el: Αντικείμενα όπως modules και instances έχουν ένα χαρακτηριστικό :attr:`~object.__dict__` με δυνατότητα ενημέρωσης∙ ωστόσο, άλλα αντικείμενα μπορεί να έχουν περιορισμούς εγγραφής στα χαρακτηριστικά τους :attr:`~object.__dict__` (για παράδειγμα, οι κλάσεις χρησιμοποιούν ένα :class:`types.MappingProxyType` για την αποτροπή άμεσων ενημερώσεων λεξικού).

source: Without an argument, :func:`vars` acts like :func:`locals`. Note, the locals dictionary is only useful for reads since updates to the locals dictionary are ignored.
el: Χωρίς ένα όρισμα, το :func:`vars` λειτουργεί όπως :func:`locals`. Σημειώστε, ότι το λεξικό των τοπικών είναι χρήσιμο μόνο για ανάγνωση, καθώς οι ενημερώσεις στο λεξικό των τοπικών αγνοούνται.

source: A :exc:`TypeError` exception is raised if an object is specified but it doesn't have a :attr:`~object.__dict__` attribute (for example, if its class defines the :attr:`~object.__slots__` attribute).
el: Μια εξαίρεση :exc:`TypeError` γίνεται raise εάν ένα αντικείμενο έχει καθοριστεί αλλά δεν έχει ένα χαρακτηριστικό :attr:`~object.__dict__` (για παράδειγμα, εάν η κλάση του ορίζει το :attr:`~object.__slots__` χαρακτηριστικό).

source: Iterate over several iterables in parallel, producing tuples with an item from each one.
el: Επανάληψη σε πολλούς iterables παράλληλα, δημιουργώντας πλειάδες με ένα αντικείμενο από το καθένα.

source: Example::
el: Παράδειγμα::

source: More formally: :func:`zip` returns an iterator of tuples, where the *i*-th tuple contains the *i*-th element from each of the argument iterables.
el: Πιο τυπικά: η :func:`zip` επιστρέφει έναν iterator πλειάδων, όπου η *i*-η πλειάδα περιέχει το *i*-ο στοιχείο από κάθε ένα από τους επαναλήψιμους ορισμάτων.

source: Another way to think of :func:`zip` is that it turns rows into columns, and columns into rows. This is similar to `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_.
el: Ένας άλλος τρόπος για να σκεφτείτε τη :func:`zip` είναι ότι μετατρέπει τις γραμμές σε στήλες, και τις στήλες σε γραμμές. Αυτό είναι παρόμοιο με `μεταφορά μιας μήτρας <https://en.wikipedia.org/wiki/Transpose>`_.

source: :func:`zip` is lazy: The elements won't be processed until the iterable is iterated on, e.g. by a :keyword:`!for` loop or by wrapping in a :class:`list`.
el: Το :func:`zip` είναι τεμπέλης: Τα στοιχεία δεν θα υποβληθούν σε επεξεργασία μέχρι να επαναληφθεί ο iterable, π.χ. με έναν βρόχο :keyword:`!for` ή με αναδίπλωση σε μια :class:`list`.

source: One thing to consider is that the iterables passed to :func:`zip` could have different lengths; sometimes by design, and sometimes because of a bug in the code that prepared these iterables. Python offers three different approaches to dealing with this issue:
el: Ένα πράγμα που πρέπει να λάβετε υπόψη είναι ότι τα iterables που μεταβιβάστηκαν στη :func:`zip` θα μπορούσαν να έχουνε διαφορετικά μήκη∙ μερικές φορές από το σχεδιασμό και μερικές φορές λόγω ενός σφάλματος στον κώδικα που προετοίμασε αυτά τα iterables. Η Python προσφέρει τρεις διαφορετικές προσεγγίσεις για την αντιμετώπιση αυτού του ζητήματος::

source: By default, :func:`zip` stops when the shortest iterable is exhausted. It will ignore the remaining items in the longer iterables, cutting off the result to the length of the shortest iterable::
el: Από default, η :func:`zip` σταματά όταν εξαντληθεί ο συντομότερος iterable. Αυτό θα αγνοήσει τα υπόλοιπα στοιχεία στους μεγαλύτερους iterables, κόβοντας το αποτέλεσμα στο μήκος του συντομότερου iterable::

source: :func:`zip` is often used in cases where the iterables are assumed to be of equal length. In such cases, it's recommended to use the ``strict=True`` option. Its output is the same as regular :func:`zip`::
el: Η :func:`zip` χρησιμοποιείται συχνά σε περιπτώσεις όπου τα iterables υποτίθεται ότι έχουν ίσο μήκος. Σε τέτοιες περιπτώσεις, συνίσταται η χρήση της επιλογής ``strict=True``. Η έξοδος είναι ίδια με την κανονική :func:`zip`::

source: Unlike the default behavior, it raises a :exc:`ValueError` if one iterable is exhausted before the others:
el: Σε αντίθεση με την προεπιλεγμένη συμπεριφορά, γίνεται raise ένα :exc:`ValueError` εάν ένα iterable εξαντληθεί πριν από τα άλλα:

source: Without the ``strict=True`` argument, any bug that results in iterables of different lengths will be silenced, possibly manifesting as a hard-to-find bug in another part of the program.
el: Χωρίς το όρισμα ``strict=True``, κάθε σφάλμα που οδηγεί σε επαναλαμβανόμενα μήκη διαφορετικού μήκους θα τεθεί σε σίγαση, πιθανώς να εμφανίζεται ως δυσεύρετο σφάλμα σε άλλο μέρος του προγράμματος.

source: Shorter iterables can be padded with a constant value to make all the iterables have the same length. This is done by :func:`itertools.zip_longest`.
el: Οι μικρότεροι iterables μπορούν να συμπληρωθούν σε μια σταθερή τιμή ώστε όλα τα iterables να έχουνε το ίδιο μήκος. Αυτό γίνεται από το :func:`itertools.zip_longest`.

source: Edge cases: With a single iterable argument, :func:`zip` returns an iterator of 1-tuples. With no arguments, it returns an empty iterator.
el: Περιπτώσεις άκρων: Με ένα μόνο επαναληπτικό όρισμα, η :func:`zip` επιστρέφει έναν iterator 1-πλειάδων. Χωρίς ορίσματα, επιστρέφει έναν κενό iterator.

source: Tips and tricks:
el: Συμβουλές και κόλπα:

source: The left-to-right evaluation order of the iterables is guaranteed. This makes possible an idiom for clustering a data series into n-length groups using ``zip(*[iter(s)]*n, strict=True)``. This repeats the *same* iterator ``n`` times so that each output tuple has the result of ``n`` calls to the iterator. This has the effect of dividing the input into n-length chunks.
el: Η σειρά αξιολόγησης από αριστερά προς τα δεξιά των iterables είναι εγγυημένη. Αυτό καθιστά δυνατό ένα ιδίωμα για την ομαδοποίηση μιας σειράς δεδομένων σε ομάδες n-μήκους χρησιμοποιώντας ``zip(*[iter(s)]*n, strict=True)``. Αυτό επαναλαμβάνει τις *ίδιες* επαναλήψεις ``n`` φορές έτσι ώστε κάθε πλειάδα εξόδου να έχει το αποτέλεσμα των κλήσεων ``n`` προς τον επαναλήπτη. Αυτό έχει ως αποτέλεσμα τη διαίρεση της εισόδου σε κομμάτια μήκους.
